Repository: phpmyadmin/phpmyadmin
Catalog: resources/po/*.po
Languages: th

source: How to display the menu tabs
th: วิธีการแสดงแท็บเมนู

source: How to display various action links
th: วิธีการแสดงลิงก์การดำเนินการต่าง ๆ

source: Protect binary columns
th: ปกป้องคอลัมน์ไบนารี

source: Permanent query history
th: ประวัติการค้นหาถาวร

source: Query history length
th: ความยาวประวัติคำสั่งเรียกดู

source: Allow shared bookmarks between users
th: อนุญาตให้แชร์บุ๊กมาร์กระหว่างผู้ใช้

source: Recoding engine
th: กลไกเข้ารหัสใหม่

source: Remember table's sorting
th: จดจำการเรียงลำดับของตาราง

source: Primary key default sort order
th: ลำดับการเรียงเริ่มต้นของคีย์หลัก

source: Repeat headers
th: ทำซ้ำส่วนหัว

source: Grid editing: trigger action
th: การแก้ไขตาราง: กระตุ้นการทำงาน

source: Relational display
th: แสดงความสัมพันธ์

source: Grid editing: save all edited cells at once
th: แก้ไขตาราง: บันทึกการแก้ไขทุกเซลส์ในคราวเดียว

source: Save directory
th: บันทึกไดเรกทอรี

source: Host authorization order
th: ลำดับการอนุญาตโฮสต์

source: Host authorization rules
th: กฎการอนุญาตโฮสต์

source: Allow logins without a password
th: อนุญาตให้ลงชื่อเข้าใช้โดยปราศจากรหัสผ่าน

source: Allow root login
th: อนุญาตลงชื่อเข้าใช้เป็น root

source: Session timezone
th: เขตเวลาของเซสชัน

source: HTTP Realm
th: โซนของ HTTP

source: Bookmark table
th: ตารางบุ๊กมาร์ก

source: Column information table
th: ตารางข้อมูลคอลัมน์

source: Compress connection
th: บีบอัดการเชื่อมต่อ

source: Control user password
th: ควบคุมรหัสผ่านผู้ใช้

source: Control user
th: ควบคุมผู้ใช้

source: Control host
th: ควบคุมโฮสต์

source: Control port
th: ควบคุมพอร์ต

source: Disable use of INFORMATION_SCHEMA
th: ปิดการใช้งาน INFORMATION_SCHEMA

source: Hide databases
th: ซ่อนฐานข้อมูล

source: SQL query history table
th: ตารางประวัติคำสั่ง SQL

source: Server hostname
th: ชื่อโฮสต์ของเซิร์ฟเวอร์

source: Logout URL
th: URL ที่ออกจากระบบ

source: Maximal number of table preferences to store
th: จำนวนสูงสุดของค่ากำหนดตารางที่จะจัดเก็บ

source: Export templates table
th: ตารางต้นแบบการส่งออก

source: Central columns table
th: ตารางคอลัมน์กลาง

source: Show only listed databases
th: แสดงฐานข้อมูลที่ระบุไว้เท่านั้น

source: Password for config auth
th: รหัสผ่านเพื่อการกำหนดค่าผู้มีสอบ

source: PDF schema: pages table
th: โครงสร้าง PDF: ตารางหน้า

source: Server port
th: พอร์ตของเซิร์ฟเวอร์

source: Recently used table
th: ตารางที่ใช้งานล่าสุด

source: Favorites table
th: ตารางโปรด

source: Relation table
th: ตารางความสัมพันธ์

source: Signon session name
th: ชื่อเซสชั่น Signon

source: Signon URL
th: URL ของ Signon

source: Server socket
th: ซ็อกเก็ตของเซิร์ฟเวอร์

source: Use SSL
th: ใช้ SSL

source: Designer and PDF schema: table coordinates
th: นักออกแบบและโครงสร้าง PDF: พิกัดตาราง

source: Display columns table
th: แสดงตารางคอลัมน์

source: UI preferences table
th: ตารางกำหนดค่า UI

source: Add DROP DATABASE
th: เพิ่่มคำสั่ง DROP DATABASE

source: Add DROP VIEW
th: เพิ่มคำสั่ง DROP VIEW

source: Statements to track
th: คำสั่งเพื่อติดตาม

source: SQL query tracking table
th: ตารางการติดตามคำสั่ง SQL

source: Automatically create versions
th: สร้างเวอร์ชั่นโดยอัตโนมัติ

source: User preferences storage table
th: ตารางจัดเก็บการกำหนดค่าของผู้ใช้

source: Users table
th: ตารางผู้ใช้

source: User groups table
th: ตารางกลุ่มผู้ใช้

source: Hidden navigation items table
th: ตารางรายการนำทางที่ซ่อนอยู่

source: User for config auth
th: ผู้ใช้สำหรับการตรวจสอบสิทธิ์การกำหนดค่า

source: Verbose name of this server
th: ชื่อโดยละเอียดของเซิร์ฟเวอร์นี้

source: Allow to display all the rows
th: อนุญาตให้แสดงทุกแถวได้

source: Show password change form
th: แสดงแบบฟอร์มการเปลี่ยนรหัสผ่าน

source: Show create database form
th: แสดงแบบฟอร์มการสร้างฐานข้อมูล

source: Show table comments
th: แสดงหมายเหตุของตาราง

source: Show creation timestamp
th: แสดงเวลาสร้าง

source: Show last update timestamp
th: แสดงเวลาอัปเดตล่าสุด

source: Show last check timestamp
th: แสดงเวลาตรวจสอบล่าสุด

source: Show table charset
th: แสดงตารางชุดอักขระ

source: Show field types
th: แสดงประเภทช่องข้อมูล

source: Show function fields
th: แสดงช่องฟังก์ชัน

source: Show hint
th: แสดงคำแนะนำ

source: Show phpinfo() link
th: แสดงลิงก์ phpinfo()

source: Show detailed MySQL server information
th: แสดงข้อมูลเซิร์ฟเวอร์ MySQL โดยละเอียด

source: Show SQL queries
th: แสดงคำสั่ง SQL

source: Show statistics
th: แสถงสถิติ

source: Skip locked tables
th: ข้ามตารางที่ถูกล็อก

source: Explain SQL
th: อธิบาย SQL

source: Create PHP code
th: สร้างโค้ด PHP

source: Suhosin warning
th: คำเตือน Suhosin

source: Login cookie validity warning
th: คำเตือนเกี่ยวกับความถูกต้องของคุกกี้ในการเข้าสู่ระบบ

source: Textarea columns
th: คมลัมน์ Textarea

source: Textarea rows
th: แถว Textarea

source: Default title
th: ชื่อเรื่องเริ่มต้น

source: List of trusted proxies for IP allow/deny
th: รายชื่อพร็อกซีที่เชื่อถือได้สำหรับการอนุญาต/ปฏิเสธ IP

source: Upload directory
th: ไดเรกทอรีอัปโหลด

source: Use database search
th: ใช้ฐานข้อมูลค้นหา

source: Enable the Developer tab in settings
th: เปิดใช้งานแท็บนักพัฒนาในการตั้งค่า

source: Version check
th: ตรวจสอบเวอร์ชั่น

source: Proxy URL
th: พร็อกซี่ URL

source: Proxy username
th: ชื่อผู้ใช้พร็อกซี

source: Proxy password
th: รหัสผ่านพร็อกซี

source: ZIP
th: ไฟล์ ZIP

source: URL for reCAPTCHA v2 API
th: URL สำหรับ reCAPTCHA v2 API

source: Content-Security-Policy snippet for reCAPTCHA v2 API
th: ส่วนย่อย Content-Security-Policy สำหรับ API reCAPTCHA v2

source: Request parameter for reCAPTCHA v2 API
th: พารามิเตอร์คำขอสำหรับ API reCAPTCHA v2

source: Response parameter for reCAPTCHA v2 API
th: พารามิเตอร์การตอบกลับสำหรับ API reCAPTCHA v2

source: Public key for reCAPTCHA
th: คีย์สาธารณะสำหรับ reCAPTCHA

source: Private key for reCAPTCHA
th: คีย์ส่วนตัวสำหรับ reCAPTCHA

source: URL for reCAPTCHA siteverify
th: URL สำหรับ reCAPTCHA siteverify

source: Send error reports
th: ส่งรายงานความผิดพลาด

source: Enter executes queries in console
th: เข้าสู่การเรียกใช้คำสั่ง SQL ในคอนโซล

source: Enable Zero Configuration mode
th: เปิดใช้งานโหมด Zero Configuration

source: Execute queries on Enter and insert new line with Shift+Enter
th: รันคำสั่งเมื่อกด Enter และแทรกบรรทัดใหม่เมื่อกด Shift+Enter

source: Console height
th: ความสูงของคอนโซล

source: Console mode
th: โหมดคอนโซล

source: Order by
th: เรียงลำดับจาก

source: Server connection collation
th: ชุดเทียบเคียงการเชื่อมต่อเซิร์ฟเวอร์

source: Missing data for %s
th: ข้อมูลที่หายไปสำหรับ %s

source: Incorrect value!
th: ค่าไม่ถูกต้อง

source: unavailable
th: ไม่พร้อมใช้งาน

source: "%s" requires %s extension
th: "%s" ต้องใช้ส่วนขยาย %s

source: Compressed import will not work due to missing function %s.
th: การนำเข้าแบบบีบอัดจะไม่ทำงานเนื่องจากขาดฟังก์ชัน %s

source: Compressed export will not work due to missing function %s.
th: การส่งออกแบบบีบอัดจะไม่ทำงานเนื่องจากขาดฟังก์ชัน %s

source: maximum %s
th: สูงสุด %s

source: Config authentication
th: กำหนดค่าการยืนยันตัวตน

source: HTTP authentication
th: การรับรองความถูกต้องของ HTTP

source: Signon authentication
th: การรับรองความถูกต้องของ Signon

source: Quick
th: รวดเร็ว

source: Custom
th: ปรับแต่ง

source: CSV for MS Excel
th: ข้อมูล CSV สำหรับไมโครซอฟต์เอ็กเซล

source: Microsoft Word 2000
th: ไมโครซอฟต์เวิร์ด 2000

source: OpenDocument Spreadsheet
th: สเปรดชีต OpenDocument

source: OpenDocument Text
th: ข้อความ OpenDocument

source: CSV using LOAD DATA
th: ไฟล์ CSV ด้วยการโหลดข้อมูล

source: Default transformations
th: ค่าการแปลงเริ่มต้น

source: Cannot save settings, submitted configuration form contains errors!
th: ไม่สามารถบันทึกการตั้งค่าได้ รูปแบบการกำหนดค่าที่ส่งเข้ามามีข้อผิดพลาด!

source: Existing configuration file (%s) is not readable.
th: ไฟล์การกำหนดค่า %s ไม่สามารถอ่านได้

source: Wrong permissions on configuration file, should not be world writable!
th: สิทธิ์การเข้าถึงไฟล์การตั้งค่าไม่ถูกต้อง ไฟล์ไม่ควรอนุญาตให้ทั้งระบบเขียนได้!

source: This %soption%s should be disabled as it allows attackers to bruteforce login to any MySQL server. If you feel this is necessary, use %srestrict login to MySQL server%s or %strusted proxies list%s. However, IP-based protection with trusted proxies list may not be reliable if your IP belongs to an ISP where thousands of users, including you, are connected to.
th: ควรปิดใช้งาน %soption%s ตัวเลือกนี้ เนื่องจากมันเป็นการอนุญาตให้ผู้โจมตีสามารถคาดเดาล็อกอินเข้าสู่เซิร์ฟเวอร์ MySQL ใดก็ได้ หากคุณคิดว่าจำเป็น ให้ใช้ตัวเลือก %srestrict login to MySQL server%s หรือ %strusted proxies list%s แทน อย่างไรก็ตาม การป้องกันตาม IP โดยใช้รายการพร็อกซีที่เชื่อถือได้อาจไม่น่าเชื่อถือหาก IP ของคุณเป็นของ ISP ที่มีผู้ใช้งานหลายพันคน รวมถึงตัวคุณเองด้วย

source: This value should be double checked to ensure that this directory is neither world accessible nor readable or writable by other users on your server.
th: ควรตรวจสอบค่านี้อีกครั้งเพื่อให้แน่ใจว่าไดเร็กทอรีนี้ไม่สามารถเข้าถึงได้โดยบุคคลทั่วไป หรือสามารถอ่านหรือเขียนโดยผู้ใช้รายอื่นบนเซิร์ฟเวอร์ของคุณได้

source: You should use SSL connections if your database server supports it.
th: คุณควรใช้การเชื่อมต่อแบบ SSL หากเซิร์ฟเวอร์ฐานข้อมูลของคุณรองรับมัน

source: If you feel this is necessary, use additional protection settings - %1$shost authentication%2$s settings and %3$strusted proxies list%4$s. However, IP-based protection may not be reliable if your IP belongs to an ISP where thousands of users, including you, are connected to.
th: หากคุณคิดว่าสิ่งนี้จำเป็น ให้ใช้การตั้งค่าการป้องกันเพิ่มเติม - การตั้งค่า %1$sการตรวจสอบสิทธิ์โฮสต์%2$s และ %3$sรายการพร็อกซีที่เชื่อถือได้%4$s อย่างไรก็ตาม การป้องกันฐาน IP อาจไม่น่าเชื่อถือหาก IP ของคุณเป็นของ ISP ซึ่งมีผู้ใช้หลายพันคน รวมถึงตัวคุณเองที่เชื่อมต่ออยู่

source: You set the [kbd]config[/kbd] authentication type and included username and password for auto-login, which is not a desirable option for live hosts. Anyone who knows or guesses your phpMyAdmin URL can directly access your phpMyAdmin panel. Set %1$sauthentication type%2$s to [kbd]cookie[/kbd] or [kbd]http[/kbd].
th: คุณได้ตั้งค่าประเภทการตรวจสอบสิทธิ์ [kbd]config[/kbd] และรวมชื่อผู้ใช้และรหัสผ่านสำหรับการเข้าสู่ระบบอัตโนมัติ ซึ่งไม่ใช่ตัวเลือกที่เหมาะสมสำหรับโฮสต์ที่ใช้งานจริง ใครก็ตามที่รู้หรือเดา URL ของ phpMyAdmin ของคุณสามารถเข้าถึงแผงควบคุม phpMyAdmin ของคุณได้โดยตรง ตั้งค่า %1$sauthentication type%2$s เป็น [kbd]cookie[/kbd] หรือ [kbd]http[/kbd]

source: You allow for connecting to the server without a password.
th: คุณอนุญาตให้สามารถเชื่อมต่อไปยังเซิร์ฟเวอร์ได้โดยไม่ต้องใช้รหัสผ่าน

source: You didn't have blowfish secret set and have enabled [kbd]cookie[/kbd] authentication, so a key was automatically generated for you. It is used to encrypt cookies; you don't need to remember it.
th: คุณไม่ได้ตั้งค่ารหัสลับแบบ Blowfish ทั้งยังไม่ได้เปิดใช้งานการตรวจสอบสิทธิ์ด้วยคุกกี้ ดังนั้น ระบบจึงสร้างคีย์ให้คุณโดยอัตโนมัติ คีย์นี้ใช้สำหรับเข้ารหัสคุกกี้ คุณไม่จำเป็นต้องจำคีย์นี้

source: %sZip decompression%s requires functions (%s) which are unavailable on this system.
th: การคลายไฟล์ %sZip decompression%s ต้องใช้ฟังก์ชัน (%s) ซึ่งไม่มีอยู่ในระบบนี้

source: %sZip compression%s requires functions (%s) which are unavailable on this system.
th: การบีบอัดไฟล์ %sZip compression%s ต้องใช้ฟังก์ชัน (%s) ซึ่งไม่มีอยู่ในระบบนี้

source: %1$sLogin cookie validity%2$s greater than %3$ssession.gc_maxlifetime%4$s may cause random session invalidation (currently session.gc_maxlifetime is %5$d).
th: ความถูกต้องของคุ้กกี้ล็อกอิน %1$sLogin cookie validity%2$s มากกว่า %3$session.gc_maxlifetime%4$s อาจทำให้เซสชันถูกยกเลิกแบบสุ่ม (ปัจจุบัน session.gc_maxlifetime คือ %5$d)

source: %sLogin cookie validity%s should be set to 1800 seconds (30 minutes) at most. Values larger than 1800 may pose a security risk such as impersonation.
th: ควรตั้งค่าระยะเวลาความถูกต้องของคุกกี้ %sLogin cookie validity%s ไว้ที่ 1800 วินาที (30 นาที) เป็นอย่างมาก ค่าที่มากกว่า 1800 อาจก่อให้เกิดความเสี่ยงด้านความปลอดภัย เช่น การปลอมแปลงตัวตน

source: If using [kbd]cookie[/kbd] authentication and %sLogin cookie store%s is not 0, %sLogin cookie validity%s must be set to a value less or equal to it.
th: หากใช้การตรวจสอบสิทธิ์ด้วยคุกกี้ [kbd]cookie[/kbd] และ %sLogin cookie store%s ไม่ใช่ 0 จะต้องตั้งค่า %sLogin cookie validity%s เป็นค่าที่น้อยกว่าหรือเท่ากับค่าดังกล่าว

source: %1$sBzip2 compression and decompression%2$s requires functions (%3$s) which are unavailable on this system.
th: %1$sBzip2 การบีบอัด และการคลายการบีบอัด %2$s จำเป็นต้องใช้ฟังก์ชัน (%3$s) ซึ่งไม่สามารถใช้งานได้ในระบบนี้

source: %1$sGZip compression and decompression%2$s requires functions (%3$s) which are unavailable on this system.
th: %1$sGZip การบีบอัด และการคลายการบีบอัด %2$s จำเป็นต้องใช้ฟังก์ชัน (%3$s) ซึ่งไม่สามารถใช้งานได้ในระบบนี้

source: Server %d
th: เซิร์ฟเวอร์ %d

source: no description
th: ไม่มีรายละเอียด

source: You do not have necessary privileges to create a database named '%s'. You may go to 'Operations' tab of any database to set up the phpMyAdmin configuration storage there.
th: คุณไม่มีสิทธิ์ที่จำเป็นในการสร้างฐานข้อมูลชื่อ '%s' คุณสามารถไปที่แท็บ 'การปฏิบัติการ' ของฐานข้อมูลใดก็ได้เพื่อตั้งค่าการจัดเก็บการกำหนดค่า phpMyAdmin ที่นั่น

source: View users
th: ดูผู้ใช้

source: Server-level tabs
th: แท็บระดับเซิร์ฟเวอร์

source: Database-level tabs
th: แท็บระดับฐานข้อมูล

source: Table-level tabs
th: แท็บระดับตาราง

source: Could not save configuration
th: ไม่สามารถบันทึกการกำหนดค่าได้

source: The phpMyAdmin configuration storage database could not be accessed.
th: ไม่สามารถเข้าถึงฐานข้อมูลจัดเก็บการตั้งค่า phpMyAdmin ได้

source: Could not connect to the database server!
th: ไม่สามารถเชื่อมต่อไปยังเซิร์ฟเวอร์ฐานข้อมูลได้!

source: Invalid authentication type!
th: ประเภทการตรวจสอบสิทธิ์ไม่ถูกต้อง!

source: Empty username while using [kbd]config[/kbd] authentication method!
th: เว้นชื่อผู้ใช้ให้ว่างขณะใช้วิธี [kbd]config[/kbd] การตรวจสอบสิทธิ์!

source: Empty signon session name while using [kbd]signon[/kbd] authentication method!
th: ล้างชื่อเซสชัน signon การเข้าสู่ระบบขณะใช้วิธีการตรวจสอบสิทธิ์ [kbd]signon[/kbd]!

source: Empty signon URL while using [kbd]signon[/kbd] authentication method!
th: ล้าง URL signon ขณะใช้วิธีการตรวจสอบสิทธิ์ [kbd]signon[/kbd]!

source: Empty phpMyAdmin control user while using phpMyAdmin configuration storage!
th: ล้างข้อมูลผู้ใช้ควบคุม phpMyAdmin ในขณะที่ใช้พื้นที่จัดเก็บการกำหนดค่า phpMyAdmin!

source: Empty phpMyAdmin control user password while using phpMyAdmin configuration storage!
th: ล้างรหัสผ่านผู้ใช้ควบคุม phpMyAdmin ขณะใช้งานพื้นที่จัดเก็บการกำหนดค่า phpMyAdmin!

source: Incorrect value:
th: ค่าไม่ถูกต้อง:

source: Incorrect IP address: %s
th: ที่อยู่ IP ไม่ถูกต้อง: %s

source: Not a valid port number!
th: ไม่ใช่หมายเลขพอร์ตที่ถูกต้อง!

source: Not a positive number!
th: ไม่ใช่จำนวนเต็มบวก!

source: Not a non-negative number!
th: ไม่ใช่จำนวนที่ไม่ติดลบ!

source: Value must be less than or equal to %s!
th: ค่าควรจะน้อยกว่าหรือเท่ากับ %s!

source: Showing %1$d bookmark (both private and shared)
th: แสดง %1$d บุ๊กมาร์ก (ทั้งส่วนตัวและแชร์)

source: No bookmarks
th: ไม่พบบุ๊กมาร์ก

source: The %s file is not available on this system, please visit %s for more information.
th: ไฟล์ %s ไม่พร้อมใช้งานในระบบนี้ กรุณาไปที่ %s เพื่อดูข้อมูลเพิ่มเติม

source: Failed
th: ล้มเหลว

source: Succeeded
th: สำเร็จ

source: Console settings has been updated successfully.
th: การตั้งค่าคอนโซลได้รับการอัปเดตเรียบร้อยแล้ว

source: Unexpected parameter value.
th: ค่าพารามิเตอร์ไม่ตรงตามที่คาดไว้

source: Showing rows %1$s - %2$s.
th: แสดงแถว %1$s - %2$s

source: There already exists a page named "%s" please rename it to something else.
th: มีหน้าเพจชื่อ "%s" อยู่แล้ว กรุณาแก้ไขเป็นชื่ออื่น

source: No databases selected.
th: ไม่ได้เลือกฐานข้อมูล

source: Add event
th: เพิ่มเหตุการณ์

source: Edit event
th: แก้ไขเหตุการณ์

source: Error in processing request:
th: เกิดข้อผิดพลาดในการประมวลผลคำขอ:

source: No event with name %1$s found in database %2$s.
th: ไม่พบเหตุการณ์ที่มีชื่อ %1$s ในฐานข้อมูล %2$s

source: Export of event %s
th: ส่งออกเหตุการณ์ %s

source: Error in processing request: No event with name %1$s found in database %2$s.
th: เกิดข้อผิดพลาดในการประมวลผลคำขอ: ไม่พบเหตุการณ์ที่มีชื่อ %1$s ในฐานข้อมูล %2$s

source: Could not load export plugins, please check your installation!
th: ไม่สามารถโหลดปลั๊กอินการส่งออกได้ โปรดตรวจสอบการติดตั้งของคุณ!

source: Could not load import plugins, please check your installation!
th: ไม่สามารถนำเข้าปลั๊กอินได้ กรุณาตรวจสอบการติดตั้งของคุณ!

source: No Privileges
th: ไม่มีสิทธิ์

source: You do not have the privileges to administrate the users!
th: คุณไม่มีสิทธิ์ในการจัดการผู้ใช้!

source: No table selected.
th: ไม่ได้เลือกตารางใด ๆ

source: Add routine
th: เพิ่มรูทีน

source: Edit routine
th: แก้ไขรูทีน

source: No routine with name %1$s found in database %2$s. You might be lacking the necessary privileges to edit this routine.
th: ไม่พบรูทีนชื่อ %1$s ในฐานข้อมูล %2$s คุณอาจไม่มีสิทธิ์ที่จำเป็นในการแก้ไขรูทีนนี้

source: No routine with name %1$s found in database %2$s.
th: ไม่พบรูทีนชื่อ %1$s ในฐานข้อมูล %2$s

source: Export of routine %s
th: การส่งออกรูทีน %s

source: Error in processing request: No routine with name %1$s found in database %2$s. You might be lacking the necessary privileges to view/export this routine.
th: เกิดข้อผิดพลาดในการประมวลผลคำขอ: ไม่พบการดำเนินการประจำชื่อ %1$s ในฐานข้อมูล %2$s คุณอาจไม่มีสิทธิ์ที่จำเป็นในการดู/ส่งออกการดำเนินการประจำนี้

source: Searching inside the database is disabled by the [code]$cfg['UseDbSearch'][/code] configuration.
th: การค้นหาภายในฐานข้อมูลถูกปิดใช้งานโดยการกำหนดค่า [code]$cfg['UseDbSearch'][/code]

source: Success!
th: สำเร็จ!

source: This view has at least this number of rows. Please refer to %sdocumentation%s.
th: มุมมองนี้มีแถวอย่างน้อยจำนวนเท่านี้ โปรดดูเอกสารประกอบที่ %sdocumentation%s

source: unknown
th: ไม่ระบุ

source: Favorite List is full!
th: รายการโปรดเต็มแล้ว!

source: Tracking data deleted successfully.
th: ลบข้อมูลการติดตามเรียบร้อยแล้ว

source: Version %1$s was created for selected tables, tracking is active for them.
th: เวอร์ชัน %1$s ถูกสร้างขึ้นสำหรับตารางที่เลือก การติดตามเปิดใช้งานกับตารางพวกนั้น

source: No tables selected.
th: ไม่มีตารางที่เลือกไว้

source: Database Log
th: บันทึกฐานข้อมูล

source: An error has been detected and an error report has been automatically submitted based on your settings.
th: ตรวจพบข้อผิดพลาด และได้แจ้งรายงานตามที่ตั้งค่าไว้โดยอัตโนมัติ

source: Thank you for submitting this report.
th: ขอบคุณสำหรับการรายงาน

source: An error has been detected and an error report has been generated but failed to be sent.
th: ตรวจพบข้อผิดพลาด และรายงานได้ถูกสร้างขึ้นแล้ว แต่การส่งล้มเหลว

source: If you experience any problems please submit a bug report manually.
th: หากคุณพบปัญหาใด ๆ ในการใช้งาน กรุณารายงานข้อผิดพลาดด้วยตนเอง

source: You may want to refresh the page.
th: คุณอาจต้องการรีเฟรชหน้าเพจ

source: Bad type!
th: รูปแบบไม่ดี!

source: Value for the column "%s"
th: ค่าสำหรับคอลัมน์ "%s"

source: You were logged out from one server, to logout completely from phpMyAdmin, you need to logout from all servers.
th: คุณได้ลงชื่อออกจากเซิร์ฟเวอร์ หากต้องการลงชื่อออกจาก phpMyAdmin โดยสมบูรณ์ คุณต้องลงชื่อออกจากเซิร์ฟเวอร์ทั้งหมด

source: The phpMyAdmin configuration storage is not completely configured, some extended features have been deactivated. %sFind out why%s.
th: พื้นที่จัดเก็บการกำหนดค่า phpMyAdmin ยังตั้งค่าไม่เสร็จสมบูรณ์ คุณลักษณะเพิ่มเติมบางอย่างได้ถูกปิดใช้งานแล้ว %sค้นหาสาเหตุ%s

source: Or alternately go to 'Operations' tab of any database to set it up there.
th: หรือไปที่แท็บ 'การดำเนินการ' ของฐานข้อมูลใด ๆ เพื่อตั้งค่าที่นั่น

source: Your PHP parameter [a@https://www.php.net/manual/en/session.configuration.php#ini.session.gc-maxlifetime@_blank]session.gc_maxlifetime[/a] is lower than cookie validity configured in phpMyAdmin, because of this, your login might expire sooner than configured in phpMyAdmin.
th: พารามิเตอร์ PHP [a@https://www.php.net/manual/en/session.configuration.php#ini.session.gc-maxlifetime@_blank]session.gc_maxlifetim[/a] ของคุณต่ำกว่าระยะเวลามีผลของคุกกี้ที่ได้กำหนดไว้ใน phpMyAdmin สิ่งนี้จะทำให้การเข้าสู่ระบบของคุณอาจหมดอายุเร็วกว่าที่กำหนดไว้ใน phpMyAdmin

source: Login cookie store is lower than cookie validity configured in phpMyAdmin, because of this, your login will expire sooner than configured in phpMyAdmin.
th: การจัดเก็บคุกกี้สำหรับการเข้าสู่ระบบนั้นต่ำกว่าความถูกต้องของคุกกี้ที่กำหนดค่าไว้ใน phpMyAdmin ด้วยสาเหตุนี้การเข้าสู่ระบบของคุณจะหมดอายุเร็วกว่าที่กำหนดค่าไว้ใน phpMyAdmin

source: Your server is running with default values for the controluser and password (controlpass) and is open to intrusion; you really should fix this security weakness by changing the password for controluser 'pma'.
th: เซิร์ฟเวอร์ของคุณกำลังทำงานโดยใช้ค่าเริ่มต้นสำหรับผู้ใช้ควบคุมและรหัสผ่าน (controlpass) ซึ่งมีความเสี่ยงต่อการถูกบุกรุก; คุณควรแก้ไขช่องโหว่ด้านความปลอดภัยนี้โดยการเปลี่ยนรหัสผ่านสำหรับผู้ใช้ควบคุม 'pma'

source: The configuration file needs a valid key for cookie encryption. A temporary key was automatically generated for you. Please refer to the [doc@cfg_blowfish_secret]documentation[/doc].
th: ไฟล์การกำหนดค่าต้องการคีย์ที่ถูกต้องสำหรับการเข้ารหัสคุกกี้ ระบบได้สร้างคีย์ชั่วคราวให้คุณโดยอัตโนมัติ โปรดดูเอกสารประกอบ [doc@cfg_blowfish_secret]documentation[/doc]

source: The cookie encryption key in the configuration file is longer than necessary. It should only be %d bytes long. Please refer to the [doc@cfg_blowfish_secret]documentation[/doc].
th: คีย์เข้ารหัสคุกกี้ในไฟล์การกำหนดค่ามีความยาวเกินความจำเป็น ควรมีความยาวเพียง %d ไบต์เท่านั้น โปรดดูอ้างอิง [doc@cfg_blowfish_secret]เอกสารประกอบ[/doc]

source: Directory [code]config[/code], which is used by the setup script, still exists in your phpMyAdmin directory. It is strongly recommended to remove it once phpMyAdmin has been configured. Otherwise the security of your server may be compromised by unauthorized people downloading your configuration.
th: ไดเรกทอรี [code]config[/code] ซึ่งใช้โดยสคริปต์ติดตั้ง ยังคงอยู่ในไดเรกทอรี phpMyAdmin ของคุณ ขอแนะนำอย่างยิ่งให้ลบไดเรกทอรีนี้ออกเมื่อกำหนดค่า phpMyAdmin เรียบร้อยแล้ว มิฉะนั้น ความปลอดภัยของเซิร์ฟเวอร์ของคุณอาจถูกบุกรุกโดยผู้ที่ไม่ได้รับอนุญาตที่ดาวน์โหลดการกำหนดค่าของคุณ

source: Server running with Suhosin. Please refer to %sdocumentation%s for possible issues.
th: เซิร์ฟเวอร์ทำงานด้วย Suhosin กรุณาดู %sเอกสารประกอบ%s สำหรับปัญหาที่อาจเกิดขึ้น

source: The $cfg['TempDir'] (%s) is not accessible. phpMyAdmin is not able to cache templates and will be slow because of this.
th: ไม่สามารถเข้าถึง $cfg['TempDir'] (%s) ได้ phpMyAdmin จึงไม่สามารถทำการแคชแม่แบบได้และจะทำงานช้าลงเพราะสาเหตุนี้

source: The [code]HTTP_HOST[/code] variable is missing, which might cause phpMyAdmin to not work properly. Please refer to [doc@faq1-46]documentation[/doc] for possible issues.
th: ตัวแปร [code]HTTP_HOST[/code] หายไป ซึ่งอาจทำให้ phpMyAdmin ทำงานไม่ถูกต้อง โปรดดู [doc@faq1-46]เอกสารประกอบ[/doc] สำหรับปัญหาที่อาจเกิดขึ้น

source: The mbstring PHP extension was not found and you seem to be using a multibyte charset. Without the mbstring extension phpMyAdmin is unable to split strings correctly and it may result in unexpected results.
th: ไม่พบส่วนขยาย mbstring ของ PHP และดูเหมือนคุณกำลังใช้ชุดอักขระมัลติไบต์ เมื่อปราศจากส่วนขยาย mbstring ของ phpMyAdmin ซึ่งไม่สามารถแยกอักขระได้อย่างถูกต้อง และอาจส่งผลให้เกิดผลลัพธ์ที่ไม่คาดคิดได้

source: The curl extension was not found and allow_url_fopen is disabled. Due to this some features such as error reporting or version check are disabled.
th: ไม่พบส่วนขยาย curl และ allow_url_fopen ถูกปิดการใช้งานอยู่ ทำให้บางคุณลักษณะ เช่น การรายงานข้อผิดพลาดหรือตรวจสอบเวอร์ชันจะถูกปิดไว้

source: You probably tried to upload a file that is too large. Please refer to %sdocumentation%s for a workaround for this limit.
th: อาจเป็นเพราะคุณพยายามอัปโหลดไฟล์ที่มีขนาดใหญ่เกินไป กรุณาดูที่ %sdocumentation%s เพื่อแนวทางแก้ปัญหาสำหรับข้อจำกัดนี้
