Repository: phpmyadmin/phpmyadmin
Catalog: resources/po/*.po
Languages: th

# Collation
source: Estonian
th: เอสโตเนีย

# Collation
source: Hungarian
th: ฮังการี

# Collation
source: Icelandic
th: ไอซ์แลนด์

# Collation
source: Classical Latin
th: ละตินคลาสสิก

# Collation
source: Latvian
th: ลัตเวีย

# Collation
source: Lithuanian
th: ลิธัวเนีย

# Collation
source: Burmese
th: พม่า

# Collation
source: Persian
th: เปอร์เซีย

# Collation
source: Polish
th: โปแลนด์

# Collation
source: Romanian
th: โรมาเนีย

# Collation
source: Sinhalese
th: สิงหล

# Collation
source: Slovak
th: สโลวัก

# Collation
source: Slovenian
th: สโลวีเนีย

# Collation
source: Vietnamese
th: เวียดนาม

source: Icons
th: ไอคอน

source: Both
th: ทั้งสอง

source: Nowhere
th: ไม่ปรากฏที่ใด

source: Left
th: ซ้าย

source: Right
th: ขวา

source: Click
th: คลิก

source: Double click
th: ดับเบิลคลิก

source: key
th: คีย์

source: display column
th: แสดงคอลัมน์

source: Welcome
th: ยินดีต้อนรับ

source: Open
th: เปิด

source: Closed
th: ปิด

# Week day name
source: Monday
th: วันจันทร์

# Week day name
source: Tuesday
th: วันอังคาร

# Week day name
source: Wednesday
th: วันพุธ

# Week day name
source: Thursday
th: วันพฤหัสบดี

# Week day name
source: Friday
th: วันศุกร์

# Week day name
source: Saturday
th: วันเสาร์

# Week day name
source: Sunday
th: อาทิตย์

source: Ask before sending error reports
th: สอบถามก่อนส่งรายงานข้อผิดพลาด

source: Always send error reports
th: ส่งรายงานข้อผิดพลาดทุกครั้ง

source: Never send error reports
th: ห้ามส่งรายงานข้อผิดพลาด

source: Server default
th: ค่าเริ่มต้นของเซิร์ฟเวอร์

source: Enable
th: เปิดใช้งาน

source: Disable
th: ปิดใช้งาน

source: structure
th: โครงสร้าง

source: data
th: ข้อมูล

source: structure and data
th: โครงสร้างและข้อมูล

source: Quick - display only the minimal options to configure
th: รวดเร็ว - แสดงเฉพาะตัวเลือกที่น้อยที่สุดในการกำหนดค่า

source: Custom - display all possible options to configure
th: กำหนดเอง - แสดงตัวเลือกที่เป็นไปได้ทั้งหมดในการกำหนดค่า

source: Custom - like above, but without the quick/custom choice
th: กำหนดเอง - คล้ายข้างต้น แต่ไม่มีทางเลือกที่รวดเร็ว/กำหนดเอง

source: complete inserts
th: แทรกสมบูรณ์

source: extended inserts
th: แทรกขยาย

source: both of the above
th: ทั้งสองข้างต้น

source: neither of the above
th: ไม่รับทั้งหมดข้างต้น

source: Users cannot set a higher value
th: ผู้ใช้ไม่สามารถตั้งค่าที่สูงกว่าได้

source: If enabled, user can enter any MySQL server in login form for cookie auth.
th: หากเปิดใช้งาน ผู้ใช้จะสามารถเข้าเซิร์ฟเวอร์ MySQL ผ่านแบบฟอร์มลงชื่อเข้าสู่ระบบเพื่อคุกกี้รับรองความถูกต้องได้

source: Restricts the MySQL servers the user can enter when a login to an arbitrary MySQL server is enabled by matching the IP or hostname of the MySQL server to the given regular expression.
th: จำกัดเซิร์ฟเวอร์ MySQL ที่ผู้ใช้สามารถเข้าถึงได้เมื่อเปิดใช้งานการลงชื่อเข้าสู่ระบบไปยังเซิร์ฟเวอร์ MySQL ใดๆ โดยการจับคู่ IP หรือชื่อโฮสต์ของเซิร์ฟเวอร์ MySQL กับนิพจน์ปกติที่กำหนด

source: Enabling this allows a page located on a different domain to call phpMyAdmin inside a frame, and is a potential [strong]security hole[/strong] allowing cross-frame scripting (XSS) attacks.
th: การเปิดใช้งานสิ่งนี้จะช่วยให้หน้าเว็บที่อยู่ในโดเมนอื่นสามารถเรียก phpMyAdmin ภายในเฟรมและเป็น [strong]ช่องโหว่ด้านความปลอดภัย[/strong] ซึ่งจะทำให้เกิดการโจมตีแบบ Cross-Frame Scripting (XSS)

source: Secret passphrase used for encrypting cookies in [kbd]cookie[/kbd] authentication.
th: ข้อความรหัสผ่านลับใช้สำหรับเข้ารหัสการตรวจสอบสิทธิ์ [kbd]คุกกี้[/kbd]

source: Enable bzip2 compression for import operations.
th: เปิดใช้งานการบีบอัด bzip2 สำหรับการนำเข้า

source: Enter the URL for your reCAPTCHA v2 compatible API.
th: ป้อน URL สำหรับ API ที่ใช้งานร่วมกับ reCAPTCHA v2 ได้

source: Enter the Content-Security-Policy snippet for your reCAPTCHA v2 compatible API.
th: ป้อนโค้ด Content-Security-Policy สำหรับ API ที่ใช้งานร่วมกับ reCAPTCHA v2 ได้

source: Enter the request parameter used by your reCAPTCHA v2 compatible API.
th: ป้อนพารามิเตอร์คำขอที่ใช้โดย API ที่เข้ากันได้กับ reCAPTCHA v2 ของคุณ

source: Enter the response parameter used by your reCAPTCHA v2 compatible API.
th: ป้อนพารามิเตอร์การตอบกลับที่ใช้โดย API ที่เข้ากันได้กับ reCAPTCHA v2 ของคุณ

source: Enter your public key for the reCAPTCHA service on your domain.
th: ป้อนรหัสสาธารณะของคุณสำหรับบริการ reCAPTCHA บนโดเมนของคุณ

source: Enter your private key for your domain reCAPTCHA service.
th: ป้อนรหัสส่วนตัวของคุณสำหรับบริการ reCAPTCHA ของโดเมนของคุณ

source: Enter your siteverify URL for your reCAPTCHA service.
th: ป้อน siteverify URL สำหรับบริการ reCAPTCHA ของคุณ

source: Defines which type of editing controls should be used for CHAR and VARCHAR columns; [kbd]input[/kbd] - allows limiting of input length, [kbd]textarea[/kbd] - allows newlines in columns.
th: กำหนดประเภทของการควบคุมการแก้ไขที่ควรใช้สำหรับคอลัมน์ CHAR และ VARCHAR [kbd]input [/kbd] - อนุญาตการจำกัดความยาวของข้อความ [kbd] textarea [/kbd] - อนุญาตการขึ้นบรรทัดใหม่ในคอลัมน์

source: Use user-friendly editor for editing SQL queries (CodeMirror) with syntax highlighting and line numbers.
th: ใช้โปรแกรมแก้ไขที่ใช้งานง่ายสำหรับแก้ไขคำสั่ง SQL (CodeMirror) ด้วยการเน้นไวยากรณ์และหมายเลขบรรทัด

source: Find any errors in the query before executing it. Requires CodeMirror to be enabled.
th: ค้นหาข้อผิดพลาดในคำสั่งก่อนที่จะดำเนินการ จำเป็นต้องเปิดใช้งาน CodeMirror

source: Defines the minimum size for input fields generated for CHAR and VARCHAR columns.
th: กำหนดขนาดต่ำสุดสำหรับช่องกรอกข้อมูลที่สร้างขึ้นสำหรับคอลัมน์ CHAR และ VARCHAR

source: Defines the maximum size for input fields generated for CHAR and VARCHAR columns.
th: กำหนดขนาดสูงสุดสำหรับช่องกรอกข้อมูลที่สร้างขึ้นสำหรับคอลัมน์ CHAR และ VARCHAR

source: Compress gzip exports on the fly without the need for much memory; if you encounter problems with created gzip files disable this feature.
th: บีบอัดไฟล์ส่งออก gzip ได้ในทันทีโดยไม่ต้องใช้หน่วยความจำมาก; หากพบปัญหาเกี่ยวกับไฟล์ gzip ที่สร้างขึ้น ให้ปิดใช้งานฟีเจอร์นี้

source: Whether a warning ("Are your really sure…") should be displayed when you're about to lose data.
th: ควรแสดงคำเตือน ("คุณแน่ใจจริง ๆ หรือไม่... ") เมื่อข้อมูลของคุณกำลังจะสูญหาย

source: Autocomplete of the table and column names in the SQL queries.
th: ระบบจะเติมชื่อตารางและชื่อคอลัมน์โดยอัตโนมัติในคำสั่ง SQL

source: Values for options list for default transformations. These will be overwritten if transformation is filled in at table structure page.
th: ค่าสำหรับรายการตัวเลือกเพื่อการแปลงค่าเริ่มต้น ค่าเหล่านี้จะถูกเขียนทับหากมีการกรอกข้อมูลการแปลงในหน้าโครงสร้างตาราง

source: Disable the table maintenance mass operations, like optimizing or repairing the selected tables of a database.
th: ปิดใช้งานการดำเนินการบำรุงรักษาตารางจำนวนมาก เช่น การเพิ่มประสิทธิภาพหรือการซ่อมแซมตารางที่เลือกในฐานข้อมูล

source: Set the number of seconds a script is allowed to run ([kbd]0[/kbd] for no limit).
th: ตั้งค่าจำนวนวินาทีที่สคริปต์สามารถทำงานได้ ([kbd]0[/kbd] แบบไม่จำกัดเวลา)

source: Exclude definition of current user
th: ไม่รวมคำจำกัดความของผู้ใช้ปัจจุบัน

source: Sort order for items in a foreign-key dropdown box; [kbd]content[/kbd] is the referenced data, [kbd]id[/kbd] is the key value.
th: ลำดับการจัดเรียงสำหรับรายการในกล่องดรอปดาวน์คีย์นอก; [kbd]เนื้อหา[/kbd] คือข้อมูลที่อ้างอิง และ [kbd]id[/kbd] คือค่าคีย์

source: Specify browser's title bar text. Refer to [doc@faq6-27]documentation[/doc] for magic strings that can be used to get special values.
th: ระบุข้อความบนแถบชื่อของเบราว์เซอร์ โปรดดูเอกสารประกอบ [doc@faq6-27]documentation[/doc] สำหรับข้อความพิเศษที่สามารถใช้เพื่อรับค่าพิเศษได้

source: Please note that phpMyAdmin is just a user interface and its features do not limit MySQL.
th: โปรดทราบว่า phpMyAdmin เป็นเพียงส่วนติดต่อผู้ใช้ และคุณสมบัติของมันไม่ได้จำกัดการทำงานของ MySQL

source: Advanced server configuration, do not change these options unless you know what they are for.
th: การกำหนดค่าเซิร์ฟเวอร์ขั้นสูง ห้ามเปลี่ยนแปลงตัวเลือกเหล่านี้เว้นแต่คุณจะทราบว่าแต่ละตัวเลือกใช้สำหรับอะไร

source: Configure phpMyAdmin configuration storage to gain access to additional features, see [doc@linked-tables]phpMyAdmin configuration storage[/doc] in documentation.
th: กำหนดค่าที่จัดเก็บข้อมูล phpMyAdmin เพื่อเข้าถึงฟีเจอร์เพิ่มเติม ดู [doc@linked-tables]การจัดเก็บข้อมูลการกำหนดค่า phpMyAdmin[/doc] ในเอกสารประกอบ

source: Tracking of changes made in database. Requires the phpMyAdmin configuration storage.
th: การติดตามการเปลี่ยนแปลงที่เกิดขึ้นในฐานข้อมูล จำเป็นต้องใช้พื้นที่จัดเก็บการกำหนดค่า phpMyAdmin

source: Customize browse mode.
th: ปรับแต่งโหมดเรียกดู

source: Customize default options.
th: ปรับแต่งตัวเลือกเริ่มต้น

source: Settings for phpMyAdmin developers.
th: การตั้งค่าสำหรับผู้พัฒนา phpMyAdmin

source: Customize edit mode.
th: ปรับแต่งโหมดแก้ไข

source: Customize default export options.
th: ปรับแต่งตัวเลือกการส่งออกเริ่มต้น

source: Set some commonly used options.
th: ตั้งตัวเลือกบางตัวที่ใช้บ่อย

source: Customize default common import options.
th: ปรับแต่งตัวเลือกเริ่มต้นการนำเข้าทั่วไป

source: Set import and export directories and compression options.
th: ตั้งตัวเลือกตำแหน่งและบีบอัดการนำเช้าและส่งออก

source: Databases display options.
th: ตัวเลือกการแสดงฐานข้อมูล

source: Customize appearance of the navigation panel.
th: ปรับแต่งรูปลักษณ์ของแผงนำทาง

source: Customize the navigation tree.
th: ปรับแต่งแผงผังการนำทาง

source: Servers display options.
th: ตัวเลือกการแสดงเซิร์ฟเวอร์

source: Tables display options.
th: ตัวเลือกการแสดงตาราง

source: Settings that didn't fit anywhere else.
th: การตั้งค่าที่ไม่สามารถใช้กับที่ใดได้เลย

source: Authentication settings.
th: การตั้งค่าการตรวจสอบสิทธิ์

source: Enter server connection parameters.
th: ป้อนพารามิเตอร์การเชื่อมต่อเซิร์ฟเวอร์

source: Customize links shown in SQL Query boxes.
th: ปรับแต่งลิงก์ที่แสดงในกล่องคำสั่ง SQL

source: SQL queries settings.
th: การตั้งค่าคำสั่ง SQL

source: Customize startup page.
th: หน้าเริ่มระบบที่กำหนดเอง

source: Choose which details to show in the database structure (list of tables).
th: เลือกรายละเอียดที่ต้องการแสดงในโครงสร้างฐานข้อมูล (รายการตาราง)

source: Settings for the table structure (list of columns).
th: เลือกรายละเอียดที่ต้องการแสดงในโครงสร้างตาราง (รายการคอลัมน์)

source: Choose how you want tabs to work.
th: เลือกว่าคุณต้องการให้แท็บทำอย่างไร

source: Customize text input fields.
th: กล่องข้อความที่กำหนดเอง

source: Customize default options
th: ปรับแต่งตัวเลือกเริ่มต้น

source: Disable some of the warnings shown by phpMyAdmin.
th: ปิดใช้งานคำเตือนบางส่วนที่แสดงโดย phpMyAdmin

source: Enable gzip compression for import and export operations.
th: เปิดใช้งานการบีบอัด gzip สำหรับการนำเข้าและส่งออกข้อมูล

source: If enabled, phpMyAdmin continues computing multiple-statement queries even if one of the queries failed.
th: หากเปิดใช้งานไว้ phpMyAdmin จะดำเนินการคำนวณคำสั่งเรียกดูหลายคำสั่งต่อไป แม้ว่าจะมีคำสั่งใดคำสั่งหนึ่งล้มเหลวก็ตาม

source: Allow interrupt of import in case script detects it is close to time limit. This might be a good way to import large files, however it can break transactions.
th: อนุญาตให้หยุดการนำเข้าได้ในกรณีที่สคริปต์ตรวจพบว่าใกล้ถึงเวลาที่กำหนดแล้ว วิธีนี้อาจเป็นวิธีที่ดีในการนำเข้าไฟล์ขนาดใหญ่ แต่ก็อาจทำให้การทำรายการหยุดชะงักได้

source: Default format; be aware that this list depends on location (database, table) and only SQL is always available.
th: รูปแบบเริ่มต้น; โปรดทราบว่ารายการนี้ขึ้นอยู่กับตำแหน่งที่ตั้ง (ฐานข้อมูล ตาราง) และมีเฉพาะคำสั่ง SQL เท่านั้นที่พร้อมใช้งานเสมอ

source: Update data when duplicate keys found on import
th: อัปเดตข้อมูลเมื่อพบคีย์ซ้ำกันตอนนำเข้า

source: Number of queries to skip from start.
th: จำนวนคำสั่งเรียกดูที่ข้ามตั้งแต่เริ่มต้น

source: If TRUE, logout deletes cookies for all servers; when set to FALSE, logout only occurs for the current server. Setting this to FALSE makes it easy to forget to log out from other servers when connected to multiple servers.
th: หากตั้งค่าเป็น TRUE การออกจากระบบจะลบคุกกี้ออกจากทุกเซิร์ฟเวอร์ หากตั้งค่าเป็น FALSE จะออกจากระบบเพียงแค่เซิร์ฟเวอร์ปัจจุบันเท่านั้น การตั้งค่าเป็น FALSE มักทำให้ลืมออกจากระบบจากเซิร์ฟเวอร์อื่นได้ง่าย เมื่อเชื่อมต่อกับหลายเซิร์ฟเวอร์

source: Define whether the previous login should be recalled or not in [kbd]cookie[/kbd] authentication mode.
th: กำหนดว่าจะเรียกคืนข้อมูลการเข้าสู่ระบบครั้งก่อนหรือไม่ในโหมดการตรวจสอบสิทธิ์ด้วย [kbd]คุ้กกี้[/kbd]

source: Defines how long (in seconds) a login cookie should be stored in browser. The default of 0 means that it will be kept for the existing session only, and will be deleted as soon as you close the browser window. This is recommended for non-trusted environments.
th: กำหนดระยะเวลา (เป็นวินาที) ที่คุกกี้สำหรับการเข้าสู่ระบบควรถูกเก็บไว้ในเบราว์เซอร์ ค่าเริ่มต้นคือ 0 ซึ่งหมายความว่าจะถูกเก็บไว้เฉพาะในเซสชันปัจจุบันเท่านั้น และจะถูกลบออกทันทีที่คุณปิดหน้าต่างเบราว์เซอร์ แนะนำให้ใช้ในระบบที่ไม่น่าเชื่อถือ

source: Maximum number of characters used when a SQL query is displayed.
th: จำนวนอักขระสูงสุดที่ใช้เมื่อแสดงคำสั่ง SQL

source: The number of items that can be displayed on each page on the first level of the navigation tree.
th: จำนวนรายการที่สามารถแสดงบนแต่ละหน้าในระดับแรกของแผนผังการนำทาง

source: The number of items that can be displayed on each page of the navigation tree.
th: จำนวนรายการที่สามารถแสดงได้ในแต่ละหน้าของแผนผังการนำทาง

source: Number of rows displayed when browsing a result set. If the result set contains more rows, "Previous" and "Next" links will be shown.
th: จำนวนแถวที่แสดงเมื่อเรียกดูชุดผลลัพธ์ หากชุดผลลัพธ์มีแถวมากกว่าหนึ่งแถว จะแสดงลิงก์ "ก่อนหน้า" และ "ถัดไป"

source: The number of bytes a script is allowed to allocate, e.g. [kbd]32M[/kbd] ([kbd]-1[/kbd] for no limit and [kbd]0[/kbd] for no change).
th: จำนวนไบต์ที่สคริปต์ได้รับอนุญาตให้จัดสรร เช่น [kbd]32M[/kbd] ([kbd]-1[/kbd]สำหรับการไม่จำกัด และ ([kbd]0[/kbd] สำหรับการไม่เปลี่ยนแปลง)

source: In the navigation panel, replaces the database tree with a selector
th: ในแผงนำทาง จะแทนที่โครงสร้างฐานข้อมูลด้วยตัวเลือก

source: Link with main panel by highlighting the current database or table.
th: เชื่อมโยงกับแผงหลักโดยการไฮไลต์ฐานข้อมูลหรือตารางปัจจุบัน

source: Open the linked page in the main window ([code]main[/code]) or in a new one ([code]new[/code]).
th: เปิดหน้าเพจที่เชื่อมโยงในหน้าต่างหลัก ([code]main[/code]) หรือในหน้าต่างใหม่ ([code]new[/code])

source: Defines the minimum number of items (tables, views, routines and events) to display a filter box.
th: กำหนดจำนวนขั้นต่ำของรายการ (ตาราง มุมมอง รูทีน และเหตุการณ์) ที่จะแสดงในกล่องตัวกรอง

source: Group items in the navigation tree (determined by the separator defined in the Databases and Tables tabs above).
th: จัดกลุ่มรายการในโครงสร้างการนำทาง (กำหนดโดยตัวคั่นที่กำหนดไว้ในแท็บฐานข้อมูลและตารางด้านบน)

source: Whether to offer the possibility of tree expansion in the navigation panel.
th: เพิ่มความเป็นไปได้ในการขยายโครงสร้างต้นไม้ในแผงนำทาง

source: Whether to show procedures under database in the navigation tree
th: แสดงขั้นตอนภายใต้ฐานข้อมูลในรูปแบบแผนผังต้นไม้

source: Whether to expand single database in the navigation tree automatically.
th: ถึงเป็นฐานข้อมูลเดียวก็ให้ขยายในโครงสร้างการนำทางโดยอัตโนมัติ

source: Set to 0 to collapse navigation panel.
th: ตั้งค่าเป็น 0 เพื่อยุบแผงนำทาง

source: Show logo in navigation panel.
th: แสดงโลโก้บนแผงนำทาง

source: URL where logo in the navigation panel will point to.
th: URL ที่โลโก้ในแผงนำทางจะชี้ไป

source: Display server choice at the top of the navigation panel.
th: แสดงตัวเลือกเซิร์ฟเวอร์ที่ด้านบนของแผงนำทาง

source: String that separates databases into different tree levels.
th: สตริงที่ใช้แบ่งฐานข้อมูลออกเป็นระดับโครงสร้างแบบต้นไม้ต่าง ๆ

source: String that separates tables into different tree levels.
th: สตริงที่ใช้แบ่งตารางออกเป็นระดับโครงสร้างแบบต้นไม้ต่าง ๆ

source: Highlight server under the mouse cursor.
th: ไฮไลท์เซิร์ฟเวอร์ที่อยู่ใต้เคอร์เซอร์เมาส์

source: Whether to show tables under database in the navigation tree
th: อย่างไรก็ต้องแสดงตารางภายใต้ฐานข้อมูลในแผนผังการนำทาง

source: Whether to show views under database in the navigation tree
th: เพื่อแสดงมุมมองภายใต้ฐานข้อมูลในแผนผังการนำทาง

source: Whether to show functions under database in the navigation tree
th: แม้จะแสดงฟังก์ชันภายใต้ฐานข้อมูลในแผนผังการนำทาง

source: Whether to show events under database in the navigation tree
th: เพื่อแสดงเหตุการณ์ภายใต้ฐานข้อมูลในแผนผังการนำทาง

source: [kbd]SMART[/kbd] - i.e. descending order for columns of type TIME, DATE, DATETIME and TIMESTAMP, ascending order otherwise.
th: [kbd]SMART[/kbd] - กล่าวคือ เรียงลำดับจากมากไปน้อยสำหรับคอลัมน์ประเภท TIME, DATE, DATETIME และ TIMESTAMP ส่วนประเภทอื่น ๆ จะเรียงลำดับจากน้อยไปมาก

source: Disable the default warning that is displayed on the database details Structure page if any of the required tables for the phpMyAdmin configuration storage could not be found.
th: ปิดใช้งานคำเตือนเริ่มต้นที่แสดงในหน้าโครงสร้างรายละเอียดฐานข้อมูล หากไม่พบตารางที่จำเป็นสำหรับการจัดเก็บการกำหนดค่า phpMyAdmin

source: Disable the default warning that is displayed on the Structure page if column names in a table are reserved MySQL words.
th: ปิดใช้งานคำเตือนเริ่มต้นที่แสดงในหน้าโครงสร้างรายละเอียดฐานข้อมูล หากชื่อคอลัมน์ในตารางเป็นคำสงวนของ MySQL

source: Enable if you want DB-based query history (requires phpMyAdmin configuration storage). If disabled, this utilizes JS-routines to display query history (lost by window close).
th: เปิดใช้งานหากคุณต้องการประวัติการค้นหาแบบอิงตามฐานข้อมูล (ต้องใช้พื้นที่จัดเก็บการกำหนดค่า phpMyAdmin) หากปิดใช้งาน ฟังก์ชันนี้จะใช้รูทีน JavaScript เพื่อแสดงประวัติการค้นหา (ซึ่งจะหายไปเมื่อปิดหน้าต่าง)

source: Allow users to create bookmarks that are available for all other users
th: อนุญาตให้ผู้ใช้สร้างบุ๊กมาร์กที่ผู้ใช้รายอื่นทุกคนสามารถมองเห็นได้

source: Sets the effective timezone; possibly different than the one from your database server
th: ตั้งค่าเขตเวลาที่มีผลบังคับใช้ ซึ่งอาจแตกต่างจากเขตเวลาของเซิร์ฟเวอร์ฐานข้อมูลของคุณ

source: Leave blank for no [doc@bookmarks@]bookmark[/doc] support, suggested: [kbd]pma__bookmark[/kbd]
th: เว้นว่างไว้หากไม่ต้องการรองรับ [doc@bookmarks@]bookmark[/doc] แนะนำให้ใช้: [kbd]pma__bookmark[/kbd]

source: Leave blank for no column comments/media types, suggested: [kbd]pma__column_info[/kbd].
th: เว้นว่างไว้หากไม่ต้องการใส่ความคิดเห็น/ประเภทสื่อในคอลัมน์ ตัวอย่าง: [kbd]pma__column_info[/kbd]

source: A special MySQL user configured with limited permissions, more information available on [doc@linked-tables]documentation[/doc].
th: ผู้ใช้ MySQL พิเศษที่กำหนดค่าด้วยสิทธิ์ที่จำกัด สามารถดูข้อมูลเพิ่มเติมได้ที่ [doc@linked-tables]documentation[/doc]

source: An alternate host to hold the configuration storage; leave blank to use the already defined host.
th: โฮสต์ทางเลือกสำหรับจัดเก็บการกำหนดค่า; หากต้องการใช้โฮสต์ที่กำหนดไว้แล้ว ให้เว้นว่างไว้

source: An alternate port to connect to the host that holds the configuration storage; leave blank to use the default port, or the already defined port, if the controlhost equals host.
th: พอร์ตทางเลือกสำหรับเชื่อมต่อกับโฮสต์ที่เก็บข้อมูลการกำหนดค่า เว้นว่างไว้เพื่อใช้พอร์ตเริ่มต้น หรือพอร์ตที่กำหนดไว้แล้ว หาก controlhost เท่ากับ host

source: More information on [a@https://github.com/phpmyadmin/phpmyadmin/issues/8970]phpMyAdmin issue tracker[/a] and [a@https://bugs.mysql.com/19588]MySQL Bugs[/a]
th: ดูข้อมูลเพิ่มเติมได้ที่ [a@https://github.com/phpmyadmin/phpmyadmin/issues/8970]ตัวติดตามปัญหาของ phpMyAdmin[/a] และ [a@https://bugs.mysql.com/19588]ข้อบกพร่องของ MySQL[/a]

source: Leave blank for no SQL query history support, suggested: [kbd]pma__history[/kbd].
th: เว้นว่างไว้หากไม่ต้องการรองรับประวัติคำสั่ง SQL แนะนำให้ใช้: [kbd]pma__history[/kbd]

source: Limits number of table preferences which are stored in database, the oldest records are automatically removed.
th: จำกัดจำนวนการตั้งค่าตารางที่จัดเก็บไว้ในฐานข้อมูล โดยข้อมูลที่เก่าที่สุดจะถูกลบออกโดยอัตโนมัติ

source: Leave blank for no export template support, suggested: [kbd]pma__export_templates[/kbd].
th: เว้นว่างไว้หากไม่รองรับต้นแบบการส่งออก แนะนำให้ใช้: [kbd]pma__export_templates[/kbd]

source: Leave blank for no central columns support, suggested: [kbd]pma__central_columns[/kbd].
th: เว้นว่างไว้หากไม่ต้องการรองรับคอลัมน์กลาง คำแนะนำให้ใช้: [kbd]pma__central_columns[/kbd]

source: You can use MySQL wildcard characters (% and _), escape them if you want to use their literal instances, i.e. use [kbd]'my\_db'[/kbd] and not [kbd]'my_db'[/kbd].
th: คุณสามารถใช้ตัวอักษรตัวแทน (wildcard) ของ MySQL (% และ _) โดยหลีกลี่ยงมันได้หากต้องการใช้ตามตัวอักษร เช่น ใช้ [kbd]'my\_db'[/kbd] แต่ไม่ใช่ [kbd]'my_db'[/kbd]

source: Leave blank for no PDF schema support, suggested: [kbd]pma__pdf_pages[/kbd].
th: เว้นว่างไว้หากไม่รองรับโครงสร้างข้อมูล PDF แนะนำให้ใช้: [kbd]pma__pdf_pages[/kbd]

source: Database used for relations, bookmarks, and PDF features. See [doc@linked-tables]pmadb[/doc] for complete information. Leave blank for no support. Suggested: [kbd]phpmyadmin[/kbd].
th: ฐานข้อมูลที่ใช้สำหรับความสัมพันธ์ บุ๊กมาร์ก และคุณสมบัติของไฟล์ PDF ดู [doc@linked-tables]pmadb[/doc] สำหรับข้อมูลฉบับสมบูรณ์ เว้นว่างไว้หากไม่ต้องการรับการสนับสนุน คำแนะนำให้ใช้: [kbd]phpmyadmin[/kbd]

source: Leave blank for no "persistent" recently used tables across sessions, suggested: [kbd]pma__recent[/kbd].
th: เว้นว่างไว้หากไม่ต้องการบันทึกตารางที่ใช้งานล่าสุดแบบ "ถาวร" ข้ามเซสชัน แนะนำให้ใช้: [kbd]pma__recent[/kbd]

source: Leave blank for no "persistent" favorite tables across sessions, suggested: [kbd]pma__favorite[/kbd].
th: เว้นว่างไว้หากไม่ต้องการบันทึกตารางรายการโปรดแบบถาวรข้ามเซสชัน แนะนำให้ใช้: [kbd]pma__favorite[/kbd]

source: Leave blank for no [doc@relations@]relation-links[/doc] support, suggested: [kbd]pma__relation[/kbd].
th: เว้นว่างไว้หากไม่รองรับ [doc@relations@]relation-links[/doc] แนะนำให้ใช้ [kbd]pma__relation[/kbd] แทน

source: See [doc@authentication-modes]authentication types[/doc] for an example.
th: ดู [doc@authentication-modes]authentication types[/doc] เป็นตัวอย่าง

source: Leave blank for no PDF schema support, suggested: [kbd]pma__table_coords[/kbd].
th: เว้นว่างไว้หากไม่รองรับโครงสร้างข้อมูล PDF แนะนำให้ใช้: [kbd]pma__table_coords[/kbd]

source: Table to describe the display columns, leave blank for no support; suggested: [kbd]pma__table_info[/kbd].
th: ตารางเพื่ออธิบายคอลัมน์ที่แสดงผล เว้นว่างไว้หากไม่ต้องการรองรับ แนะนำให้ใช้: [kbd]pma__table_info[/kbd]

source: Leave blank for no "persistent" tables' UI preferences across sessions, suggested: [kbd]pma__table_uiprefs[/kbd].
th: เว้นว่างไว้หากไม่ต้องการให้การตั้งค่า UI ของตาราง "คงอยู่" ระหว่างเซสชัน แนะนำให้ใช้: [kbd]pma__table_uiprefs[/kbd]

source: Whether a DROP DATABASE IF EXISTS statement will be added as first line to the log when creating a database.
th: แม้จะมีการเพิ่มคำสั่ง DROP DATABASE IF EXISTS เป็นบรรทัดแรกในบันทึกเมื่อมีการสร้างฐานข้อมูล

source: Whether a DROP TABLE IF EXISTS statement will be added as first line to the log when creating a table.
th: แม้จะมีการเพิ่มคำสั่ง DROP TABLE IF EXISTS เป็นบรรทัดแรกในบันทึกเมื่อมีการสร้างตาราง

source: Whether a DROP VIEW IF EXISTS statement will be added as first line to the log when creating a view.
th: แม้จะมีการเพิ่มคำสั่ง DROP VIEW IF EXISTS เป็นบรรทัดแรกในบันทึกเมื่อมีการสร้างมุมมอง

source: Defines the list of statements the auto-creation uses for new versions.
th: กำหนดรายการคำสั่งที่ระบบสร้างขึ้นอัตโนมัติใช้สำหรับการสร้างเวอร์ชันใหม่

source: Leave blank for no SQL query tracking support, suggested: [kbd]pma__tracking[/kbd].
th: เว้นว่างไว้หากไม่ต้องการรองรับการติดตามคำสั่ง SQL แนะนำให้ใช้: [kbd]pma__tracking[/kbd]

source: Whether the tracking mechanism creates versions for tables and views automatically.
th: ไม่ว่ากลไกการติดตามสร้างเวอร์ชันสำหรับตารางและมุมมองโดยอัตโนมัติหรือไม่ก็ตาม
