Repository: phpmyadmin/phpmyadmin
Catalog: resources/po/*.po
Languages: th

source: Failed to write file to disk.
th: ไม่สามารถเขียนไฟล์ลงดิสก์ได้

source: File upload stopped by extension.
th: การอัปโหลดไฟล์หยุดลงเนื่องจากส่วนขยาย

source: Unknown error in file upload.
th: เกิดข้อผิดพลาดที่ไม่ทราบสาเหตุในการอัปโหลดไฟล์

source: File is a symbolic link
th: ไฟล์เป็นลิงก์เชิงสัญลักษณ์

source: File could not be read!
th: ไม่สามารถอ่านไฟล์ได้!

source: Error moving the uploaded file, see [doc@faq1-11]FAQ 1.11[/doc].
th: เกิดข้อผิดพลาดในการย้ายไฟล์ที่อัปโหลด โปรดดู [doc@faq1-11]คำถามที่พบบ่อย 1.11[/doc]

source: Error while moving uploaded file.
th: เกิดข้อผิดพลาดขณะย้ายไฟล์ที่อัปโหลด

source: Cannot read uploaded file.
th: ไม่สามารถอ่านไฟล์ที่อัปโหลด

source: You attempted to load file with unsupported compression (%s). Either support for it is not implemented or disabled by your configuration.
th: คุณพยายามโหลดไฟล์บีบอัดที่ไม่รองรับ (%s) อาจเป็นเพราะระบบไม่ได้รองรับการบีบอัดประเภทนี้ หรือการกำหนดค่าของคุณปิดใช้งานไว้

source: Jump to database “%s”.
th: ข้ามไปยังฐานข้อมูล "%s"

source: SSL is not being used
th: ไม่ได้ใช้ SSL

source: SSL is used with disabled verification
th: มีการใช้งาน SSL โดยปิดใช้งานการตรวจสอบความถูกต้อง

source: SSL is used without certification authority
th: SSL ถูกใช้งานโดยไม่มีหน่วยงานรับรอง

source: SSL is used
th: มีการใช้งาน SSL

source: The PHP function password_hash() with default options.
th: ฟังก์ชัน password_hash() ของ PHP พร้อมตัวเลือกค่าเริ่มต้น

source: password_hash() PHP function
th: ฟังก์ชัน password_hash() ใน PHP

source: Skip Explain SQL
th: ข้ามการอธิบาย SQL

source: Without PHP code
th: ปราศจากโค้ด PHP

# Inline edit query
source: Edit inline
th: แก้ไขแบบอินไลน์

source: Static analysis:
th: การวิเคราะห์เชิงสถิติ:

source: %d errors were found during analysis.
th: พบข้อผิดพลาด %d ระหว่างการวิเคราะห์

source: You should upgrade to %s %s or later.
th: คุณควรอัปเกรดเป็น %s %s หรือใหม่กว่า

source: See %sour documentation%s for more information.
th: ดู %sour documentation%s สำหรับข้อมูลเพิ่มเติม

source: GLOBALS overwrite attempt
th: ความพยายามเขียนทับ GLOBALS

source: possible exploit
th: ช่องโหว่ที่เป็นไปได้

source: The ini_get and/or ini_set functions are disabled in php.ini. phpMyAdmin requires these functions!
th: ฟังก์ชัน ini_get และ/หรือ ini_set ถูกปิดใช้งานในไฟล์ php.ini phpMyAdmin ต้องการฟังก์ชันเหล่านี้!

source: Failed to set session cookie. Maybe you are using HTTP instead of HTTPS to access phpMyAdmin.
th: ไม่สามารถตั้งค่าคุกกี้เซสชันได้ อาจเป็นเพราะคุณใช้ HTTP แทน HTTPS ในการเข้าถึง phpMyAdmin

source: Error: Token mismatch
th: เกิดข้อผิดพลาด: โทเค็นไม่ตรงกัน

source: Ignoring unsupported language code.
th: ไม่สนใจรหัสภาษาที่ไม่รองรับ

source: The database name cannot be longer than %d characters.
th: ชื่อฐานข้อมูลไม่สามารถมีความยาวเกิน %d ตัวอักษรได้

source: The table name cannot be longer than %d characters.
th: ชื่อตารางไม่สามารถมีความยาวเกิน %d ตัวอักษรได้

source: The trigger name cannot be longer than %d characters.
th: ชื่อทริกเกอร์ไม่สามารถมีความยาวเกิน %d ตัวอักษรได้

source: Only INSERT, UPDATE, DELETE, REPLACE and SET (without options like GLOBAL) SQL queries containing transactional engine tables can be rolled back.
th: เฉพาะคำสั่ง SQL ประเภท INSERT, UPDATE, DELETE, REPLACE และ SET (โดยไม่มีตัวเลือก เช่น GLOBAL) ที่มีตารางของระบบธุรกรรมเท่านั้นที่สามารถย้อนกลับได้

source: Go to table: %s
th: ไปที่ตาราง: %s

source: Structure of %s
th: โครงสร้างของ %s

source: Edit settings for %s
th: แก้ไขการตั้งค่าสำหรับ %s

source: Go to view: %s
th: ไปที่มุมมอง: %s

source: The following structures have either been created or altered. Here you can:
th: โครงสร้างต่อไปนี้ได้รับการสร้างขึ้นหรือดัดแปลงแล้ว คุณสามารถ:

source: View a structure's contents by clicking on its name.
th: ดูรายละเอียดของโครงสร้างได้โดยคลิกที่ชื่อของโครงสร้างนั้น

source: Change any of its settings by clicking the corresponding "Options" link.
th: คุณสามารถเปลี่ยนแปลงการตั้งค่าใด ๆ ได้โดยคลิกที่ลิงก์ "ตัวเลือก" ที่เกี่ยวข้อง

source: Edit structure by following the "Structure" link.
th: แก้ไขโครงสร้างโดยคลิกที่ลิงก์ "โครงสร้าง"

source: Go to database: %s
th: ไปที่ฐานข้อมูล: %s

source: The indexes %1$s and %2$s seem to be equal and one of them could possibly be removed.
th: ดัชนี %1$s และ %2$s ดูเหมือนจะเท่ากัน และอาจลบดัชนีใดดัชนีหนึ่งออกได้

source: web server upload directory:
th: ไดเร็กทอรีอัปโหลดของเว็บเซิร์ฟเวอร์:

source: Showing SQL query
th: แสดงคำสั่ง SQL

source: Inserted row id: %1$d
th: รหัสแถวที่แทรก: %1$d

source: Linting is disabled for this query because it exceeds the maximum length.
th: การตรวจสอบไวยากรณ์ถูกปิดใช้งานสำหรับคำสั่ง SQL นี้ เนื่องจากมีความยาวเกินขีดจำกัดสูงสุด

source: %1$s (near <code>%2$s</code>)
th: %1$s (ใกล้ <code>%2$s</code>)

source: Tracking
th: การติดตาม

source: Database seems to be empty!
th: ดูเหมือนว่าฐานข้อมูลจะว่างเปล่า!

source: Designer
th: ผู้ออกแบบ

source: User accounts
th: บัญชีผู้ใช้

source: Charsets
th: ชุดอักขระ

source: Engines
th: ระบบ

source: %1$d row affected.
th: แถวที่ได้รับผลกระทบ %1$d แถว

source: %1$d row deleted.
th: %1$d แถวถูกลบแล้ว

source: %1$d row inserted.
th: %1$d แถวถูกเพิ่มแล้ว

source: Groups:
th: กลุ่ม:

source: Events:
th: เหตุการณ์:

source: Functions:
th: ฟังก์ชัน:

source: Procedures:
th: ขั้นตอนการดำเนินการ:

source: Views:
th: มุมมอง:

source: There are large item groups in navigation panel which may affect the performance. Consider disabling item grouping in the navigation panel.
th: ในแผงนำทางมีการจัดกลุ่มรายการขนาดใหญ่ ซึ่งอาจส่งผลต่อประสิทธิภาพการทำงาน โปรดพิจารณาปิดใช้งานการจัดกลุ่มรายการในแผงนำทาง

source: %s result found
th: พบผลลัพธ์ %s

source: Collapse all
th: ย่อทั้งหมด

# Create new column
source: New
th: ใหม่

# Create new database
source: New
th: ใหม่

source: Show hidden items
th: แสดงรายการที่ซ่อนไว้

# Create new event
source: New
th: ใหม่

source: Functions
th: ฟังก์ชั่น

# Create new function
source: New
th: ใหม่

# Create new index
source: New
th: ใหม่

source: Expand/Collapse
th: ขยาย/ยุบ

source: Procedures
th: ขั้นตอน

# Create new procedure
source: New
th: ใหม่

source: Procedure
th: ขั้นตอน

# Create new table
source: New
th: ใหม่

# Create new trigger
source: New
th: ใหม่

# Create new view
source: New
th: ใหม่

source: Make all columns atomic
th: ทำทุกคอลัมน์ให้เล็กที่สุด

source: Step 1.
th: ขั้นตอนที่ 1

source: Do you have any column which can be split into more than one column? For example: address can be split into street, city, country and zip.
th: คุณมีคอลัมน์ใดบ้างที่สามารถแยกออกให้เป็นมากกว่าหนึ่งคอลัมน์ได้หรือไม่? ตัวอย่างเช่น ที่อยู่สามารถแยกออกเป็น ถนน เมือง ประเทศ และรหัสไปรษณีย์ได้

source: Show me the central list of columns that are not already in this table
th: แสดงรายการคอลัมน์หลักที่ยังไม่มีอยู่ในตารางนี้ให้หน่อย

source: Select a column which can be split into more than one (on select of 'no such column', it'll move to next step).
th: เลือกคอลัมน์ที่สามารถแยกออกเป็นมากกว่าหนึ่งส่วนได้ (หากเลือก 'ไม่มีคอลัมน์ดังกล่าว' ระบบจะไปยังขั้นตอนถัดไป)

source: split into
th: แยกเป็น

source: Have a primary key
th: เพิ่มคีย์หลัก

source: Primary key already exists.
th: มีคีย์หลักอยู่แล้ว

source: There is no primary key; please add one.<br>Hint: A primary key is a column (or combination of columns) that uniquely identify all rows.
th: ไม่มีคีย์หลัก; โปรดเพิ่มคีย์หลัก<br>คำแนะนำ: คีย์หลักคือคอลัมน์ (หรือการรวมกันของคอลัมน์) ที่ระบุแถวทั้งหมดได้อย่างไม่ซ้ำกัน

source: Add a primary key on existing column(s)
th: เพิ่มคีย์หลักในคอลัมน์ที่มีอยู่แล้ว

source: If it's not possible to make existing column combinations as primary key
th: หากไม่สามารถใช้ชุดคอลัมน์ที่มีอยู่เป็นคีย์หลักได้

source: + Add a new primary key column
th: + เพิ่มคอลัมน์คีย์หลักใหม่

source: Remove redundant columns
th: ลบคอลัมน์ที่ซ้ำซ้อนออก

source: Do you have a group of columns which on combining gives an existing column? For example, if you have first_name, last_name and full_name then combining first_name and last_name gives full_name which is redundant.
th: คุณมีกลุ่มคอลัมน์ที่เมื่อรวมกันแล้วกลายเป็นคอลัมน์ที่มีอยู่แล้วหรือไม่? ตัวอย่างเช่น หากคุณมี first_name, last_name และ full_name การรวม first_name กับ last_name จะได้ full_name ซึ่งซ้ำซ้อน

source: Check the columns which are redundant and click on remove. If no redundant column, click on 'No redundant column'
th: ตรวจสอบคอลัมน์ที่ซ้ำซ้อนและคลิกที่คำว่าลบ หากไม่มีคอลัมน์ที่ซ้ำซ้อน ให้คลิกที่ 'ไม่มีคอลัมน์ที่ซ้ำซ้อน'

source: Remove selected
th: ลบสิ่งที่เลือก

source: No redundant column
th: ไม่มีคอลัมน์ซ้ำซ้อน

source: Move repeating groups
th: ย้ายกลุ่มที่ซ้ำกัน

source: Do you have a group of two or more columns that are closely related and are all repeating the same attribute? For example, a table that holds data on books might have columns such as book_id, author1, author2, author3 and so on which form a repeating group. In this case a new table (book_id, author) should be created.
th: คุณมีสองกลุ่มคอลัมน์ขึ้นไปที่มีความสัมพันธ์กันอย่างใกล้ชิดและมีค่าคุณลักษณะเดียวกันหรือไม่? ตัวอย่างเช่น ตารางที่เก็บข้อมูลเกี่ยวกับหนังสือ อาจมีคอลัมน์เช่น book_id, author1, author2, author3 และอื่น ๆ ซึ่งเป็นกลุ่มที่มีค่าซ้ำกัน ในกรณีนี้ ควรสร้างตารางใหม่ (book_id, author)

source: Check the columns which form a repeating group. If no such group, click on 'No repeating group'
th: ตรวจสอบคอลัมน์ที่สร้างกลุ่มซ้ำ หากไม่มีกลุ่มดังกล่าว ให้คลิกที่ 'ไม่มีกลุ่มซ้ำ'

source: No repeating group
th: ไม่มีกลุ่มซ้ำกัน

source: Step 2.
th: ขั้นที่ 2

source: Find partial dependencies
th: ค้นหาการพึ่งพาบางส่วน

source: No partial dependencies possible as no non-primary column exists since primary key ( %1$s ) is composed of all the columns in the table.
th: ไม่สามารถมีการพึ่งพาบางส่วนได้ เนื่องจากไม่มีคอลัมน์ที่ไม่ใช่คอลัมน์หลัก ตั้งแต่คีย์หลัก ( %1$s ) ประกอบด้วยคอลัมน์ทั้งหมดในตาราง

source: Table is already in second normal form.
th: ตารางอยู่ในรูปแบบปกติขั้นที่สองแล้ว

source: The primary key ( %1$s ) consists of more than one column so we need to find the partial dependencies.
th: คีย์หลัก ( %1$s ) ประกอบด้วยคอลัมน์มากกว่าหนึ่ง ดังนั้นเราจึงต้องค้นหาการพึ่งพาบางส่วน

source: Please answer the following question(s) carefully to obtain a correct normalization.
th: กรุณาตอบคำถามต่อไปนี้อย่างละเอียดเพื่อให้ได้ค่าการปรับมาตรฐานที่ถูกต้อง

source: + Show me the possible partial dependencies based on data in the table
th: + แสดงการพึ่งพาบางส่วนที่เป็นไปได้โดยอิงจากข้อมูลในตาราง

source: For each column below, please select the <b>minimal set</b> of columns among given set whose values combined together are sufficient to determine the value of the column.
th: ในแต่ละคอลัมน์ด้านล่าง โปรดเลือก<b>ชุดคอลัมน์ขั้นต่ำ</b>จากชุดที่กำหนดให้ ซึ่งค่าของคอลัมน์เหล่านั้นเมื่อรวมกันแล้วเพียงพอที่จะกำหนดค่าของคอลัมน์นั้นได้

source: '%1$s' depends on:
th: '%1$s' ขึ้นอยู่กับ:

source: No partial dependencies possible as the primary key ( %1$s ) has just one column.
th: ไม่พบการพึ่งพาบางส่วน เนื่องจากคีย์หลัก ( %1$s ) มีเพียงคอลัมน์เดียว

source: In order to put the original table '%1$s' into Second normal form we need to create the following tables:
th: เพื่อให้ตารางเดิม '%1$s' อยู่ในรูปแบบปกติขั้นที่สอง เราจำเป็นต้องสร้างตารางต่อไปนี้:

source: The second step of normalization is complete for table '%1$s'.
th: ขั้นตอนที่สองของการปรับให้เป็นมาตรฐานเสร็จสมบูรณ์แล้วสำหรับตาราง '%1$s'

source: Error in processing!
th: เกิดข้อผิดพลาดในการประมวลผล!

source: In order to put the original table '%1$s' into Third normal form we need to create the following tables:
th: เพื่อให้ตารางต้นฉบับ '%1$s' อยู่ในรูปแบบปกติที่สาม เราจำเป็นต้องสร้างตารางต่อไปนี้:

source: The third step of normalization is complete.
th: ขั้นตอนที่สามของการปรับค่ามาตรฐานเสร็จสมบูรณ์แล้ว

source: Selected repeating group has been moved to the table '%s'
th: กลุ่มข้อมูลซ้ำที่เลือกไว้ได้ถูกย้ายไปยังตาราง '%s' แล้ว

source: Step 3.
th: ขั้นที่ 3

source: Find transitive dependencies
th: ค้นหาการพึ่งพาแบบถ่ายทอด

source: For each column below, please select the <b>minimal set</b> of columns among given set whose values combined together are sufficient to determine the value of the column.<br>Note: A column may have no transitive dependency, in that case you don't have to select any.
th: สำหรับแต่ละคอลัมน์ด้านล่าง โปรดเลือกชุดคอลัมน์ <b>ที่น้อยที่สุด</b> จากชุดที่กำหนดให้ ซึ่งค่าของคอลัมน์เหล่านั้นเมื่อรวมกันแล้วเพียงพอที่จะกำหนดค่าของคอลัมน์นั้นได้<br>หมายเหตุ: คอลัมน์อาจไม่มีการพึ่งพาแบบส่งต่อ ในกรณีนั้นคุณไม่จำเป็นต้องเลือกคอลัมน์ใด ๆ

source: No Transitive dependencies possible as the table doesn't have any non primary key columns
th: ไม่สามารถเกิดการพึ่งพาแบบส่งต่อได้ เนื่องจากตารางไม่มีคอลัมน์ที่ไม่ใช่คีย์หลัก

source: Table is already in Third normal form!
th: ตารางอยู่ในรูปแบบปกติที่สามแล้ว!

source: This list is based on a subset of the table's data and is not necessarily accurate.
th: รายชื่อนี้อ้างอิงจากข้อมูลเพียงบางส่วนในตาราง และอาจไม่ถูกต้องทั้งหมด

source: No partial dependencies found!
th: ไม่พบการพึ่งพาบางส่วน!

source: Coalesce
th: เชื่อมต่อกัน

source: Can't move table to same one!
th: ไม่สามารถย้ายตารางไปยังที่เดิมได้!

source: Can't copy table to same one!
th: ไม่สามารถคัดลอกตารางไปยังที่เดิมได้!

source: Table %s has been moved to %s. Privileges have been adjusted.
th: ตาราง %s ถูกย้ายไป %s แล้ว สิทธิพิเศษได้รับการแก้ไขแล้ว

source: Table %s has been copied to %s. Privileges have been adjusted.
th: ตาราง %s ถูกคัดลอกไปเป็น %s เรียบร้อยแล้ว สิทธิพิเศษได้รับการแก้ไขแล้ว

source: Table %s has been moved to %s.
th: ตาราง %s ถูกย้ายไป %s แล้ว

source: Table %s has been copied to %s.
th: ตาราง %s ถูกคัดลอกไป %s เรียบร้อยแล้ว

source: The table name is empty!
th: ชื่อตารางยังว่างอยู่!

source: This table is a view, it can not be truncated.
th: ตารางนี้เป็นมุมมอง ไม่สามารถตัดทอนได้

source: Error while creating PDF:
th: เกิดข้อผิดพลาดขณะสร้าง PDF:

source: You probably did not create a configuration file. You might want to use the %1$ssetup script%2$s to create one.
th: ﻿เป็นไปได้ว่าคุณไม่ได้สร้างแฟ้มการกำหนดค่าไว้ คุณอาจต้องใช้ %1$ssetup script%2$s เพื่อสร้างสักไฟล์

source: phpMyAdmin tried to connect to the MySQL server, and the server rejected the connection. You should check the host, username and password in your configuration and make sure that they correspond to the information given by the administrator of the MySQL server.
th: ﻿phpMyAdmin พยายามเชื่อมต่อไปยังเซิร์ฟเวอร์ MySQL และเซิร์ฟเวอร์ได้ปฏิเสธการเชื่อมต่อดังกล่าว คุณควรตรวจสอบโฮสต์ ชื่อผู้ใช้และรหัสผ่านในการกำหนดค่าของคุณ และให้แน่ใจว่าค่าต่างๆ สอดคล้องกับข้อมูลที่กำหนดไว้ โดยผู้ดูแลระบบของเซิร์ฟเวอร์ MySQL แล้ว

source: Retry to connect
th: ลองเชื่อมต่อใหม่อีกครั้ง

source: Your session has expired. Please log in again.
th: เซสชันของคุณหมดอายุแล้ว โปรดเข้าสู่ระบบอีกครั้ง

source: Missing Captcha verification, maybe it has been blocked by adblock?
th: ไม่พบการตรวจสอบ Captcha อาจถูกบล็อกโดย adblock หรือเปล่า?

source: Failed to connect to the reCAPTCHA service!
th: ไม่สามารถเชื่อมต่อกับบริการ reCAPTCHA ได้!

source: Entered captcha is wrong, try again!
th: ระบุ captcha ผิด โปรดลองอีกครั้ง!

source: Your password is too long. To prevent denial-of-service attacks, phpMyAdmin restricts passwords to less than 2000 characters.
th: รหัสผ่านของคุณยาวเกินไป เพื่อป้องกันการโจมตีแบบ Denial-of-Service ทาง phpMyAdmin จึงจำกัดรหัสผ่านให้มีความยาวไม่เกิน 2000 ตัวอักษร

source: You are not allowed to log in to this MySQL server!
th: คุณไม่ได้รับอนุญาตให้เข้าสู่ระบบเซิร์ฟเวอร์ MySQL นี้!

source: Wrong username/password. Access denied.
th: ชื่อผู้ใช้/รหัสผ่านไม่ถูกต้อง การเข้าถึงถูกปฏิเสธ

source: Can not find signon authentication script: %s
th: ไม่พบสคริปต์การตรวจสอบสิทธิ์ signon: %s

source: Invalid authentication method set in configuration:
th: วิธีการตรวจสอบสิทธิ์ที่ตั้งค่าไว้ในไฟล์การกำหนดค่าไม่ถูกต้อง:

source: You have enabled two factor authentication, please confirm your login.
th: คุณได้เปิดใช้งานการตรวจสอบสิทธิ์แบบสองขั้นตอนแล้ว โปรดยืนยันการเข้าสู่ระบบของคุณ

source: Columns separated with:
th: คอลัมน์ถูกแบ่งด้วย:

source: Columns enclosed with:
th: คอลัมน์ถูกล้อมด้วย:

source: Columns escaped with:
th: คอลัมน์ถูกเลี่ยงด้วย:

source: Lines terminated with:
th: จบแถวด้วย:

source: Replace NULL with:
th: แทนที่ NULL ด้วย:

source: Remove carriage return/line feed characters within columns
th: ลบอักขระขึ้นบรรทัดใหม่/เพิ่มบรรทัดภายในคอลัมน์

source: Excel edition:
th: ฉบับ Excel:

source: Data dump options
th: ตัวเลือกการดัมพ์ข้อมูล

source: Dumping data for table
th: การดัมพ์ข้อมูลสำหรับตาราง

source: Table structure for table
th: โครงสร้างตารางสำหรับตาราง

source: Structure for view
th: โครงสร้างสำหรับมุมมอง

source: Stand-in structure for view
th: โครงสร้างชั่วคราวสำหรับมุมมอง

source: Output pretty-printed JSON (Use human-readable formatting)
th: แสดงผล JSON ในรูปแบบที่อ่านง่าย (ใช้รูปแบบที่มนุษย์อ่านได้)

source: Output unicode characters unescaped
th: แสดงผลอักขระยูนิโค้ดโดยไม่ผ่านการแปลง

source: Content of table @TABLE@
th: เนื้อหาของตาราง @TABLE@

source: (continued)
th: (ต่อ)

source: Structure of table @TABLE@
th: โครงสร้างของตาราง @TABLE@

source: Object creation options
th: ตัวเลือกการสร้างวัตถุ

source: Table caption:
th: คำอธิบายตาราง:

source: Table caption (continued):
th: คำอธิบายตาราง (ต่อ):

source: Label key:
th: ป้ายชื่อคีย์:

source: Display foreign key relationships
th: แสดงความสัมพันธ์ของคีย์นอก

source: Display comments
th: แสดงหมายเหตุ

source: Put columns names in the first row:
th: ใส่ชื่อคอลัมน์ไว้ในแถวแรก:

source: Generation Time:
th: เวลาในการสร้าง:

source: PHP Version:
th: เวอร์ชั่น PHP:

source: Data:
th: ข้อมูล:

source: Structure:
th: โครงสร้าง:

source: Export table names
th: ส่งออกชื่อตาราง

source: Export table headers
th: ส่งออกส่วนหัวของตาราง

source: Report title:
th: ชื่อรายงาน:

source: Dumping data
th: การดัมพ์ข้อมูล

source: View structure
th: โครงสร้างมุมมอง

source: Stand in
th: ตัวแทนชั่วคราว

source: Display comments <i>(includes info such as export timestamp, PHP version, and server version)</i>
th: แสดงความคิดเห็น <i>(รวมถึงข้อมูลต่าง ๆ เช่น เวลาที่ส่งออก เวอร์ชัน PHP และเวอร์ชันเซิร์ฟเวอร์)</i>

source: Additional custom header comment (\n splits lines):
th: ข้อความแสดงความคิดเห็นส่วนหัวเพิ่มเติมที่กำหนดเอง (\n แยกบรรทัด):

source: Include a timestamp of when databases were created, last updated, and last checked
th: ระบุเวลาที่สร้างฐานข้อมูล เวลาอัปเดตล่าสุด และเวลาตรวจสอบล่าสุดด้วย

source: Export metadata
th: ส่งออกเมตาดาต้า

source: Add statements:
th: เพิ่มคำสั่ง:

source: Add %s statement
th: เพิ่มคำสั่ง %s

source: (less efficient as indexes will be generated during table creation)
th: (ประสิทธิภาพลดลง เนื่องจากดัชนีจะถูกสร้างขึ้นในระหว่างการสร้างตาราง)

source: %s value
th: ค่า %s

source: Use simple view export
th: ใช้การส่งออกมุมมองแบบง่าย

source: Enclose table and column names with backquotes <i>(Protects column and table names formed with special characters or keywords)</i>
th: ใส่เครื่องหมาย backquote ครอบชื่อตารางและชื่อคอลัมน์ <i>(ป้องกันการใช้ตัวอักษรพิเศษหรือคีย์เวิร์ดในชื่อคอลัมน์และตาราง)</i>

source: Data creation options
th: ตัวเลือกการสร้างข้อมูล

source: Truncate table before insert
th: ล้างข้อมูลในตารางก่อนแทรกข้อมูล

source: Instead of <code>INSERT</code> statements, use:
th: แทนที่จะใช้คำสั่ง <code>INSERT</code> ให้ใช้:

source: <code>INSERT DELAYED</code> statements
th: คำสั่ง <code>INSERT DELAYED</code>

source: <code>INSERT IGNORE</code> statements
th: คำสั่ง <code>INSERT IGNORE</code>

source: Function to use when dumping data:
th: ฟังก์ชันที่ใช้เมื่อทำการดัมพ์ข้อมูล:

source: Syntax to use when inserting data:
th: ไวยากรณ์ที่ใช้เมื่อแทรกข้อมูล:

source: include column names in every <code>INSERT</code> statement <br> &nbsp; &nbsp; &nbsp; Example: <code>INSERT INTO tbl_name (col_A,col_B,col_C) VALUES (1,2,3)</code>
th: ระบุชื่อคอลัมน์ในทุกคำสั่ง <code>INSERT</code> <br> &nbsp; &nbsp; &nbsp; ตัวอย่าง: <code>INSERT INTO tbl_name (col_A,col_B,col_C) VALUES (1,2,3)</code>

source: insert multiple rows in every <code>INSERT</code> statement<br> &nbsp; &nbsp; &nbsp; Example: <code>INSERT INTO tbl_name VALUES (1,2,3), (4,5,6), (7,8,9)</code>
th: แทรกหลายแถวในคำสั่ง <code>INSERT</code> ทุกครั้ง<br> &nbsp; &nbsp; &nbsp; ตัวอย่าง: <code>INSERT INTO tbl_name VALUES (1,2,3), (4,5,6), (7,8,9)</code>

source: both of the above<br> &nbsp; &nbsp; &nbsp; Example: <code>INSERT INTO tbl_name (col_A,col_B,col_C) VALUES (1,2,3), (4,5,6), (7,8,9)</code>
th: ทั้งสองอย่างข้างต้น<br> &nbsp; &nbsp; &nbsp; ตัวอย่าง: <code>INSERT INTO tbl_name (col_A,col_B,col_C) VALUES (1,2,3), (4,5,6), (7,8,9)</code>

source: neither of the above<br> &nbsp; &nbsp; &nbsp; Example: <code>INSERT INTO tbl_name VALUES (1,2,3)</code>
th: ไม่ใช่ทั้งสองอย่างข้างต้น<br> &nbsp; &nbsp; &nbsp; ตัวอย่าง: <code>INSERT INTO tbl_name VALUES (1,2,3)</code>

source: Dump binary columns in hexadecimal notation <i>(for example, "abc" becomes 0x616263)</i>
th: แปลงค่าคอลัมน์ไบนารีให้อยู่ในรูปแบบเลขฐานสิบหก <i>(ตัวอย่างเช่น "abc" จะกลายเป็น 0x616263)</i>

source: Dump TIMESTAMP columns in UTC <i>(enables TIMESTAMP columns to be dumped and reloaded between servers in different time zones)</i>
th: ดัมพ์คอลัมน์ TIMESTAMP ในรูปแบบ UTC <i>(ช่วยให้สามารถดัมพ์และโหลดคอลัมน์ TIMESTAMP ระหว่างเซิร์ฟเวอร์ในเขตเวลาที่แตกต่างกันได้)</i>

source: It appears your database uses routines;
th: ดูเหมือนว่าฐานข้อมูลของคุณจะใช้รูทีน;

source: alias export may not work reliably in all cases.
th: การส่งออกนามแฝงอาจใช้งานไม่ได้ผลอย่างน่าเชื่อถือในทุกกรณี

source: Metadata
th: เมตาดาต้า

source: Metadata for table %s
th: เมตาดาต้าสำหรับตาราง %s

source: Metadata for database %s
th: เมดาต้าสำหรับฐานข้อมูล %s

source: Error reading structure for table %s:
th: การอ่านโครงสร้างตารางผิดพลาดของ %s:

source: It appears your database uses views;
th: ดูเหมือนว่าฐานข้อมูลของคุณจะใช้มุมมอง;

source: Constraints for dumped tables
th: ข้อจำกัดสำหรับตารางที่ถูกดัมพ์

source: Constraints for table
th: ข้อจำกัดสำหรับตาราง

source: Indexes for dumped tables
th: ดัชนีสำหรับตารางที่ถูกดัมพ์

source: Indexes for table
th: ดัชนีสำหรับตาราง

source: AUTO_INCREMENT for dumped tables
th: ค่า AUTO_INCREMENT สำหรับตารางที่ถูกดัมพ์

source: AUTO_INCREMENT for table
th: AUTO_INCREMENT สำหรับตาราง

source: MEDIA TYPES FOR TABLE
th: ประเภทสื่อสำหรับตาราง

source: RELATIONSHIPS FOR TABLE
th: ความสัมพันธ์สำหรับตาราง

source: It appears your table uses triggers;
th: ดูเหมือนว่าตารางของคุณจะใช้ทริกเกอร์;

source: Structure for view %s exported as a table
th: โครงสร้างสำหรับมุมมอง %s ที่ส่งออกเป็นตาราง

source: (See below for the actual view)
th: (ดูภาพจริงด้านล่าง)

source: Error reading data for table %s:
th: เกิดข้อผิดพลาดในการอ่านข้อมูลสำหรับตาราง %s:

source: Creation:
th: สร้าง:

source: Last update:
th: ปรับปรุงล่าสุด:

source: Last check:
th: ตรวจสอบล่าสุด:

source: Database system or older MySQL server to maximize output compatibility with:
th: ระบบฐานข้อมูลหรือเซิร์ฟเวอร์ MySQL รุ่นเก่าเพื่อเพิ่มความเข้ากันได้ของผลลัพธ์ให้สูงสุดกับ:

source: Object creation options (all are recommended)
th: ตัวเลือกการสร้างวัตถุ (แนะนำให้ใช้ทุกตัวเลือก)

source: Export contents
th: ส่งออกเนื้อหา

source: Purpose:
th: วัตถุประสงค์:

source: Update data when duplicate keys found on import (add ON DUPLICATE KEY UPDATE)
th: อัปเดตข้อมูลเมื่อพบคีย์ซ้ำในระหว่างการนำเข้า (เพิ่ม ON DUPLICATE KEY UPDATE)

source: Name of the new table (optional):
th: ชื่อตารางใหม่ (ไม่บังคับ):

source: Name of the new database (optional):
th: ชื่อฐานข้อมูลใหม่ (ไม่บังคับ):

source: Import these many number of rows (optional):
th: นำเข้าข้อมูลจำนวนแถวตามที่ระบุ (ไม่บังคับ):

source: The first line of the file contains the table column names <i>(if this is unchecked, the first line will become part of the data)</i>
th: บรรทัดแรกของไฟล์ประกอบด้วยชื่อคอลัมน์ของตาราง <i>(หากไม่ได้เลือกตัวเลือกนี้ บรรทัดแรกจะกลายเป็นส่วนหนึ่งของข้อมูล)</i>
