Repository: phpmyadmin/phpmyadmin
Catalog: resources/po/*.po
Languages: th

source: If the data in each row of the file is not in the same order as in the database, list the corresponding column names here. Column names must be separated by commas and not enclosed in quotations.
th: หากข้อมูลในแต่ละแถวของไฟล์ไม่ได้เรียงลำดับเดียวกันกับในฐานข้อมูล ให้ระบุชื่อคอลัมน์ที่เกี่ยวข้องไว้ที่นี่ ชื่อคอลัมน์ต้องคั่นด้วยเครื่องหมายจุลภาคและห้ามใส่เครื่องหมายอัญประกาศล้อมรอบ

source: Invalid format of CSV input on line %d.
th: รูปแบบข้อมูล CSV ไม่ถูกต้องในบรรทัดที่ %d

source: Invalid column count in CSV input on line %d.
th: จำนวนคอลัมน์ในไฟล์ CSV ที่ป้อนเข้ามาในบรรทัดที่ %d ไม่ถูกต้อง

source: Invalid parameter for CSV import: %s
th: พารามิเตอร์ไม่ถูกต้องสำหรับการนำเข้าไฟล์ CSV: %s

source: Invalid column (%s) specified! Ensure that columns names are spelled correctly, separated by commas, and not enclosed in quotes.
th: ระบุคอลัมน์ (%s) ไม่ถูกต้อง! ให้แน่ใจว่าชื่อคอลัมน์สะกดถูกต้อง คั่นด้วยเครื่องหมายจุลภาค และไม่ใส่เครื่องหมายอัญประกาศล้อมรอบ

source: Column names:
th: ชื่อคอลัมน์:

source: This plugin does not support compressed imports!
th: ปลั๊กอินนี้ไม่รองรับการนำเข้าไฟล์ที่บีบอัด!

source: MediaWiki Table
th: ตาราง MediaWiki

source: Invalid format of mediawiki input on line: <br>%s.
th: รูปแบบข้อมูลอินพุต MediaWiki ไม่ถูกต้องในบรรทัด: <br>%s

source: Import percentages as proper decimals <i>(ex. 12.00% to .12)</i>
th: นำเข้าค่าเปอร์เซ็นต์โดยแปลงเป็นทศนิยมให้ถูกต้อง <i>(เช่น 12.00% เป็น .12)</i>

source: Import currencies <i>(ex. $5.00 to 5.00)</i>
th: นำเข้าสกุลเงิน <i>(เช่น $5.00 เป็น 5.00)</i>

source: The XML file specified was either malformed or incomplete. Please correct the issue and try again.
th: ไฟล์ XML ที่ระบุมีรูปแบบไม่ถูกต้องหรือไม่สมบูรณ์ โปรดแก้ไขปัญหาแล้วลองใหม่อีกครั้ง

source: Could not parse OpenDocument Spreadsheet!
th: ไม่สามารถแยกวิเคราะห์สเปรดชีต OpenDocument ได้!

source: ESRI Shape File
th: ไฟล์รูปทรง ESRI

source: There was an error importing the ESRI shape file: "%s".
th: เกิดข้อผิดพลาดในการนำเข้าไฟล์รูปทรง ESRI: "%s"

source: MySQL Spatial Extension does not support ESRI type "%s".
th: ส่วนขยาย MySQL Spatial ไม่รองรับชนิดข้อมูล ESRI "%s"

source: The imported file does not contain any data!
th: ไฟล์ที่นำเข้าไม่มีข้อมูลใด ๆ !

source: SQL compatibility mode:
th: โหมดความเข้ากันได้กับ SQL:

source: Do not use <code>AUTO_INCREMENT</code> for zero values
th: ห้ามใช้ <code>AUTO_INCREMENT</code> สำหรับค่าศูนย์

source: This format has no options
th: รูปแบบนี้ไม่มีตัวเลือก

source: The %s table doesn't exist!
th: ไม่มีตาราง "%s"!

source: Schema of the %s database - Page %s
th: โครงร่างฐานข้อมูล %s - หน้า %s

source: SCHEMA ERROR:
th: ข้อผิดพลาดของโครงร่าง:

source: PDF export page
th: หน้าส่งออกไฟล์ PDF

source: Schema of the %s database
th: โครงร่างของฐานข้อมูล %s

source: Relational schema
th: โครงร่างเชิงสัมพันธ์

source: Table of contents
th: สารบัญ

source: Show color
th: แสดงสี

source: Only show keys
th: แสดงคีย์เท่านั้น

source: Orientation
th: การวางแนว

source: Landscape
th: แนวนอน

source: Portrait
th: แนวตั้ง

source: Same width for all tables
th: ตั้งความกว้างทุกตารางเท่ากัน

source: Show grid
th: แสดงเส้นตาราง

source: Order of the tables
th: ลำดับของตาราง

source: Name (Ascending)
th: ชื่อ (น้อยไปมาก)

source: Name (Descending)
th: ชื่อ (มากไปน้อย)

source: Converts Boolean values to text (default 'T' and 'F'). First option is for TRUE, second for FALSE. Nonzero=true.
th: แปลงค่าบูลีนให้เป็นข้อความ (ค่าเริ่มต้นคือ 'T' และ 'F') ตัวเลือกแรกสำหรับค่า TRUE ตัวเลือกที่สองสำหรับค่า FALSE ค่าที่ไม่ใช่ศูนย์=เป็นจริง

source: Displays a TIME, TIMESTAMP, DATETIME or numeric unix timestamp column as formatted date. The first option is the offset (in hours) which will be added to the timestamp (Default: 0). Use second option to specify a different date/time format string. Third option determines whether you want to see local date or UTC one (use "local" or "utc" strings) for that. According to that, date format has different value - for "local" see the documentation for PHP's strftime() function and for "utc" it is done using gmdate() function.
th: แสดงคอลัมน์ TIME, TIMESTAMP, DATETIME หรือตัวเลข Unix timestamp เป็นรูปแบบวันที่ ตัวเลือกแรกคือค่าชดเชย (เป็นชั่วโมง) ที่จะถูกเพิ่มเข้าไปใน timestamp (ค่าเริ่มต้น: 0) ใช้ตัวเลือกที่สองเพื่อระบุสตริงรูปแบบวันที่/เวลาที่แตกต่างกัน ตัวเลือกที่สามกำหนดว่าคุณต้องการดูวันที่แบบท้องถิ่นหรือแบบ UTC (ใช้สตริง "local" หรือ "utc") สำหรับเรื่องนี้ รูปแบบวันที่จะมีค่า - สำหรับ "local" ดูเอกสารประกอบสำหรับฟังก์ชัน strftime() ของ PHP และสำหรับ "utc" จะทำโดยใช้ฟังก์ชัน gmdate()

source: %B %d, %Y at %I:%M %p
th: %d %B %Y เมื่อ %I:%M %p

source: Displays a link to download the binary data of the column. You can use the option to specify the filename.
th: แสดงลิงก์สำหรับดาวน์โหลดข้อมูลไบนารีของคอลัมน์ คุณสามารถใช้ตัวเลือกเพื่อระบุชื่อไฟล์ได้

source: LINUX ONLY: Launches an external application and feeds it the column data via standard input. Returns the standard output of the application. The default is Tidy, to pretty-print HTML code. For security reasons, you have to manually edit the file src/Plugins/Transformations/Abs/ExternalTransformationsPlugin.php and list the tools you want to make available. The first option is then the number of the program you want to use. The second option should be blank for historical reasons. The third option, if set to 1, will convert the output using htmlspecialchars() (Default 1). The fourth option, if set to 1, will prevent wrapping and ensure that the output appears all on one line (Default 1).
th: สำหรับ LINUX เท่านั้น: เรียกใช้แอปพลิเคชันภายนอกและป้อนข้อมูลคอลัมน์ผ่านอินพุตมาตรฐาน ส่งคืนเอาต์พุตมาตรฐานของแอปพลิเคชัน ค่าเริ่มต้นคือ Tidy เพื่อจัดรูปแบบโค้ด HTML ให้สวยงาม ด้วยเหตุผลด้านความปลอดภัย คุณต้องแก้ไขไฟล์ src/Plugins/Transformations/Abs/ExternalTransformationsPlugin.php ด้วยตนเองและระบุเครื่องมือที่คุณต้องการใช้งาน ตัวเลือกแรกคือหมายเลขของโปรแกรมที่คุณต้องการใช้ ตัวเลือกที่สองควรเว้นว่างไว้เพื่อเหตุผลเกี่ยวกับประวัติ ตัวเลือกที่สาม หากตั้งค่าเป็น 1 จะแปลงเอาต์พุตโดยใช้ htmlspecialchars() (ค่าเริ่มต้น 1) ตัวเลือกที่สี่ หากตั้งค่าเป็น 1 จะป้องกันการขึ้นบรรทัดใหม่และทำให้มั่นใจว่าเอาต์พุตปรากฏทั้งหมดในบรรทัดเดียว (ค่าเริ่มต้น 1)

source: You are using the external transformation command line options field, which has been deprecated for security reasons. Add all command line options directly to the definition in %s.
th: คุณกำลังใช้ฟิลด์ตัวเลือกบรรทัดคำสั่งการแปลงภายนอก ซึ่งถูกยกเลิกการใช้งานแล้วด้วยเหตุผลด้านความปลอดภัย โปรดเพิ่มตัวเลือกบรรทัดคำสั่งทั้งหมดลงในคำจำกัดความใน %s โดยตรง

source: Displays the contents of the column as-is, without running it through htmlspecialchars(). That is, the column is assumed to contain valid HTML.
th: แสดงเนื้อหาของคอลัมน์ตามที่เป็นอยู่ โดยไม่ผ่านคำสั่ง htmlspecialchars() กล่าวคือ ถือว่าคอลัมน์นั้นมี HTML ที่ถูกต้อง

source: Displays hexadecimal representation of data. Optional first parameter specifies how often space will be added (defaults to 2 nibbles).
th: แสดงผลข้อมูลในรูปแบบเลขฐานสิบหก พารามิเตอร์แรกเป็นตัวเลือก ระบุความถี่ในการเพิ่มช่องว่าง (ค่าเริ่มต้นคือ 2 นิบเบิล)

source: Displays a link to download this image.
th: แสดงลิงก์เพื่อดาวน์โหลดรูปภาพนี้

source: Image upload functionality which also displays a thumbnail. The options are the width and height of the thumbnail in pixels. Defaults to 100 X 100.
th: ฟังก์ชันการอัปโหลดรูปภาพซึ่งจะแสดงภาพขนาดย่อด้วย โดยสามารถเลือกความกว้างและความสูงของภาพขนาดย่อได้เป็นพิกเซล ค่าเริ่มต้นคือ 100 x 100 พิกเซล

source: Image preview here
th: ดูตัวอย่างภาพได้ที่นี่

source: Displays a clickable thumbnail. The options are the maximum width and height in pixels. The original aspect ratio is preserved.
th: แสดงภาพขนาดย่อที่คลิกได้ ตัวเลือกคือความกว้างและความสูงสูงสุดเป็นพิกเซล อัตราส่วนภาพดั้งเดิมจะถูกรักษาไว้

source: Converts an (IPv4) Internet network address stored as a BIGINT into a string in Internet standard dotted format.
th: แปลงที่อยู่เครือข่ายอินเทอร์เน็ต (IPv4) ที่จัดเก็บในรูปแบบ BIGINT ให้เป็นสตริงในรูปแบบจุดตามมาตรฐานอินเทอร์เน็ต

source: Prepends and/or Appends text to a string. First option is text to be prepended, second is appended (enclosed in single quotes, default empty string).
th: เพิ่มข้อความเข้าและ/หรือต่อท้ายสตริง ตัวเลือกแรกคือข้อความที่จะเพิ่มเข้าด้านหน้า ตัวเลือกที่สองคือข้อความที่จะเพิ่มต่อท้าย (อยู่ในเครื่องหมายอัญประกาศเดี่ยว ค่าเริ่มต้นคือสตริงว่าง)

source: Validates the string using regular expression and performs insert only if string matches it. The first option is the Regular Expression.
th: ตรวจสอบความถูกต้องของสตริงโดยใช้ regular expression และจะทำการแทรกข้อมูลก็ต่อเมื่อสตริงตรงกันเท่านั้น ตัวเลือกแรกคือ Regular Expression

source: Validation failed for the input string %s.
th: การตรวจสอบความถูกต้องของสตริงอินพุต %s ล้มเหลว

source: Formats text as SQL query with syntax highlighting.
th: จัดรูปแบบข้อความให้เป็นคำสั่ง SQL พร้อมเน้นไวยากรณ์

source: Displays a part of a string. The first option is the number of characters to skip from the beginning of the string (Default 0). The second option is the number of characters to return (Default: until end of string). The third option is the string to append and/or prepend when truncation occurs (Default: "…").
th: แสดงส่วนหนึ่งของสตริง ตัวเลือกแรกคือจำนวนอักขระที่จะข้ามจากสตริงเริ่มต้น (ค่าเริ่มต้นคือ 0) ตัวเลือกที่สองคือจำนวนอักขระที่ส่งคืน (ค่าเริ่มต้น: จนถึงจุดสิ้นสุดของสตริง) ตัวเลือกที่สามคือสตริงที่จะเพิ่มต่อท้ายและ/หรือเพิ่มไว้ข้างหน้าเมื่อเกิดการตัดทอน (ค่าเริ่มต้น: "…")

source: File upload functionality for TEXT columns. It does not have a textarea for input.
th: ฟังก์ชันการอัปโหลดไฟล์สำหรับคอลัมน์ข้อความ ไม่มีช่องข้อความสำหรับป้อนข้อมูล

source: Displays an image and a link; the column contains the filename. The first option is a URL prefix like "https://www.example.com/". The second and third options are the width and the height in pixels.
th: แสดงภาพและลิงก์; โดยคอลัมน์ที่ประกอบด้วยชื่อไฟล์ ตัวเลือกแรกคือคำนำหน้า URL เช่น "https://www.example.com/" ตัวเลือกที่สองและสามคือความกว้างและความสูงเป็นพิกเซล

source: Displays a link; the column contains the filename. The first option is a URL prefix like "https://www.example.com/". The second option is a title for the link.
th: แสดงลิงก์ โดยคอลัมน์ที่ประกอบด้วยชื่อไฟล์ ตัวเลือกแรกคือคำนำหน้า URL เช่น "https://www.example.com/" ตัวเลือกที่สองคือชื่อสำหรับลิงก์

source: Converts an Internet network address in (IPv4/IPv6) format to binary
th: แปลงที่อยู่เครือข่ายอินเทอร์เน็ตในรูปแบบ (IPv4/IPv6) เป็นเลขฐานสอง

source: Converts an Internet network address in (IPv4/IPv6) format into a long integer.
th: แปลงที่อยู่เครือข่ายอินเทอร์เน็ตในรูปแบบ (IPv4/IPv6) ให้เป็น long integer

source: Syntax highlighted CodeMirror editor for JSON.
th: โปรแกรมแก้ไข CodeMirror สำหรับ JSON ที่มีการเน้นไวยากรณ์

source: Syntax highlighted CodeMirror editor for SQL.
th: โปรแกรมแก้ไข CodeMirror สำหรับ SQL ที่เน้นไวยากรณ์

source: Syntax highlighted CodeMirror editor for XML (and HTML).
th: โปรแกรมแก้ไข CodeMirror สำหรับ XML (และ HTML) ที่มีการเน้นไวยากรณ์

source: Converts an Internet network address stored as a binary string into a string in Internet standard (IPv4/IPv6) format.
th: แปลงที่อยู่เครือข่ายอินเทอร์เน็ตที่จัดเก็บในรูปแบบสตริงไบนารี ให้เป็นสตริงในรูปแบบมาตรฐานอินเทอร์เน็ต (IPv4/IPv6)

source: Formats text as JSON with syntax highlighting.
th: จัดรูปแบบข้อความให้เป็น JSON พร้อมเน้นไวยากรณ์

source: Formats text as XML with syntax highlighting.
th: จัดรูปแบบข้อความให้เป็น XML พร้อมเน้นไวยากรณ์

source: Authentication Application (2FA)
th: แอปพลิเคชันยืนยันตัวตน (2FA)

source: Provides authentication using HOTP and TOTP applications such as FreeOTP, Google Authenticator or Authy.
th: รองรับการตรวจสอบสิทธิ์โดยใช้แอปพลิเคชัน HOTP และ TOTP เช่น FreeOTP, Google Authenticator หรือ Authy

source: Hardware Security Key (FIDO U2F)
th: คีย์ความปลอดภัยฮาร์ดแวร์ (FIDO U2F)

source: Provides authentication using hardware security tokens supporting FIDO U2F, such as a YubiKey.
th: รองรับการตรวจสอบสิทธิ์โดยใช้โทเค็นความปลอดภัยฮาร์ดแวร์ที่รองรับ FIDO U2F เช่น YubiKey

source: Two-factor authentication failed: %s
th: การยืนยันตัวตนสองขั้นตอนล้มเหลว: %s

source: Two-factor authentication failed.
th: การตรวจสอบสิทธิ์แบบสองขั้นตอนล้มเหลว

source: Login using password only.
th: เข้าสู่ระบบโดยใช้รหัสผ่านเท่านั้น

source: Simple two-factor authentication
th: การตรวจสอบสิทธิ์แบบสองขั้นตอนอย่างง่าย

source: For testing purposes only!
th: สำหรับทดสอบเท่านั้น!

source: Hardware Security Key (WebAuthn/FIDO2)
th: คีย์ความปลอดภัยฮาร์ดแวร์ (WebAuthn/FIDO2)

source: Provides authentication using hardware security tokens supporting the WebAuthn/FIDO2 protocol, such as a YubiKey.
th: รองรับการตรวจสอบสิทธิ์โดยใช้โทเค็นความปลอดภัยฮาร์ดแวร์ที่รองรับโปรโตคอล WebAuthn/FIDO2 เช่น YubiKey

source: The server is not responding (or the local server's socket is not correctly configured).
th: เซิร์ฟเวอร์ไม่ตอบสนอง (หรือซ็อกเก็ตของเซิร์ฟเวอร์ภายในเครื่องไม่ได้ถูกกำหนดค่าอย่างถูกต้อง)

source: The server is not responding.
th: เซิร์ฟเวอร์ไม่มีการตอบสนอง

source: Logout and try as another user.
th: ออกจากระบบแล้วลองใหม่โดยใช้บัญชีผู้ใช้อื่น

source: Please check privileges of directory containing database.
th: โปรดตรวจสอบสิทธิ์การเข้าถึงของไดเร็กทอรีที่เก็บฐานข้อมูล

source: Details…
th: รายละเอียด…

source: Connection to server is disabled, please enable $cfg['AllowArbitraryServer'] in phpMyAdmin configuration.
th: การเชื่อมต่อกับเซิร์ฟเวอร์ถูกปิดใช้งานอยู่ โปรดเปิดใช้งาน $cfg['AllowArbitraryServer'] ในการตั้งค่า phpMyAdmin

source: Replication started successfully.
th: การจำลองข้อมูลเริ่มต้นสำเร็จแล้ว

source: Error starting replication.
th: เกิดข้อผิดพลาดในการเริ่มต้นการจำลองข้อมูล

source: Replication stopped successfully.
th: การจำลองข้อมูลหยุดลงอย่างสำเร็จแล้ว

source: Error stopping replication.
th: เกิดข้อผิดพลาดขณะหยุดการจำลองข้อมูล

source: Replication resetting successfully.
th: การรีเซ็ตการจำลองข้อมูลสำเร็จแล้ว

source: Error resetting replication.
th: เกิดข้อผิดพลาดในการรีเซ็ตการจำลองข้อมูล

source: Success.
th: สำเร็จ

source: Error.
th: ผิดพลาด

source: Unable to connect to primary %s.
th: ไม่สามารถเชื่อมต่อกับ %s หลักได้

source: Unable to read primary log position. Possible privilege problem on primary.
th: ไม่สามารถอ่านตำแหน่งบันทึกหลักได้ อาจมีปัญหาเรื่องสิทธิ์การเข้าถึงในระบบหลัก

source: Unable to change primary!
th: ไม่สามารถเปลี่ยนข้อมูลหลักได้!

source: Primary server changed successfully to %s.
th: เซิร์ฟเวอร์หลักเปลี่ยนเป็น %s สำเร็จแล้ว

source: The routing cache could not be written, you need to adjust permissions on the folder/file "%s"
th: ไม่สามารถเขียนแคชการกำหนดเส้นทางได้ คุณต้องปรับสิทธิ์การเข้าถึงแฟ้ม/ไฟล์ "%s"

source: Error 404! The page %s was not found.
th: ข้อผิดพลาด 404! ไม่พบหน้า %s

source: Error 405! Request method not allowed.
th: ข้อผิดพลาด 405! คำร้องขอไม่อนุมัติ

source: Native MySQL authentication
th: การตรวจสอบสิทธิ์ MySQL ดั้งเดิม

source: SHA256 password authentication
th: การตรวจสอบรหัสผ่านแบบ SHA256

source: Account locking is not supported.
th: ระบบไม่รองรับการล็อกบัญชีผู้ใช้

source: No privileges.
th: ไม่มีสิทธิพิเศษ

source: Includes all privileges except GRANT.
th: รวมสิทธิพิเศษทั้งหมด ยกเว้นสิทธิ์ GRANT

source: The password for %s was changed successfully.
th: รหัสผ่านสำหรับ %s ถูกเปลี่ยนสำเร็จแล้ว

source: You have revoked the privileges for %s.
th: คุณได้เพิกถอนสิทธิของ %s

source: Revoke
th: เพิกถอน

source: No users selected for deleting!
th: ไม่มีการเลือกผู้ใช้เพื่อลบ!

source: Reloading the privileges
th: กำลังโหลดสิทธิ์ใหม่

source: The selected users have been deleted successfully.
th: ผู้ใช้งานที่เลือกไว้ถูกลบออกเรียบร้อยแล้ว

source: You have updated the privileges for %s.
th: คุณได้อัปเดตสิทธิ์การเข้าถึงสำหรับ %s แล้ว

source: Deleting %s
th: กำลังลบ %s

source: The privileges were reloaded successfully.
th: สิทธิ์การใช้งานถูกโหลดใหม่เรียบร้อยแล้ว

source: The user %s already exists!
th: มีผู้ใช้ %s อยู่แล้ว!

source: Privileges for %s
th: สิทธิ์สำเรับ %s

source: Note: phpMyAdmin gets the users’ privileges directly from MySQL’s privilege tables. The content of these tables may differ from the privileges the server uses, if they have been changed manually. In this case, you should %sreload the privileges%s before you continue.
th: หมายเหตุ: phpMyAdmin ดึงสิทธิ์ของผู้ใช้โดยตรงจากตารางสิทธิ์ของ MySQL เนื้อหาของตารางเหล่านี้อาจแตกต่างจากสิทธิ์ที่เซิร์ฟเวอร์ใช้ หากมีการเปลี่ยนแปลงด้วยตนเอง ในกรณีนี้ คุณควร %sreload the privileges%s ก่อนดำเนินการต่อ

source: Note: phpMyAdmin gets the users’ privileges directly from MySQL’s privilege tables. The content of these tables may differ from the privileges the server uses, if they have been changed manually. In this case, the privileges have to be reloaded but currently, you don't have the RELOAD privilege.
th: หมายเหตุ: phpMyAdmin ดึงสิทธิ์ของผู้ใช้โดยตรงจากตารางสิทธิ์ของ MySQL เนื้อหาของตารางเหล่านี้อาจแตกต่างจากสิทธิ์ที่เซิร์ฟเวอร์ใช้ หากมีการเปลี่ยนแปลงด้วยตนเอง ในกรณีนี้ จำเป็นต้องโหลดสิทธิ์ใหม่ แต่ปัจจุบันคุณไม่มีสิทธิ์ RELOAD

source: You have added a new user.
th: เพิ่มผู้ใช้ใหม่เรียบร้อยแล้ว

source: A user account allowing any user from localhost to connect is present. This will prevent other users from connecting if the host part of their account allows a connection from any (%) host.
th: มีบัญชีผู้ใช้ที่อนุญาตให้ผู้ใช้ใด ๆ จาก localhost เชื่อมต่อได้ ซึ่งจะปกป้องไม่ให้ผู้ใช้รายอื่นเชื่อมต่อหากส่วนโฮสต์ของบัญชีอนุญาตให้เชื่อมต่อจากโฮสต์ใด ๆ ก็ได้ (%)

source: Handler
th: ตัวจัดการ

source: Query cache
th: แคชคำสั่ง

source: Threads
th: รอบการทำงาน

source: Temporary data
th: ข้อมูลชั่วคราว

source: Delayed inserts
th: การแทรกแบบหน่วงเวลา

source: Key cache
th: แคชคีย์

source: Joins
th: เข้าร่วม

source: Sorting
th: การเรียงลำดับ

source: Transaction coordinator
th: ตัวประสานงานธุรกรรม

source: Flush (close) all tables
th: ล้าง (ปิด) ตารางทั้งหมด

source: Show open tables
th: แสดงตารางที่เปิดอยู่

source: Flush query cache
th: ล้างแคชคำสั่ง

source: ID
th: ไอดี

source: Command
th: คำสั่ง

source: Progress
th: ความคืบหน้า

source: Reading of version failed. Maybe you're offline or the upgrade server does not respond.
th: การอ่านเวอร์ชันล้มเหลว อาจเป็นเพราะคุณออฟไลน์หรือการอัปเกรดเซิร์ฟเวอร์ไม่ตอบสนอง

source: You are using Git version, run [kbd]git pull[/kbd] :-)[br]The latest stable version is %s, released on %s.
th: คุณกำลังใช้เวอร์ชัน Git รัน [kbd]git pull[/kbd] :-)[br]เวอร์ชันเสถียรล่าสุด คือ %s ซึ่งเผยแพร่เมื่อ %s

source: No newer stable version is available
th: ไม่มีเวอร์ชันเสถียรที่ใหม่กว่านี้

source: Using bookmark "%s" as default browse query.
th: ใช้บุ๊กมาร์ก "%s" เป็นค่าเริ่มต้นในการเรียกดูคำสั่ง

source: Showing as PHP code
th: แสดงผลเป็นโค้ด PHP

source: Current selection does not contain a unique column. Grid edit, checkbox, Edit, Copy and Delete features are not available. %s
th: การเลือกปัจจุบันไม่มีคอลัมน์ที่ไม่ซ้ำกัน ฟังก์ชันการแก้ไขตาราง, ช่องทำเครื่องหมาย, การแก้ไข, การคัดลอก และการลบไม่สามารถใช้งานได้ %s

source: Current selection does not contain a unique column. Grid edit, Edit, Copy and Delete features may result in undesired behavior. %s
th: สิ่งที่ถูกเลือกในปัจจุบันไม่มีคอลัมน์ที่ไม่ซ้ำกัน การแก้ไขตาราง การแก้ไข การคัดลอก และการลบ อาจทำให้เกิดคุณลักษณะที่ไม่พึงประสงค์ %s

source: Run SQL query/queries on server “%s”
th: รันคำสั่ง SQL บนเซิร์ฟเวอร์ “%s”

source: Run SQL query/queries on database %s
th: รันคำสั่ง SQL บนฐานข้อมูล %s

source: Run SQL query/queries on table %s
th: รันคำสั่ง SQL บนตาราง %s

source: There is no detailed status information available for this storage engine.
th: ไม่มีข้อมูลสถานะโดยละเอียดสำหรับระบบจัดเก็บข้อมูลนี้

source: %s is available on this MySQL server.
th: %s สามารถใช้งานได้บนเซิร์ฟเวอร์ MySQL นี้

source: %s has been disabled for this MySQL server.
th: %s ถูกปิดใช้งานสำหรับเซิร์ฟเวอร์ MySQL นี้แล้ว

source: This MySQL server does not support the %s storage engine.
th: เซิร์ฟเวอร์ MySQL นี้ไม่รองรับระบบจัดเก็บข้อมูล %s

source: The name of the primary key must be "PRIMARY"!
th: ชื่อของคีย์หลักจะต้องเป็น "PRIMARY" เท่านั้น!

source: Can't rename index to PRIMARY!
th: ไม่สามารถแก้ไขชื่อดัชนีเป็น PRIMARY ได้!

source: No index parts defined!
th: ไม่มีการกำหนดส่วนดัชนี!

source: Problems with indexes of table `%s`
th: ปัญหาเกี่ยวกับดัชนีของตาราง `%s`

source: Source database `%s` was not found!
th: ไม่พบฐานข้อมูลต้นทาง `%s`!

source: Target database `%s` was not found!
th: ไม่พบฐานข้อมูลเป้าหมาย `%s`!

source: Invalid database:
th: ฐานข้อมูลไม่ถูกต้อง:

source: Invalid table name:
th: ชื่อตารางไม่ถูกต้อง:

source: Table %1$s has been renamed to %2$s.
th: ตาราง %1$s ได้ถูกแก้ไขชื่อเป็น %2$s

source: Could not save table UI preferences!
th: ไม่สามารถบันทึกค่ากำหนด UI ของตารางได้!

source: Failed to cleanup table UI preferences (see $cfg['Servers'][$i]['MaxTableUiprefs'] %s)
th: ไม่สามารถล้างค่ากำหนด UI ของตารางได้ (ดู $cfg['Servers'][$i]['MaxTableUiprefs'] %s)

source: Cannot save UI property "%s". The changes made will not be persistent after you refresh this page. Please check if the table structure has been changed.
th: ไม่สามารถบันทึกคุณสมบัติ UI "%s" ได้ การเปลี่ยนแปลงจะไม่คงอยู่หลังจากที่คุณรีเฟรชหน้านี้ โปรดตรวจสอบว่าโครงสร้างตารางมีการเปลี่ยนแปลงแล้ว

source: Error creating foreign key on %1$s (check data types)
th: เกิดข้อผิดพลาดในการสร้างคีย์นอกบน %1$s (ตรวจสอบชนิดข้อมูล)

source: Default theme %s not found!
th: ไม่พบธีมเริ่มต้น %s !

source: Theme %s not found!
th: ไม่พบธีม %s !

source: No valid image path for theme %s found!
th: ไม่พบเส้นทางรูปภาพที่ถูกต้องสำหรับธีม %s!

source: Tracking data definition successfully deleted
th: ข้อมูลนิยามการติดตามถูกลบเรียบร้อยแล้ว

source: Tracking data manipulation successfully deleted
th: การจัดการการติดตามข้อมูลถูกลบเรียบร้อยแล้ว

source: Data definition statement
th: คำชี้แจงนิยามข้อมูล

source: Data manipulation statement
th: คำชี้แจงการจัดการข้อมูล

source: Tracking statements
th: คำสั่งในการติดตาม

source: Delete tracking data row from report
th: ลบแถวข้อมูลการติดตามออกจากรายงาน

source: No data
th: ไม่มีข้อมูล

source: Show %1$s with dates from %2$s to %3$s by user %4$s %5$s
th: แสดง %1$s พร้อมวันที่ตั้งแต่ %2$s ถึง %3$s โดยผู้ใช้ %4$s %5$s

source: SQL dump (file download)
th: ดัมพ์ข้อมูล SQL (ดาวน์โหลดไฟล์)

source: SQL dump
th: ดัมพ์ข้อมูล SQL

source: This option will replace your table and contained data.
th: ตัวเลือกนี้จะแทนที่ตารางและข้อมูลที่อยู่ในตารางของคุณ

source: SQL execution
th: การสั่งรัน SQL

source: Export as %s
th: ส่งออกเป็น %s

source: Version %s snapshot (SQL code)
th: ภาพรวมเวอร์ชัน %s (โค้ด SQL)

source: You can execute the dump by creating and using a temporary database. Please ensure that you have the privileges to do so.
th: คุณสามารถสั่งการดัมพ์ข้อมูลได้โดยการสร้างและใช้งานฐานข้อมูลชั่วคราว โปรดตรวจสอบให้แน่ใจว่าคุณมีสิทธิ์ในการดำเนินการดังกล่าว

source: Comment out these two lines if you do not need them.
th: เครื่องหมายคอมเมนต์สองบรรทัดนี้ไว้ หากคุณไม่ต้องการใช้มัน

source: SQL statements exported. Please copy the dump or execute it.
th: มีการส่งออกคำสั่ง SQL แล้ว โปรดคัดลอกข้อมูลที่ดัมพ์ออกไปหรือสั่งการคำสั่งนั้น

source: Tracking report for table `%s`
th: รายงานการติดตามสำหรับตาราง `%s`

source: Tracking for %1$s was activated at version %2$s.
th: การติดตามสำหรับ %1$s ถูกเปิดใช้งานในเวอร์ชัน %2$s

source: Tracking for %1$s was deactivated at version %2$s.
th: การติดตามสำหรับ %1$s ถูกปิดใช้งานในเวอร์ชัน %2$s

source: Version %1$s of %2$s was deleted.
th: เวอร์ชัน %1$s ของ %2$s ถูกลบแล้ว

source: Version %1$s was created, tracking for %2$s is active.
th: เวอร์ชัน %1$s ถูกสร้างขึ้นแล้ว การติดตามสำหรับ %2$s เปิดใช้งานอยู่

source: Sorry, we failed to restore the dropped trigger.
th: ขออภัย เราไม่สามารถกู้คืนทริกเกอร์ที่โยนทิ้งไปแล้วได้

source: Trigger %1$s has been modified.
th: ทริกเกอร์ %1$s ได้รับการแก้ไขแล้ว

source: Trigger %1$s has been created.
th: ทริกเกอร์ %1$s ถูกสร้างขึ้นแล้ว

source: You must provide a trigger name!
th: คุณต้องระบุชื่อทริกเกอร์!
