Repository: phpmyadmin/phpmyadmin
Catalog: resources/po/*.po
Languages: th

source: The number of streams that are open (used mainly for logging).
th: จำนวนสตรีมที่เปิดอยู่ (ส่วนใหญ่ใช้สำหรับการบันทึกข้อมูล)

source: The number of tables that are open.
th: จำนวนตารางที่เปิดอยู่

source: The number of free memory blocks in query cache. High numbers can indicate fragmentation issues, which may be solved by issuing a FLUSH QUERY CACHE statement.
th: จำนวนบล็อกหน่วยความจำว่างในแคชคำสั่ง ตัวเลขที่สูงอาจบ่งชี้ถึงปัญหาการกระจัดกระจายของหน่วยความจำ ซึ่งสามารถแก้ไขได้โดยการใช้คำสั่ง FLUSH QUERY CACHE

source: The amount of free memory for query cache.
th: ปริมาณหน่วยความจำว่างสำหรับแคชคำสั่ง

source: The number of cache hits.
th: จำนวนการถึงแคช

source: The number of queries added to the cache.
th: จำนวนคำสั่งที่ถูกเพิ่มเข้าไปในแคช

source: The number of queries that have been removed from the cache to free up memory for caching new queries. This information can help you tune the query cache size. The query cache uses a least recently used (LRU) strategy to decide which queries to remove from the cache.
th: จำนวนคำสั่งที่ถูกลบออกจากแคชเพื่อเพิ่มพื้นที่ว่างในหน่วยความจำสำหรับการแคชคำสั่งใหม่ ข้อมูลนี้สามารถช่วยคุณปรับขนาดแคชคำสั่งได้ แคชคำสั่งใช้กลยุทธ์การใช้งานล่าสุดน้อยที่สุด (LRU) เพื่อตัดสินใจว่าจะลบคำสั่งใดออกจากแคช

source: The number of non-cached queries (not cachable, or not cached due to the query_cache_type setting).
th: จำนวนของคำสั่งที่ไม่ถูกแคช (ไม่สามารถแคชได้ หรือไม่ถูกแคชเนื่องจากการตั้งค่า query_cache_type)

source: The number of queries registered in the cache.
th: จำนวนคำสั่งที่ลงทะเบียนไว้ในแคช

source: The total number of blocks in the query cache.
th: จำนวนบล็อกทั้งหมดในแคชคำสั่ง

source: The status of failsafe replication (not yet implemented).
th: สถานะของการจำลองข้อมูลแบบป้องกันความล้มเหลว (ยังไม่ได้นำมาใช้งาน)

source: The number of joins that do not use indexes. If this value is not 0, you should carefully check the indexes of your tables.
th: จำนวนการเชื่อมต่อตารางที่ไม่ใช้ดัชนี หากค่านี้ไม่ใช่ 0 คุณควรตรวจสอบดัชนีของตารางอย่างละเอียด

source: The number of joins that used a range search on a reference table.
th: จำนวนการเชื่อมต่อที่ใช้การค้นหาช่วงบนตารางอ้างอิง

source: The number of joins without keys that check for key usage after each row. (If this is not 0, you should carefully check the indexes of your tables.)
th: จำนวนการเชื่อมต่อที่ไม่มีคีย์ซึ่งตรวจสอบการใช้งานคีย์แต่ละแถว (หากค่านี้ไม่ใช่ 0 คุณควรตรวจสอบดัชนีของตารางของคุณอย่างละเอียด)

source: The number of joins that used ranges on the first table. (It's normally not critical even if this is big.)
th: จำนวนการเชื่อมต่อที่ใช้ช่วงข้อมูลในตารางแรก (โดยปกติแล้วไม่สำคัญมากนัก แม้ว่าจะมีจำนวนมากก็ตาม)

source: The number of joins that did a full scan of the first table.
th: จำนวนการเชื่อมต่อที่ทำการสแกนตารางแรกเต็มรูปแบบ

source: The number of temporary tables currently open by the replica SQL thread.
th: จำนวนตารางชั่วคราวที่เปิดใช้งานอยู่ในขณะนี้โดยรอบการทำงาน SQL จำลอง

source: Total (since startup) number of times the replication replica SQL thread has retried transactions.
th: จำนวนครั้งทั้งหมด (นับตั้งแต่เริ่มต้น) ที่รอบการทำงาน SQL ของการจำลองแบบได้ลองทำธุรกรรมซ้ำแล้ว

source: This is ON if this server is a replica that is connected to a primary.
th: ฟังก์ชันนี้จะเปิดใช้งานหากเซิร์ฟเวอร์นี้เป็นเซิร์ฟเวอร์จำลองที่เชื่อมต่อกับเซิร์ฟเวอร์หลัก

source: The number of threads that have taken more than slow_launch_time seconds to create.
th: จำนวนรอบการทำงานที่ใช้เวลาสร้างนานกว่า slow_launch_time วินาที

source: The number of queries that have taken more than long_query_time seconds.
th: จำนวนคำสั่งที่ใช้เวลานานกว่า long_query_time วินาที

source: The number of merge passes the sort algorithm has had to do. If this value is large, you should consider increasing the value of the sort_buffer_size system variable.
th: จำนวนรอบการรวมข้อมูลที่อัลกอริทึมการเรียงลำดับต้องทำ หากค่านี้มีขนาดใหญ่ คุณควรพิจารณาเพิ่มค่าตัวแปรระบบ sort_buffer_size

source: The number of sorts that were done with ranges.
th: จำนวนการเรียงลำดับที่ทำโดยใช้ช่วงข้อมูล

source: The number of sorted rows.
th: จำนวนแถวที่เรียงลำดับแล้ว

source: The number of sorts that were done by scanning the table.
th: จำนวนการเรียงลำดับที่ทำโดยการสแกนตาราง

source: The number of times that a table lock was acquired immediately.
th: จำนวนครั้งที่ล็อกตารางสำเร็จในทันที

source: The number of times that a table lock could not be acquired immediately and a wait was needed. If this is high, and you have performance problems, you should first optimize your queries, and then either split your table or tables or use replication.
th: จำนวนครั้งที่ไม่สามารถล็อกตารางได้ทันทีและต้องรอ หากค่านี้สูงและทำให้คุณประสบปัญหาด้านประสิทธิภาพ คุณควรปรับปรุงประสิทธิภาพของคำสั่งก่อน จากนั้นจึงค่อยแบ่งตารางหรือใช้การจำลองข้อมูล

source: The number of threads in the thread cache. The cache hit rate can be calculated as Threads_created/Connections. If this value is red you should raise your thread_cache_size.
th: จำนวนรอบการทำงานในแคชรอบการทำงาน อัตราการถึงแคชสามารถคำนวณได้จาก Threads_created / Connections หากค่านี้เป็นสีแดง คุณควรเพิ่มค่า thread_cache_size

source: The number of currently open connections.
th: จำนวนการเชื่อมต่อที่เปิดใช้งานอยู่ในปัจจุบัน

source: The number of threads created to handle connections. If Threads_created is big, you may want to increase the thread_cache_size value. (Normally this doesn't give a notable performance improvement if you have a good thread implementation.)
th: จำนวนรอบการทำงานที่สร้างขึ้นเพื่อรองรับการเชื่อมต่อ หากค่า Threads_created มีขนาดใหญ่ คุณอาจต้องการเพิ่มค่า thread_cache_size (โดยปกติแล้ว การทำเช่นนี้จะไม่ทำให้ประสิทธิภาพดีขึ้นอย่างเห็นได้ชัด หากคุณมีการใช้งานรอบการทำงานที่ดีอยู่แล้ว)

source: Thread cache hit rate (calculated value)
th: อัตราการถึงแคชรอบการทำงาน (ค่าที่คำนวณได้)

source: The number of threads that are not sleeping.
th: จำนวนรอบการทำงานที่ไม่เข้าสู่โหมดพักการทำงาน

source: Setting variable failed
th: การตั้งค่าตัวแปรล้มเหลว

source: Configuration already exists, setup is disabled!
th: การกำหนดค่ามีอยู่แล้ว การตั้งค่าถูกปิดใช้งาน!

source: Incorrect form specified!
th: ระบุรูปแบบไม่ถูกต้อง!

source: You are not using a secure connection; all data (including potentially sensitive information, like passwords) is transferred unencrypted!
th: คุณไม่ได้ใช้การเชื่อมต่อที่ปลอดภัย; ข้อมูลทั้งหมด (รวมถึงข้อมูลที่อาจมีความอ่อนไหว เช่น รหัสผ่าน) ถูกส่งผ่านโดยไม่มีการเข้ารหัส!

source: If your server is also configured to accept HTTPS requests follow this link to use a secure connection.
th: หากเซิร์ฟเวอร์ของคุณได้รับการกำหนดค่าให้ยอมรับคำขอ HTTPS แล้ว ให้คลิกลิงก์นี้เพื่อใช้การเชื่อมต่อที่ปลอดภัย

source: Insecure connection
th: การเชื่อมต่อที่ไม่ปลอดภัย

source: Wrong data
th: ข้อมูลไม่ถูกต้อง

source: Wrong data or no validation for %s
th: ข้อมูลไม่ถูกต้องหรือไม่มีการตรวจสอบความถูกต้องสำหรับ %s

source: Bookmark %s has been created.
th: บุ๊กมาร์ก %s ถูกสร้างขึ้นแล้ว

source: Bookmark not created!
th: ไม่ได้สร้างบุ๊กมาร์ก!

source: Table %1$s has been altered successfully.
th: ตาราง %1$s ได้รับการแก้ไขเรียบร้อยแล้ว

source: No row selected.
th: ไม่ได้เลือกแถวใด ๆ

source: No SQL query was set to fetch data.
th: ไม่ได้ตั้งค่าคำสั่ง SQL เพื่อดึงข้อมูล

source: No numeric columns present in the table to plot.
th: ไม่มีคอลัมน์ตัวเลขในตารางให้สร้างกราฟ

source: No data to display
th: ไม่มีข้อมูลแสดง

source: '%s' database does not exist.
th: ฐานข้อมูล '%s' ไม่มีอยู่จริง

source: Table %s already exists!
th: ตาราง %s มีอยู่แล้ว!

source: No column selected.
th: ไม่ได้เลือกคอลัมน์ใด ๆ

source: %1$d column has been dropped successfully.
th: คอลัมน์ %1$d ถูกลบเรียบร้อยแล้ว

source: Invalid table name
th: ชื่อตารางไม่ถูกต้อง

source: There is an issue with your request.
th: มีปัญหาเกี่ยวกับคำขอของคุณ

source: MySQL returned an empty result set (i.e. zero rows).
th: MySQL ส่งคืนชุดผลลัพธ์ว่างเปล่า (กล่าวคือ ศูนย์แถว)

source: Maintenance operations on multiple tables are disabled.
th: การดำเนินการบำรุงรักษาบนหลายตารางถูกปิดใช้งานแล้ว

source: Display column was successfully updated.
th: คอลัมน์แสดงผลได้รับการอัปเดตเรียบร้อยแล้ว

source: Internal relationships were successfully updated.
th: ความสัมพันธ์ภายในได้รับการปรับปรุงเรียบร้อยแล้ว

source: Row: %1$s, Column: %2$s, Error: %3$s
th: แถว: %1$s, คอลัมน์: %2$s, ข้อผิดพลาด: %3$s

source: Invalid request parameter.
th: พารามิเตอร์คำขอไม่ถูกต้อง

source: The columns have been moved successfully.
th: คอลัมน์ถูกเคลื่อนย้ายเรียบร้อยแล้ว

source: The selected columns are already in the correct order.
th: คอลัมน์ที่เลือกไว้เรียงลำดับถูกต้องแล้ว

source: Query error
th: คำสั่งเรียกดูผิดพลาด

source: The name '%s' is a MySQL reserved keyword.
th: ชื่อ '%s' เป็นคำสงวนของ MySQL

source: Table %1$s has been altered successfully. Privileges have been adjusted.
th: ตาราง %1$s ได้รับการแก้ไขเรียบร้อยแล้ว สิทธิ์การใช้งานปรับปรุงแล้ว

source: Tracking of %s is activated.
th: การติดตาม %s ถูกเปิดใช้งานแล้ว

source: SQL statements executed.
th: คำสั่ง SQL ถูกสั่งการแล้ว

source: Tracking versions deleted successfully.
th: ลบการติดตามเวอร์ชันสำเร็จแล้ว

source: No versions selected.
th: ไม่ได้เลือกเวอร์ชันใด ๆ

source: Add trigger
th: เพิ่มทริกเกอร์

source: Edit trigger
th: แก้ไขทริกเกอร์

source: No trigger with name %1$s found in database %2$s.
th: ไม่พบทริกเกอร์ %1$s ในฐานข้อมูล %2$s

source: You don't have sufficient privileges to be here right now!
th: คุณไม่มีสิทธิ์เพียงพอที่จะอยู่ที่นี่ในตอนนี้!

source: View name can not be empty!
th: ชื่อมุมมองต้องไม่เป็นค่าว่าง!

source: The %s extension is missing. Please check your PHP configuration.
th: ส่วนขยาย %s ขาดหายไป กรุณาตรวจสอบการกำหนดค่าของ PHP

source: Could not add %1$s as they already exist in central list!
th: ไม่สามารถเพิ่ม %1$s เนื่องจากมีอยู่ในรายการส่วนกลางแล้ว!

source: Could not add columns!
th: ไม่สามารถเพิ่มคอลัมน์ได้!

source: Couldn't remove Column(s) %1$s as they don't exist in central columns list!
th: ไม่สามารถลบคอลัมน์ %1$s เนื่องจากไม่มีอยู่ในรายการคอลัมน์ส่วนกลาง!

source: Could not remove columns!
th: ไม่สามารถลบคอลัมน์ได้!

source: The configuration storage is not ready for the central list of columns feature.
th: ที่จัดเก็บการตั้งค่าไม่พร้อมสำหรับฟีเจอร์รายการคอลัมน์ส่วนกลาง

source: phpMyAdmin configuration storage is not configured for "Display Features".
th: พื้นที่จัดเก็บการกำหนดค่า phpMyAdmin ไม่ได้ถูกกำหนดไว้สำหรับ "การแสดงคุณสมบัติ"

source: Error: relationship already exists.
th: ข้อผิดพลาด: ความสัมพันธ์นี้มีอยู่แล้ว

source: FOREIGN KEY relationship has been added.
th: ได้เพิ่มความสัมพันธ์ FOREIGN KEY แล้ว

source: Error: FOREIGN KEY relationship could not be added!
th: ข้อผิดพลาด: ไม่สามารถเพิ่มความสัมพันธ์ FOREIGN KEY ได้!

source: Error: Missing index on column(s).
th: ข้อผิดพลาด: ไม่พบดัชนีในคอลัมน์ใด ๆ

source: Error: Relational features are disabled!
th: ข้อผิดพลาด: คุณสมบัติเชิงสัมพันธ์ถูกปิดใช้งาน!

source: Internal relationship has been added.
th: มีการเพิ่มความสัมพันธ์ภายในแล้ว

source: Error: Internal relationship could not be added!
th: ข้อผิดพลาด: ไม่สามารถเพิ่มความสัมพันธ์ภายในได้!

source: FOREIGN KEY relationship has been removed.
th: ความสัมพันธ์ FOREIGN KEY ถูกลบออกแล้ว

source: Error: Internal relationship could not be removed!
th: ข้อผิดพลาด: ไม่สามารถลบความสัมพันธ์ภายในได้!

source: Internal relationship has been removed.
th: ความสัมพันธ์ภายในถูกลบออกแล้ว

source: Could not load schema plugins, please check your installation!
th: ไม่สามารถโหลดปลั๊กอินโครงร่างได้ โปรดตรวจสอบการติดตั้งของคุณ!

source: The following query has failed: "%s"
th: คำสั่งการเรียกดูต่อไปนี้ล้มเหลว: "%s"

source: MySQL said:
th: MySQL แจ้งว่า:

source: Sorry, we failed to restore the dropped event.
th: ขออภัย เราไม่สามารถกู้คืนกิจกรรมที่โยนทิ้งแล้วได้

source: The backed up query was:
th: คำสั่งเรียกดูที่สำรองไว้คือ:

source: Event %1$s has been modified.
th: กิจกรรม %1$s ได้รับการแก้ไขแล้ว

source: Event %1$s has been created.
th: เหตุการณ์ %1$s ถูกสร้างขึ้นแล้ว

source: One or more errors have occurred while processing your request:
th: เกิดข้อผิดพลาดอย่างน้อยหนึ่งรายการระหว่างการประมวลผลคำขอของคุณ:

source: The definer must be in the "username@hostname" format!
th: ตัวกำหนดค่าต้องอยู่ในรูปแบบ "username@hostname"!

source: You must provide an event name!
th: คุณต้องระบุชื่อกิจกรรม!

source: You must provide a valid interval value for the event.
th: คุณต้องระบุค่าช่วงเวลาที่ถูกต้องสำหรับเหตุการณ์นั้น

source: You must provide a valid execution time for the event.
th: คุณต้องระบุเวลาดำเนินการที่ถูกต้องสำหรับกิจกรรมนั้น

source: You must provide a valid type for the event.
th: คุณต้องระบุประเภทที่ถูกต้องสำหรับกิจกรรมนั้น

source: You must provide an event definition.
th: คุณต้องระบุคำจำกัดความของเหตุการณ์

source: Invalid routine type: "%s"
th: ประเภทรูทีนไม่ถูกต้อง: "%s"

source: Routine %1$s has been created.
th: รูทีน %1$s ถูกสร้างขึ้นเรียบร้อยแล้ว

source: Sorry, we failed to restore the dropped routine.
th: ขออภัย เราไม่สามารถกู้คืนรูทีนที่โยนทิ้งได้

source: Routine %1$s has been modified. Privileges have been adjusted.
th: รูทีน %1$s ได้รับการแก้ไขแล้ว สิทธิ์การใช้งานได้รับการปรับเปลี่ยนแล้ว

source: Routine %1$s has been modified.
th: รูทีน %1$s ได้รับการแก้ไขแล้ว

source: You must provide a name and a type for each routine parameter.
th: คุณต้องระบุชื่อและประเภทสำหรับพารามิเตอร์แต่ละตัวของรูทีน

source: Invalid direction "%s" given for parameter.
th: ระบุทิศทาง "%s" ไม่ถูกต้องสำหรับพารามิเตอร์

source: You must provide length/values for routine parameters of type ENUM, SET, VARCHAR and VARBINARY.
th: คุณต้องระบุความยาว/ค่าสำหรับพารามิเตอร์ของรูทีนประเภท ENUM, SET, VARCHAR และ VARBINARY

source: You must provide a valid return type for the routine.
th: คุณต้องระบุประเภทค่าส่งคืนที่ถูกต้องสำหรับรูทีนนี้

source: You must provide a routine name!
th: คุณต้องระบุชื่อรูทีน!

source: You must provide a routine definition.
th: คุณต้องระบุคำจำกัดความของรูทีน

source: Execution results of routine %s
th: ผลลัพธ์การดำเนินการของรูทีน %s

source: %d row affected by the last statement inside the procedure.
th: แถวที่ %d ได้รับผลกระทบจากคำสั่งสุดท้ายภายในขั้นตอนการทำงาน

source: Unable to use timezone "%1$s" for server %2$d. Please check your configuration setting for [em]$cfg['Servers'][%3$d]['SessionTimeZone'][/em]. phpMyAdmin is currently using the default time zone of the database server.
th: ไม่สามารถใช้เขตเวลา "%1$s" สำหรับเซิร์ฟเวอร์ %2$d ได้ กรุณาตรวจสอบการกำหนดค่าสำหรับ [em]$cfg['Servers'][%3$d]['SessionTimeZone'][/em] ขณะนี้ phpMyAdmin กำลังใช้เขตเวลาเริ่มต้นของเซิร์ฟเวอร์ฐานข้อมูล

source: Failed to set configured collation connection!
th: ไม่สามารถกำหนดค่าการเชื่อมต่อการเรียงลำดับที่กำหนดค่าไว้ได้!

source: Error 1045: Access denied for user. Additional error information may be available, but is being hidden by the %s configuration directive.
th: ข้อผิดพลาด 1045: ผู้ใช้ไม่ได้รับอนุญาตให้เข้าถึง ข้อมูลความผิดพลาดเพิ่มเติมอาจมีอยู่ แต่ถูกซ่อนไว้โดยคำสั่งการกำหนดค่า %s

source: The row has been deleted.
th: แถวนั้นถูกลบแล้ว

source: Showing rows %1s - %2s
th: กำลังแสดงแถว %1s - %2s

source: %1$s total, %2$s in query
th: ทั้งหมด %1$s, %2$s ในคำสั่ง

source: %s total
th: ทั้งหมด %s

source: Link not found!
th: ไม่พบลิงก์!

source: Data home directory
th: ไดเร็กทอรีข้อมูลหน้าหลัก

source: The common part of the directory path for all InnoDB data files.
th: ส่วนที่ใช้ร่วมกันของเส้นทางไดเร็กทอรีสำหรับไฟล์ข้อมูล InnoDB ทั้งหมด

source: Data files
th: ไฟล์ข้อมูล

source: Autoextend increment
th: เพิ่มค่าอัตโนมัติ

source: The increment size for extending the size of an autoextending tablespace when it becomes full.
th: การขยายขนาดสำหรับการเพิ่มพื้นที่ตารางอัตโนมัติเมื่อเต็ม

source: Buffer pool size
th: ขนาดบัฟเฟอร์พูล

source: The size of the memory buffer InnoDB uses to cache data and indexes of its tables.
th: ขนาดของบัฟเฟอร์หน่วยความจำที่ InnoDB ใช้ในการแคชข้อมูลและดัชนีของตารางต่าง ๆ

source: Buffer Pool
th: บัฟเฟอร์พูล

source: InnoDB Status
th: สถานะของ InnoDB

source: Data pointer size
th: ขนาดตัวชี้ข้อมูล

source: The default pointer size in bytes, to be used by CREATE TABLE for MyISAM tables when no MAX_ROWS option is specified.
th: ขนาดพอยน์เตอร์เริ่มต้นมีหน่วยเป็นไบต์ที่จะใช้โดยคำสั่ง CREATE TABLE สำหรับตาราง MyISAM เมื่อไม่ได้ระบุตัวเลือก MAX_ROWS

source: Automatic recovery mode
th: โหมดการกู้คืนอัตโนมัติ

source: The mode for automatic recovery of crashed MyISAM tables, as set via the --myisam-recover server startup option.
th: โหมดสำหรับการกู้คืนตาราง MyISAM อัตโนมัติที่เสียหาย ตามที่ตั้งค่าไว้ผ่านตัวเลือกการเริ่มต้นเซิร์ฟเวอร์ --myisam-recover

source: Maximum size for temporary sort files
th: ขนาดสูงสุดสำหรับไฟล์ที่ถูกจัดเรียงชั่วคราว

source: The maximum size of the temporary file MySQL is allowed to use while re-creating a MyISAM index (during REPAIR TABLE, ALTER TABLE, or LOAD DATA INFILE).
th: ขนาดสูงสุดของไฟล์ชั่วคราวที่ MySQL ที่อนุญาตให้ใช้ขณะสร้างดัชนี MyISAM ใหม่ (ระหว่างคำสั่ง REPAIR TABLE, ALTER TABLE หรือ LOAD DATA INFILE)

source: Maximum size for temporary files on index creation
th: ขนาดสูงสุดสำหรับไฟล์ชั่วคราวเมื่อสร้างดัชนี

source: If the temporary file used for fast MyISAM index creation would be larger than using the key cache by the amount specified here, prefer the key cache method.
th: หากไฟล์ชั่วคราวที่ใช้สำหรับการสร้างดัชนี MyISAM อย่างรวดเร็วมีขนาดใหญ่กว่าการใช้แคชคีย์ตามจำนวนที่ระบุไว้ที่นี่ ให้เลือกใช้วิธีแคชคีย์

source: Repair threads
th: ซ่อมแซมรอบงาน

source: If this value is greater than 1, MyISAM table indexes are created in parallel (each index in its own thread) during the repair by sorting process.
th: หากค่านี้มากกว่า 1 ดัชนีตาราง MyISAM จะถูกสร้างขึ้นแบบขนาน (แต่ละดัชนีในรอบงานของตัวเอง) ในระหว่างกระบวนการซ่อมแซมโดยการเรียงลำดับ

source: Sort buffer size
th: ขนาดบัฟเฟอร์การเรียงลำดับ

source: The buffer that is allocated when sorting MyISAM indexes during a REPAIR TABLE or when creating indexes with CREATE INDEX or ALTER TABLE.
th: บัฟเฟอร์ที่ถูกจัดสรรเมื่อทำการเรียงลำดับดัชนี MyISAM ในระหว่างการซ่อมแซมตาราง (REPAIR TABLE) หรือเมื่อสร้างดัชนีด้วยคำสั่ง CREATE INDEX หรือ ALTER TABLE

source: Index cache size
th: ขนาดแคชดัชนี

source: This is the amount of memory allocated to the index cache. Default value is 32MB. The memory allocated here is used only for caching index pages.
th: นี่คือปริมาณหน่วยความจำที่จัดสรรให้กับแคชดัชนี ค่าเริ่มต้นคือ 32 เมกะไบต์ หน่วยความจำที่จัดสรรไว้ที่นี่ใช้สำหรับการแคชหน้าดัชนีเท่านั้น

source: Record cache size
th: ขนาดแคชการบันทึก

source: This is the amount of memory allocated to the record cache used to cache table data. The default value is 32MB. This memory is used to cache changes to the handle data (.xtd) and row pointer (.xtr) files.
th: นี่คือปริมาณหน่วยความจำที่จัดสรรให้กับแคชการบันทึก ซึ่งใช้ในการเก็บข้อมูลตาราง ค่าเริ่มต้นคือ 32 เมกะไบต์ หน่วยความจำนี้ใช้ในการแคชการเปลี่ยนแปลงของไฟล์ที่จัดการข้อมูล (.xtd) และไฟล์ตัวชี้แถว (.xtr)

source: Log cache size
th: ขนาดแคชการบันทึก

source: The amount of memory allocated to the transaction log cache used to cache on transaction log data. The default is 16MB.
th: ปริมาณหน่วยความจำที่จัดสรรให้กับแคชบันทึกรายการใช้สำหรับแคชข้อมูลบันทึกรายการ ค่าเริ่มต้นคือ 16 เมกะไบต์

source: Log file threshold
th: เกณฑ์ไฟล์บันทึก

source: The size of a transaction log before rollover, and a new log is created. The default value is 16MB.
th: ขนาดของไฟล์บันทึกรายการก่อนที่จะมีการหมุนเวียน และเมื่อมีการสร้างไฟล์บันทึกใหม่ ค่าเริ่มต้นคือ 16 เมกะไบต์

source: Transaction buffer size
th: ขนาดบัฟเฟอร์การทำรายการ

source: The size of the global transaction log buffer (the engine allocates 2 buffers of this size). The default is 1MB.
th: ขนาดของบัฟเฟอร์บันทึกรายการทั้งระบบ (ระบบจัดสรร 2 บัฟเฟอร์ด้วยขนาดนี้) ค่าเริ่มต้นคือ 1 เมกะไบต์

source: Checkpoint frequency
th: ความถี่จุดตรวจสอบ

source: The amount of data written to the transaction log before a checkpoint is performed. The default value is 24MB.
th: ปริมาณข้อมูลที่จะเขียนลงในไฟล์บันทึกรายการก่อนที่จะทำการตรวจสอบจุดเปลี่ยน (checkpoint) ค่าเริ่มต้นคือ 24 เมกะไบต์

source: Data log threshold
th: เกณฑ์การบันทึกข้อมูล

source: The maximum size of a data log file. The default value is 64MB. PBXT can create a maximum of 32000 data logs, which are used by all tables. So the value of this variable can be increased to increase the total amount of data that can be stored in the database.
th: ขนาดสูงสุดของไฟล์บันทึกข้อมูล ค่าเริ่มต้นคือ 64 เมกกะไบต์ ค่า PBXT สามารถสร้างไฟล์บันทึกข้อมูลได้สูงสุด 32,000 ข้อมูล ซึ่งจะถูกใช้โดยทุกตาราง ดังนั้น ค่าของตัวแปรนี้สามารถเพิ่มขึ้นเพื่อเพิ่มปริมาณข้อมูลทั้งหมดที่สามารถจัดเก็บในฐานข้อมูลได้

source: Garbage threshold
th: เกณฑ์ขยะ

source: The percentage of garbage in a data log file before it is compacted. This is a value between 1 and 99. The default is 50.
th: เปอร์เซ็นต์ของข้อมูลขยะในไฟล์บันทึกข้อมูลก่อนที่จะถูกบีบอัด ค่านี้อยู่ระหว่าง 1 ถึง 99 ค่าเริ่มต้นคือ 50

source: Log buffer size
th: ขนาดบัฟเฟอร์บันทึก

source: The size of the buffer used when writing a data log. The default is 256MB. The engine allocates one buffer per thread, but only if the thread is required to write a data log.
th: ขนาดของบัฟเฟอร์ที่ใช้ในการเขียนบันทึกข้อมูล ค่าเริ่มต้นคือ 256 เมกกะไบต์ ระบบจะจัดสรรหนึ่งบัฟเฟอร์ต่อรอบงาน แต่เฉพาะในกรณีที่รอบงานนั้นจำเป็นสำหรับการเขียนบันทึกข้อมูลเท่านั้น

source: Data file grow size
th: ขนาดไฟล์ข้อมูลเพิ่มขึ้น

source: The grow size of the handle data (.xtd) files.
th: ขนาดของไฟล์ที่เพิ่มขึ้นในการจัดการข้อมูล (.xtd)

source: Row file grow size
th: ขนาดของไฟล์แถวเพิ่มขึ้น

source: The grow size of the row pointer (.xtr) files.
th: ขนาดของไฟล์ที่เพิ่มขึ้นของตัวชี้แถว (.xtr)

source: Log file count
th: จำนวนไฟล์บันทึก

source: This is the number of transaction log files (pbxt/system/xlog*.xt) the system will maintain. If the number of logs exceeds this value then old logs will be deleted, otherwise they are renamed and given the next highest number.
th: นี่คือจำนวนไฟล์บันทึกรายการ (pbxt/system/xlog*.xt) ที่ระบบจะเก็บรักษาไว้ หากจำนวนไฟล์บันทึกเกินค่านี้ ไฟล์บันทึกเก่าจะถูกลบออก มิฉะนั้น ไฟล์บันทึกจะถูกแก้ไขชื่อและกำหนดหมายเลขใหม่ให้สูงกว่าค่าก่อนหน้า

source: Documentation and further information about PBXT can be found on the %sPrimeBase XT Home Page%s.
th: เอกสารและข้อมูลเพิ่มเติมเกี่ยวกับ PBXT สามารถดูได้ที่ %sPrimeBase XT Home Page%s

source: Too many error messages, some are not displayed.
th: มีข้อความผิดพลาดจำนวนมากเกินไป บางส่วนจึงไม่แสดง

source: Report
th: รายงาน

source: Access denied!
th: การเข้าถึงถูกปฏิเสธ!

source: You have been automatically logged out due to inactivity of %s seconds. Once you log in again, you should be able to resume the work where you left off.
th: คุณถูกให้ลงชื่อออกโดยอัตโนมัติเนื่องจากไม่มีการใช้งานเป็นเวลา %s วินาที เมื่อคุณลงชื่อเข้าใช้อีกครั้ง คุณจะสามารถทำงานต่อจากจุดเดิมได้

source: Exporting a raw query is not supported for this export method.
th: วิธีการส่งออกนี้ไม่รองรับการส่งออกคำสั่งหยาบ

source: Insufficient space to save the file %s.
th: พื้นที่ไม่เพียงพอที่จะบันทึกไฟล์ %s

source: File %s already exists on server, change filename or check overwrite option.
th: ไฟล์ %s มีอยู่แล้วบนเซิร์ฟเวอร์ โปรดเปลี่ยนชื่อไฟล์หรือเลือกตัวเลือกการเขียนทับ

source: The web server does not have permission to save the file %s.
th: เว็บเซิร์ฟเวอร์ไม่มีสิทธิ์ในการบันทึกไฟล์ %s

source: Dump has been saved to file %s.
th: ข้อมูลที่ส่งออกถูกบันทึกไว้ในไฟล์ %s

source: Could not save recent table!
th: ไม่สามารถบันทึกตารางล่าสุด

source: Could not save favorite table!
th: ไม่สามารถบันทึกตารางโปรดได้

source: File was not an uploaded file.
th: ไม่ใช่ไฟล์ที่อัปโหลดไว้

source: The uploaded file exceeds the upload_max_filesize directive in php.ini.
th: ไฟล์ที่อัปโหลดมีขนาดเกินค่า upload_max_filesize ที่กำหนดไว้ในไฟล์ php.ini

source: The uploaded file exceeds the MAX_FILE_SIZE directive that was specified in the HTML form.
th: ไฟล์ที่อัปโหลดมีขนาดเกินกว่าค่า MAX_FILE_SIZE ที่กำหนดไว้ในแบบฟอร์ม HTML

source: The uploaded file was only partially uploaded.
th: ไฟล์ที่อัปโหลดเป็นเพียงบางส่วนเท่านั้น

source: Missing a temporary folder.
th: ไม่พบแฟ้มชั่วคราว
