Repository: phpmyadmin/phpmyadmin
Catalog: resources/po/*.po
Languages: th

source: A newer version of phpMyAdmin is available and you should consider upgrading. The newest version is %s, released on %s.
th: มีเวอร์ชันใหม่ของ phpMyAdmin ให้ใช้งานแล้ว และคุณควรพิจารณาอัปเกรด เวอร์ชันล่าสุดคือ %s ซึ่งเผยแพร่เมื่อวันที่ %s

source: , latest stable version:
th: , รุ่นเสถียรล่าสุด:

source: up to date
th: ล่าสุด

source: There was an error in loading the Git information.
th: เกิดข้อผิดพลาดในการโหลดข้อมูล Git

source: A fatal JavaScript error has occurred. Would you like to send an error report?
th: เกิดข้อผิดพลาดที่ร้ายแรงกับ JavaScript คุณต้องการส่งรายงานข้อผิดพลาดหรือไม่?

source: Change report settings
th: เปลี่ยนการตั้งค่ารายงาน

source: Show report details
th: แสดงรายละเอียดรายงาน

source: Your export is incomplete, due to a low execution time limit at the PHP level!
th: การส่งออกของคุณไม่สมบูรณ์ เนื่องจากเวลาในการประมวลผลต่ำเกินไปในระดับ PHP!

source: Warning: a form on this page has more than %d fields. On submission, some of the fields might be ignored, due to PHP's max_input_vars configuration.
th: คำเตือน: แบบฟอร์มในหน้านี้มีช่องกรอกข้อมูลมากกว่า %d ช่อง เมื่อส่งแบบฟอร์ม ช่องกรอกข้อมูลบางช่องอาจถูกละเว้นเนื่องจากการตั้งค่า max_input_vars ของ PHP

source: Some errors have been detected on the server!
th: ตรวจพบข้อผิดพลาดบางอย่างบนเซิร์ฟเวอร์!

source: Please look at the bottom of this window.
th: กรุณาดูที่ด้านล่างของหน้าต่าง

source: Ignore All
th: ละเว้นทั้งหมด

source: As per your settings, they are being submitted currently, please be patient.
th: ตามการตั้งค่าของคุณ พวกมันกำลังถูกส่งในขณะนี้กรุณาอดทนรอ

source: Column name successfully copied to clipboard!
th: คัดลอกชื่อคอลัมน์ไปยังคลิปบอร์ดเรียบร้อยแล้ว!

source: Column name copying to clipboard failed!
th: คัดลอกชื่อคอลัมน์ไปยังคลิปบอร์ดล้มเหลว!

source: Successfully copied!
th: คัดลอกสำเร็จแล้ว!

source: Execute this query again?
th: เรียกใช้คำสั่งนี้อีกครั้งหรือไม่?

source: Do you really want to delete this bookmark?
th: คุณแน่ใจว่าต้องการจะลบบุ๊กมาร์กนี้?

source: Some error occurred while getting SQL debug info.
th: เกิดข้อผิดพลาดบางอย่างขณะดึงข้อมูลการดีบัก SQL

source: %s queries executed %s times in %s seconds.
th: %s คำสั่งถูกเรียกใช้ %s ครั้งภายใน %s วินาที

source: %s argument(s) passed
th: ตัวแปรเข้า %s ตัวถูกตรวจผ่าน

source: Show arguments
th: แสดงตัวแปรเข้า

source: Hide arguments
th: ซ่อนตัวแปรเข้า

source: There was a problem accessing your browser storage, some features may not work properly for you. It is likely that the browser doesn't support storage or the quota limit has been reached. In Firefox, corrupted storage can also cause such a problem, clearing your "Offline Website Data" might help. In Safari, such problem is commonly caused by "Private Mode Browsing".
th: เกิดปัญหาในการเข้าถึงพื้นที่จัดเก็บข้อมูลของเบราว์เซอร์ของคุณ บางฟีเจอร์อาจทำงานไม่ถูกต้อง อาจเป็นเพราะเบราว์เซอร์ไม่รองรับพื้นที่จัดเก็บข้อมูล หรือพื้นที่จัดเก็บข้อมูลเต็มแล้ว ใน Firefox พื้นที่จัดเก็บข้อมูลที่เสียหายก็อาจทำให้เกิดปัญหาเช่นนี้ได้ การล้าง "ข้อมูลเว็บไซต์แบบออฟไลน์" อาจช่วยได้ ใน Safari ปัญหาดังกล่าวส่วนใหญ่มักเกิดจาก "การเรียกดูในโหมดส่วนตัว"

source: Copy tables to
th: คัดลอกตารางไปยัง

source: Add table prefix
th: เพิ่มคำนำหน้าตาราง

source: Replace table with prefix
th: แทนที่ตารางด้วยคำนำหน้า

source: Extremely weak
th: อ่อนแออย่างยิ่ง

source: Very weak
th: อ่อนแอมาก

source: Weak
th: อ่อนแอ

source: Good
th: ดี

source: Strong
th: แข็งแรง

# U2F error
source: Invalid request sent to security key.
th: ส่งคำขอที่ไม่ถูกต้องไปยังคีย์ความปลอดภัย

# U2F error
source: Client does not support security key.
th: ลูกข่ายไม่รองรับคีย์ความปลอดภัย

source: WebAuthn is not available. Please use a supported browser in a secure context (HTTPS).
th: WebAuthn ไม่พร้อมใช้งาน โปรดใช้เบราว์เซอร์ที่รองรับในบริบทที่ปลอดภัย (HTTPS)

source: You can not open, save or delete your page layout, as IndexedDB is not working in your browser and your phpMyAdmin configuration storage is not configured for this.
th: คุณไม่สามารถเปิด บันทึก หรือลบเค้าโครงหน้าเพจของคุณได้ เนื่องจาก IndexedDB ไม่ทำงานในเบราว์เซอร์ของคุณ และพื้นที่จัดเก็บการกำหนดค่า phpMyAdmin ของคุณไม่ได้ถูกตั้งค่าไว้สำหรับสิ่งนี้

# The table already exists in the designer and can not be added once more.
source: Table %s already exists!
th: มีตาราง %s อยู่แล้ว!

source: Hide
th: ซ่อน

# Next month
source: Next
th: ต่อไป

source: Today
th: วันนี้

source: This field is required
th: ช่องนี้จำเป็น

source: Please fix this field
th: กรุณาแก้ไขช่องนี้

source: Please enter a valid email address
th: กรุณากรอกอีเมลให้ถูกต้อง

source: Please enter a valid URL
th: กรุณากรอก URL ให้ถูกต้อง

source: Please enter a valid date
th: กรุณากรอกวันที่ให้ถูกต้อง

source: Please enter a valid date ( ISO )
th: กรุณากรอกวันที่ให้ถูกต้อง ( ISO )

source: Please enter a valid number
th: กรุณากรอกเลขให้ถูกต้อง

source: Please enter a valid credit card number
th: กรุณากรอกหมายเลขบัตรเครดิตให้ถูกต้อง

source: Please enter only digits
th: กรุณากรอกตัวเลขเท่านั้น

source: Please enter the same value again
th: กรุณากรอกค่าเดิมอีกครั้ง

source: Please enter no more than {0} characters
th: กรุณากรอกไม่เกิน {0} อักขระ

source: Please enter at least {0} characters
th: กรุณากรอกอย่างน้อย {0} อักขระ

source: Please enter a value between {0} and {1} characters long
th: กรุณากรอกค่าที่มีความยาวระหว่าง {0} ถึง {1} อักขระ

source: Please enter a value between {0} and {1}
th: กรุณากรอกค่าระหว่าง {0} ถึง {1}

source: Please enter a value less than or equal to {0}
th: กรุณากรอกค่าที่น้อยกว่าหรือเท่ากับ {0}

source: Please enter a value greater than or equal to {0}
th: กรุณากรอกค่าที่มากกว่าหรือเท่ากับ {0}

source: Please enter a valid date or time
th: กรุณากรอกวันที่และเวลาให้ถูกต้อง

source: Please enter a valid HEX input
th: กรุณากรอกเลขฐานสิบหกให้ถูกต้อง

source: This column can not contain a 32 chars value
th: คอลัมน์นี้ไม่สามารถมีค่าที่มีความยาวไม่เกิน 32 ตัวอักษรได้

source: These functions are meant to return a binary result; to avoid inconsistent results you should store it in a BINARY, VARBINARY, or BLOB column.
th: ฟังก์ชันเหล่านี้มีไว้เพื่อส่งคืนผลลัพธ์แบบไบนารี; เพื่อหลีกเลี่ยงผลลัพธ์ที่ไม่สอดคล้องกัน คุณควรจัดเก็บผลลัพธ์นั้นไว้ในคอลัมน์ประเภท BINARY, VARBINARY หรือ BLOB

source: The file being uploaded is probably larger than the maximum allowed size.
th: ไฟล์ที่กำลังอัปโหลดอาจมีขนาดใหญ่เกินกว่าขนาดสูงสุดที่อนุญาต

source: %s of %s
th: %s ของ %s

source: %s/sec.
th: %s/วินาที

source: About %MIN min. %SEC sec. remaining.
th: เหลือประมาณ %MIN นาที %SEC วินาที

source: About %SEC sec. remaining.
th: เหลือประมาณ %SEC วินาที

source: The file is being processed, please be patient.
th: กำลังประมวลผลไฟล์ โปรดรอสักครู่

source: Uploading your import file…
th: กำลังอัปโหลดไฟล์นำเข้าของคุณ…

source: Please be patient, the file is being uploaded. Details about the upload are not available.
th: โปรดรอสักครู่ ไฟล์กำลังถูกอัปโหลด รายละเอียดเกี่ยวกับการอัปโหลดยังไม่พร้อมใช้งาน

source: Fatal error: The navigation can only be accessed via AJAX
th: ข้อผิดพลาดร้ายแรง: การนำทางนี้สามารถเข้าถึงได้ผ่านทาง AJAX เท่านั้น

source: Select one…
th: เลือกหนึ่งข้อ…

source: No such column
th: ไม่มีคอลัมน์ดังกล่าว

# string types
source: String
th: สตริง

source: No collation provided.
th: ไม่มีการจัดเรียงข้อมูลให้

source: Cannot copy database to the same name. Change the name and try again.
th: ไม่สามารถคัดลอกฐานข้อมูลแล้วใช้ชื่อซ้ำกันได้ เปลี่ยนชื่อแล้วลองใหม่อีกครั้ง

source: Database %1$s has been renamed to %2$s.
th: ฐานข้อมูล %1$s ได้ถูกเปลี่ยนชื่อเป็น %2$s แล้ว

source: Database %1$s has been copied to %2$s.
th: ฐานข้อมูล %1$s ได้ถูกคัดลอกเป็น %2$s แล้ว

source: The phpMyAdmin configuration storage has been deactivated. %sFind out why%s.
th: ที่จัดเก็บการกำหนดค่า phpMyAdmin ถูกปิดใช้งานแล้ว %sค้นหาสาเหตุ%s

source: phpMyAdmin configuration snippet
th: snippet การกำหนดค่า phpMyAdmin

source: Paste it to your config.inc.php
th: วางโค้ดนี้ลงในไฟล์ config.inc.php ของคุณ

source: Could not import configuration
th: ไม่สามารถนำเข้าการกำหนดค่าได้

source: Two-factor authentication has been removed.
th: ระบบตรวจสอบสิทธิ์แบบสองขั้นตอนถูกยกเลิกแล้ว

source: Two-factor authentication has been configured.
th: การตรวจสอบสิทธิ์แบบสองขั้นตอนได้รับการกำหนดค่าเรียบร้อยแล้ว

source: Missing parameter:
th: พารามิเตอร์ที่หายไป:

source: Database %1$s has been created.
th: ฐานข้อมูล %1$s ถูกสร้างเรียบร้อยแล้ว

source: %1$d database has been dropped successfully.
th: %1$d ฐานข้อมูลถูกลบทิ้งเรียบร้อยแล้ว

source: The account %s@%s has been successfully locked.
th: บัญชี %s@%s ถูกล็อกเรียบร้อยแล้ว

source: The account %s@%s has been successfully unlocked.
th: บัญชี %s@%s ถูกปลดล็อกเรียบร้อยแล้ว

source: Username and hostname didn't change. If you only want to change the password, 'Change password' tab should be used.
th: ชื่อผู้ใช้และชื่อโฮสต์ไม่ได้เปลี่ยนแปลง หากคุณต้องการเปลี่ยนเฉพาะรหัสผ่าน ให้ใช้แท็บ 'เปลี่ยนรหัสผ่าน'

source: Thread %s was successfully killed.
th: รอบการทำงาน %s ถูกยุติเรียบร้อยแล้ว

source: phpMyAdmin was unable to kill thread %s. It probably has already been closed.
th: phpMyAdmin ไม่สามารถยุติรอบการทำงาน %s ได้ รอบการทำงานดังกล่าวน่าจะถูกปิดไปแล้ว

source: Received
th: ได้รับแล้ว

source: Sent
th: ส่งแล้ว

source: Max. concurrent connections
th: จำนวนการเชื่อมต่อพร้อมกันสูงสุด

source: Failed attempts
th: ความพยายามล้มเหลว

source: The number of connections that were aborted because the client died without closing the connection properly.
th: จำนวนการเชื่อมต่อที่ถูกยกเลิกเนื่องจากเครื่องลูกข่ายเลิกใช้งานโดยไม่ได้ปิดการเชื่อมต่ออย่างถูกต้อง

source: The number of failed attempts to connect to the MySQL server.
th: จำนวนครั้งที่พยายามเชื่อมต่อกับเซิร์ฟเวอร์ MySQL ไม่สำเร็จ

source: The number of transactions that used the temporary binary log cache but that exceeded the value of binlog_cache_size and used a temporary file to store statements from the transaction.
th: จำนวนธุรกรรมที่ใช้แคชบันทึกไบนารีชั่วคราว แต่เกินค่าของ binlog_cache_size และใช้ไฟล์ชั่วคราวในการจัดเก็บคำสั่งจากธุรกรรมนั้น

source: The number of transactions that used the temporary binary log cache.
th: จำนวนธุรกรรมที่ใช้แคชบันทึกไบนารีชั่วคราว

source: The number of connection attempts (successful or not) to the MySQL server.
th: จำนวนครั้งที่พยายามเชื่อมต่อ (ทั้งสำเร็จและไม่สำเร็จ) กับเซิร์ฟเวอร์ MySQL

source: The number of temporary tables on disk created automatically by the server while executing statements. If Created_tmp_disk_tables is big, you may want to increase the tmp_table_size value to cause temporary tables to be memory-based instead of disk-based.
th: จำนวนตารางชั่วคราวบนดิสก์ที่เซิร์ฟเวอร์สร้างขึ้นโดยอัตโนมัติขณะดำเนินการรันคำสั่ง หากค่า Created_tmp_disk_tables มีขนาดใหญ่ คุณอาจต้องการเพิ่มค่า tmp_table_size เพื่อให้ตารางชั่วคราวถูกจัดเก็บไว้ในหน่วยความจำแทนที่จะเป็นบนดิสก์

source: How many temporary files mysqld has created.
th: mysqld สร้างไฟล์ชั่วคราวขึ้นมาจำนวนเท่าใด

source: The number of in-memory temporary tables created automatically by the server while executing statements.
th: จำนวนตารางชั่วคราวในหน่วยความจำที่เซิร์ฟเวอร์สร้างขึ้นโดยอัตโนมัติขณะดำเนินการรันคำสั่ง

source: The number of rows written with INSERT DELAYED for which some error occurred (probably duplicate key).
th: จำนวนแถวที่เขียนด้วยคำสั่ง INSERT DELAYED ซึ่งเกิดข้อผิดพลาดบางอย่าง (อาจเป็นเพราะคีย์ซ้ำ)

source: The number of INSERT DELAYED handler threads in use. Every different table on which one uses INSERT DELAYED gets its own thread.
th: จำนวนรอบการทำงานที่ใช้จัดการคำสั่ง INSERT DELAYED แต่ละตารางที่ใช้คำสั่ง INSERT DELAYED จะได้รับรอบการทำงานของตัวเอง

source: The number of INSERT DELAYED rows written.
th: จำนวนแถวที่ INSERT DELAYED ถูกเขียน

source: The number of executed FLUSH statements.
th: จำนวนคำสั่ง FLUSH ที่ถูกดำเนินการ

source: The number of internal COMMIT statements.
th: จำนวนคำสั่ง COMMIT ภายใน

source: The number of times a row was deleted from a table.
th: จำนวนครั้งที่แถวถูกลบออกจากตาราง

source: The MySQL server can ask the NDB Cluster storage engine if it knows about a table with a given name. This is called discovery. Handler_discover indicates the number of time tables have been discovered.
th: เซิร์ฟเวอร์ MySQL สามารถสอบถามระบบจัดเก็บข้อมูล NDB Cluster ว่ารู้จักตารางที่มีชื่อที่ส่งให้หรือไม่ กระบวนการนี้เรียกว่าการค้นพบ ตัวแปร Handler_discover จะระบุจำนวนครั้งที่ค้นพบตารางแล้ว

source: The number of times the first entry was read from an index. If this is high, it suggests that the server is doing a lot of full index scans; for example, SELECT col1 FROM foo, assuming that col1 is indexed.
th: จำนวนครั้งที่อ่านรายการแรกจากดัชนี หากค่านี้สูง แสดงว่าเซิร์ฟเวอร์กำลังทำการสแกนดัชนีแบบเต็มรูปแบบบ่อยครั้ง; ตัวอย่างเช่น SELECT col1 FROM foo โดยสมมติว่า col1 มีดัชนีอยู่แล้ว

source: The number of requests to read a row based on a key. If this is high, it is a good indication that your queries and tables are properly indexed.
th: จำนวนคำขออ่านแถวโดยใช้คีย์เป็นฐาน หากจำนวนนี้สูง แสดงว่าคำสั่งและตารางของคุณได้รับการจัดทำดัชนีอย่างเหมาะสมแล้ว

source: The number of requests to read the next row in key order. This is incremented if you are querying an index column with a range constraint or if you are doing an index scan.
th: จำนวนคำขอในการอ่านแถวถัดไปตามลำดับคีย์ ค่านี้จะเพิ่มขึ้นหากคุณกำลังรันคำสั่งคอลัมน์ดัชนีที่มีข้อจำกัดช่วง หรือหากคุณกำลังทำการสแกนดัชนี

source: The number of requests to read the previous row in key order. This read method is mainly used to optimize ORDER BY … DESC.
th: จำนวนคำขออ่านแถวก่อนหน้าตามลำดับคีย์ วิธีการอ่านนี้ใช้เป็นหลักในการปรับปรุงประสิทธิภาพของ ORDER BY … DESC

source: The number of requests to read a row based on a fixed position. This is high if you are doing a lot of queries that require sorting of the result. You probably have a lot of queries that require MySQL to scan whole tables or you have joins that don't use keys properly.
th: จำนวนคำขออ่านแถวโดยอ้างอิงจากตำแหน่งคงที่ ค่านี้จะสูงหากคุณทำการรันคำสั่งจำนวนมากที่ต้องมีการเรียงลำดับผลลัพธ์ คุณอาจมีคำสั่งที่ต้องการให้ MySQL สแกนทั้งตาราง หรือมีการเชื่อมต่อตารางที่ไม่ใช้คีย์อย่างถูกต้อง

source: The number of requests to read the next row in the data file. This is high if you are doing a lot of table scans. Generally this suggests that your tables are not properly indexed or that your queries are not written to take advantage of the indexes you have.
th: จำนวนคำขอในการอ่านแถวถัดไปในไฟล์ข้อมูล ค่านี้จะสูงหากคุณทำการสแกนตารางบ่อยครั้ง โดยทั่วไปแล้ว นี่แสดงว่าตารางของคุณไม่ได้สร้างดัชนีอย่างถูกต้อง หรือคำสั่งของคุณไม่ได้เขียนขึ้นเพื่อใช้ประโยชน์จากดัชนีที่มีอยู่

source: The number of internal ROLLBACK statements.
th: จำนวนคำสั่ง ROLLBACK ภายใน

source: The number of requests to update a row in a table.
th: จำนวนคำขอในการอัปเดตแถวในตาราง

source: The number of requests to insert a row in a table.
th: จำนวนคำขอแทรกแถวลงในตาราง

source: The number of pages containing data (dirty or clean).
th: จำนวนหน้าที่มีข้อมูล (ทั้งข้อมูลดิบและจัดรูปแบบแล้ว)

source: The number of pages currently dirty.
th: จำนวนหน้าที่ยังไม่ได้จัดรูปแบบ

source: The number of buffer pool pages that have been requested to be flushed.
th: จำนวนหน้าของบัฟเฟอร์พูลที่ได้รับการร้องขอให้ล้างข้อมูล

source: The number of free pages.
th: จำนวนหน้าว่าง

source: The number of latched pages in InnoDB buffer pool. These are pages currently being read or written or that can't be flushed or removed for some other reason.
th: จำนวนหน้าข้อมูลที่ถูกล็อกไว้ในบัฟเฟอร์พูลของ InnoDB หน้าเหล่านี้คือหน้าข้อมูลที่กำลังถูกอ่านหรือเขียนอยู่ หรือหน้าข้อมูลที่ไม่สามารถล้างหรือลบออกได้ด้วยเหตุผลบางประการ

source: The number of pages busy because they have been allocated for administrative overhead such as row locks or the adaptive hash index. This value can also be calculated as Innodb_buffer_pool_pages_total - Innodb_buffer_pool_pages_free - Innodb_buffer_pool_pages_data.
th: จำนวนหน้าที่ไม่ว่างเนื่องจากถูกจัดสรรไว้เพื่องานสำหรับผู้บริหารระบบจัดการ เช่น การล็อกแถวหรือดัชนีแฮชแบบปรับได้ ค่านี้สามารถคำนวณได้จาก Innodb_buffer_pool_pages_total - Innodb_buffer_pool_pages_free - Innodb_buffer_pool_pages_data

source: Total size of buffer pool, in pages.
th: ขนาดรวมของบัฟเฟอร์พูล หน่วยเป็นเพจ

source: The number of "random" read-aheads InnoDB initiated. This happens when a query is to scan a large portion of a table but in random order.
th: จำนวนการอ่านล่วงหน้าแบบ "สุ่ม" ที่ InnoDB เริ่มต้นขึ้น เหตุการณ์นี้เกิดขึ้นเมื่อคำสั่งต้องการสแกนข้อมูลจำนวนมากในตาราง แต่ในลำดับแบบสุ่ม

source: The number of sequential read-aheads InnoDB initiated. This happens when InnoDB does a sequential full table scan.
th: จำนวนการอ่านล่วงหน้าแบบเรียงลำดับที่ InnoDB เริ่มต้นขึ้น เหตุการณ์นี้เกิดขึ้นเมื่อ InnoDB ทำการสแกนตารางเต็มรูปแบบแบบเรียงลำดับ

source: The number of logical read requests InnoDB has done.
th: จำนวนคำขออ่านเชิงตรรกะที่ InnoDB ได้ดำเนินการไป

source: The number of logical reads that InnoDB could not satisfy from buffer pool and had to do a single-page read.
th: จำนวนการอ่านเชิงตรรกะที่ InnoDB ไม่สามารถตอบสนองได้จากบัฟเฟอร์พูล และต้องทำการอ่านทีละหน้า

source: Normally, writes to the InnoDB buffer pool happen in the background. However, if it's necessary to read or create a page and no clean pages are available, it's necessary to wait for pages to be flushed first. This counter counts instances of these waits. If the buffer pool size was set properly, this value should be small.
th: โดยปกติ การเขียนข้อมูลลงในบัฟเฟอร์พูลของ InnoDB จะเกิดขึ้นในเบื้องหลัง อย่างไรก็ตาม หากจำเป็นต้องอ่านหรือสร้างหน้าข้อมูล และไม่มีหน้าข้อมูลที่ว่างเปล่าพร้อมใช้งาน จำเป็นต้องรอให้หน้าข้อมูลเหล่านั้นถูกล้างออกไปก่อน ตัวนับนี้จะนับจำนวนครั้งที่เกิดการรอ หากตั้งค่าขนาดบัฟเฟอร์พูลอย่างถูกต้องแล้ว ค่านี้ควรจะน้อย

source: The number writes done to the InnoDB buffer pool.
th: จำนวนการเขียนข้อมูลลงในบัฟเฟอร์พูลของ InnoDB

source: The number of fsync() operations so far.
th: จำนวนการดำเนินการ fsync() ที่ผ่านมา

source: The current number of pending fsync() operations.
th: จำนวนการดำเนินการ fsync() ที่รอดำเนินการในปัจจุบัน

source: The current number of pending reads.
th: จำนวนการอ่านที่รอดำเนินการในปัจจุบัน

source: The current number of pending writes.
th: จำนวนการเขียนข้อมูลที่รอดำเนินการในปัจจุบัน

source: The amount of data read so far, in bytes.
th: ปริมาณข้อมูลที่อ่านได้จนถึงขณะนี้ มีหน่วยเป็นไบต์

source: The total number of data reads.
th: จำนวนการอ่านข้อมูลทั้งหมด

source: The total number of data writes.
th: จำนวนการเขียนข้อมูลทั้งหมด

source: The amount of data written so far, in bytes.
th: ปริมาณข้อมูลที่ถูกเขียนจนถึงขณะนี้ มีหน่วยเป็นไบต์

source: The number of pages that have been written for doublewrite operations.
th: จำนวนหน้าที่เขียนไปแล้วสำหรับการดำเนินการเขียนซ้ำสองครั้ง

source: The number of doublewrite operations that have been performed.
th: จำนวนการดำเนินการเขียนซ้ำสองรอบที่ได้ดำเนินการไปแล้ว

source: The number of waits we had because log buffer was too small and we had to wait for it to be flushed before continuing.
th: จำนวนครั้งที่ต้องรอเกิดจากบัฟเฟอร์บันทึกข้อมูลมีขนาดเล็กเกินไป และเราต้องรอให้บัฟเฟอร์ถูกล้างก่อนจึงจะดำเนินการต่อได้

source: The number of log write requests.
th: จำนวนคำขอเขียนบันทึกข้อมูล

source: The number of physical writes to the log file.
th: จำนวนการเขียนข้อมูลจริงลงในไฟล์บันทึก

source: The number of fsync() writes done to the log file.
th: จำนวนการเขียนข้อมูลด้วยฟังก์ชัน fsync() ไปยังไฟล์บันทึก

source: The number of pending log file fsyncs.
th: จำนวนไฟล์บันทึก fsyncs ที่ค้างอยู่

source: Pending log file writes.
th: รอการเขียนไฟล์บันทึกข้อมูลอยู่

source: The number of bytes written to the log file.
th: จำนวนไบต์ที่เขียนลงในไฟล์บันทึก

source: The number of pages created.
th: จำนวนหน้าที่สร้างขึ้น

source: The compiled-in InnoDB page size (default 16KB). Many values are counted in pages; the page size allows them to be easily converted to bytes.
th: ขนาดหน้าของ InnoDB ที่คอมไพล์ไว้ (ค่าเริ่มต้น 16KB) ค่าหลายค่าถูกนับเป็นหน้า; ขนาดหน้าช่วยให้สามารถแปลงค่าเหล่านั้นเป็นไบต์ได้อย่างง่ายดาย

source: The number of pages read.
th: จำนวนหน้าที่อ่าน

source: The number of pages written.
th: จำนวนหน้าที่เขียน

source: The number of row locks currently being waited for.
th: จำนวนแถวที่ถูกล็อกที่กำลังรออยู่ในขณะนี้

source: The average time to acquire a row lock, in milliseconds.
th: เวลาเฉลี่ยในการล็อกแถว หน่วยเป็นมิลลิวินาที

source: The total time spent in acquiring row locks, in milliseconds.
th: เวลาทั้งหมดที่ใช้ในการล็อกแถว หน่วยเป็นมิลลิวินาที

source: The maximum time to acquire a row lock, in milliseconds.
th: เวลาสูงสุดในการล็อกแถว หน่วยเป็นมิลลิวินาที

source: The number of times a row lock had to be waited for.
th: จำนวนครั้งที่ต้องรอการล็อกแถว

source: The number of rows deleted from InnoDB tables.
th: จำนวนแถวที่ถูกลบออกจากตาราง InnoDB

source: The number of rows inserted in InnoDB tables.
th: จำนวนแถวที่ถูกแทรกในตาราง InnoDB

source: The number of rows read from InnoDB tables.
th: จำนวนแถวที่อ่านจากตาราง InnoDB

source: The number of rows updated in InnoDB tables.
th: จำนวนแถวที่ได้รับการอัปเดตในตาราง InnoDB

source: The number of key blocks in the key cache that have changed but haven't yet been flushed to disk. It used to be known as Not_flushed_key_blocks.
th: จำนวนบล็อกคีย์ในแคชคีย์ที่เปลี่ยนแปลงไปแต่ยังไม่ได้ถูกบันทึกลงดิสก์ เดิมเรียกว่า Not_flushed_key_blocks

source: The number of unused blocks in the key cache. You can use this value to determine how much of the key cache is in use.
th: จำนวนบล็อกที่ไม่ได้ใช้งานในแคชคีย์ คุณสามารถใช้ค่านี้เพื่อตรวจสอบว่าแคชคีย์ถูกใช้งานไปเท่าใด

source: The number of used blocks in the key cache. This value is a high-water mark that indicates the maximum number of blocks that have ever been in use at one time.
th: จำนวนบล็อกที่ใช้งานในแคชคีย์ ค่านี้เป็นค่าสูงสุดที่บ่งบอกถึงจำนวนบล็อกสูงสุดที่เคยถูกใช้งานพร้อมกันในเวลาใดเวลาหนึ่ง

source: Percentage of used key cache (calculated value)
th: เปอร์เซ็นต์ของแคชคีย์ที่ใช้ไป (ค่าที่คำนวณได้)

source: The number of requests to read a key block from the cache.
th: จำนวนคำขอในการอ่านบล็อกคีย์จากแคช

source: The number of physical reads of a key block from disk. If Key_reads is big, then your key_buffer_size value is probably too small. The cache miss rate can be calculated as Key_reads/Key_read_requests.
th: จำนวนการอ่านข้อมูลคีย์บล๊อกหลักจากดิสก์ หากค่า Key_reads มีขนาดใหญ่ แสดงว่าค่า key_buffer_size อาจเล็กเกินไป อัตราการพลาดแคชสามารถคำนวณได้จาก Key_reads / Key_read_requests

source: Key cache miss calculated as rate of physical reads compared to read requests (calculated value)
th: แคชพลาดคีย์ คำนวณจากอัตราส่วนของการอ่านทางกายภาพเทียบกับคำขออ่าน (ค่าที่คำนวณได้)

source: The number of requests to write a key block to the cache.
th: จำนวนคำขอในการเขียนบล็อกคีย์ลงในแคช

source: The number of physical writes of a key block to disk.
th: จำนวนครั้งของการเขียนข้อมูลบล็อกคีย์ลงดิสก์

source: Percentage of physical writes compared to write requests (calculated value)
th: เปอร์เซ็นต์ของการเขียนข้อมูลจริงเมื่อเทียบกับคำขอเขียนข้อมูล (ค่าที่คำนวณได้)

source: The total cost of the last compiled query as computed by the query optimizer. Useful for comparing the cost of different query plans for the same query. The default value of 0 means that no query has been compiled yet.
th: ทรัพยากรที่ใช้โดยรวมของคำสั่งที่คอมไพล์ล่าสุด ซึ่งคำนวณโดยตัวเพิ่มประสิทธิภาพคำสั่ง มีประโยชน์สำหรับการเปรียบเทียบการใช้ทรัพยากรของแผนคำสั่งต่าง ๆ สำหรับคำสั่งเดียวกัน ค่าเริ่มต้นคือ 0 หมายความว่ายังไม่มีการคอมไพล์คำสั่งใด ๆ

source: The maximum number of connections that have been in use simultaneously since the server started.
th: จำนวนการเชื่อมต่อสูงสุดที่ใช้งานพร้อมกันนับตั้งแต่เซิร์ฟเวอร์เริ่มทำงาน

source: The number of rows waiting to be written in INSERT DELAYED queues.
th: จำนวนแถวที่รอการเขียนในคิว INSERT DELAYED

source: The number of tables that have been opened. If opened tables is big, your table_open_cache value is probably too small.
th: จำนวนตารางที่เปิดใช้งาน หากมีจำนวนมาก ค่า table_open_cache ของคุณอาจน้อยเกินไป

source: The number of files that are open.
th: จำนวนไฟล์ที่เปิดอยู่
