Repository: phpmyadmin/phpmyadmin
Catalog: resources/po/*.po
Languages: th

source: Increasing {max_heap_table_size} and {tmp_table_size} might help. However some temporary tables are always being written to disk, independent of the value of these variables. To eliminate these you will have to rewrite your queries to avoid those conditions (Within a temporary table: Presence of a BLOB or TEXT column or presence of a column bigger than 512 bytes) as mentioned in the <a href="https://dev.mysql.com/doc/refman/8.0/en/internal-temporary-tables.html">MySQL Documentation</a>
th: การเพิ่มค่า {max_heap_table_size} และ {tmp_table_size} อาจช่วยได้ อย่างไรก็ตาม ตารางชั่วคราวบางตารางจะถูกเขียนลงดิสก์เสมอ โดยไม่ขึ้นอยู่กับค่าของตัวแปรเหล่านี้ หากต้องการกำจัดตารางชั่วคราวเหล่านี้ คุณจะต้องเขียนคำสั่งใหม่เพื่อหลีกเลี่ยงเงื่อนไขเหล่านั้น (ภายในตารางชั่วคราว: การมีคอลัมน์ BLOB หรือ TEXT หรือการมีคอลัมน์ที่มีขนาดใหญ่กว่า 512 ไบต์) ตามที่ระบุไว้ใน <a href="https://dev.mysql.com/doc/refman/8.0/en/internal-temporary-tables.html">เอกสารประกอบ MySQL</a>

source: Rate of temporary tables being written to disk: %s, this value should be less than 1 per hour
th: อัตราการเขียนตารางชั่วคราวลงดิสก์: %s ค่านี้ควรน้อยกว่า 1 ครั้งต่อชั่วโมง

source: MyISAM key buffer size
th: ขนาดบัฟเฟอร์คีย์ MyISAM

source: Key buffer is not initialized. No MyISAM indexes will be cached.
th: บัฟเฟอร์คีย์ยังไม่ได้เริ่มต้นใช้งาน จะไม่มีการแคชดัชนี MyISAM

source: Set {key_buffer_size} depending on the size of your MyISAM indexes. 64M is a good start.
th: ตั้งค่า {key_buffer_size} ตามขนาดของดัชนี MyISAM ของคุณ ขนาด 64M เป็นค่าเริ่มต้นที่ดี

source: key_buffer_size is 0
th: key_buffer_size คือ 0

source: MyISAM key buffer (index cache) % used is low.
th: บัฟเฟอร์คีย์ MyISAM (แคชดัชนี) % ที่ใช้อยู่ในระดับต่ำ

source: You may need to decrease the size of {key_buffer_size}, re-examine your tables to see if indexes have been removed, or examine queries and expectations about what indexes are being used.
th: คุณอาจจำเป็นต้องลดขนาดของ {key_buffer_size} ตรวจสอบตารางของคุณอีกครั้งเพื่อดูว่าดัชนีถูกลบไป หรือตรวจสอบคำสั่งและความคาดหวังเกี่ยวกับดัชนีที่กำลังใช้งานอยู่

source: max %% MyISAM key buffer ever used: %s%%, this value should be above 95%%
th: บัฟเฟอร์คีย์ MyISAM %% สูงสุดที่เคยใช้: %s%% ค่านี้ควรสูงกว่า 95%%

source: Percentage of MyISAM key buffer used
th: เปอร์เซ็นต์ของบัฟเฟอร์คีย์ MyISAM ที่ใช้ไป

source: %% MyISAM key buffer used: %s%%, this value should be above 95%%
th: %% บัฟเฟอร์คีย์ MyISAM ที่ใช้: %s%% ค่านี้ควรสูงกว่า 95%%

source: Percentage of index reads from memory
th: เปอร์เซ็นต์ของการอ่านดัชนีจากหน่วยความจำ

source: The % of indexes that use the MyISAM key buffer is low.
th: % ของดัชนีที่ใช้บัฟเฟอร์คีย์ MyISAM นั้นต่ำ

source: You may need to increase {key_buffer_size}.
th: คุณอาจต้องเพิ่ม {key_buffer_size}

source: Index reads from memory: %s%%, this value should be above 95%%
th: ค่าดัชนีที่อ่านจากหน่วยความจำ: %s%%, ค่านี้ควรสูงกว่า 95%%

source: Rate of table open
th: อัตราตารางที่เปิด

source: The rate of opening tables is high.
th: อัตราการเปิดตารางสูง

source: Opening tables requires disk I/O which is costly. Increasing {table_open_cache} might avoid this.
th: การเปิดตารางต้องใช้การอ่านเขียนข้อมูลจากดิสก์ ซึ่งใช้ทรัพยากรสูง การเพิ่มค่า {table_open_cache} อาจช่วยหลีกเลี่ยงปัญหานี้ได้

source: Opened table rate: %s, this value should be less than 10 per hour
th: อัตราตารางที่เปิด: %s ค่านี้ควรน้อยกว่า 10 ต่อชั่วโมง

source: Percentage of used open files limit
th: เปอร์เซ็นต์ของขีดจำกัดไฟล์ที่เปิดใช้

source: The number of open files is approaching the max number of open files. You may get a "Too many open files" error.
th: จำนวนไฟล์ที่เปิดอยู่ใกล้ถึงจำนวนสูงสุดแล้ว คุณอาจได้รับข้อความแสดงข้อผิดพลาด "มีไฟล์เปิดอยู่มากเกินไป"

source: Consider increasing {open_files_limit}, and check the error log when restarting after changing {open_files_limit}.
th: ลองพิจารณาเพิ่มค่า {open_files_limit} แล้วตรวจสอบบันทึกข้อผิดพลาดเมื่อรีสตาร์ทหลังจากเปลี่ยนค่า {open_files_limit} แล้ว

source: The number of opened files is at %s%% of the limit. It should be below 85%%
th: มีจำนวนไฟล์ที่เปิดอยู่ถึง %s%% ของขีดจำกัดแล้ว ควรต่ำกว่า 85%%

source: Rate of open files
th: อัตราการเปิดไฟล์

source: The rate of opening files is high.
th: อัตราการเปิดไฟล์นั้นสูง

source: Opened files rate: %s, this value should be less than 5 per hour
th: อัตราการเปิดไฟล์: %s ค่านี้ควรน้อยกว่า 5 ต่อชั่วโมง

source: Immediate table locks %
th: ล็อกตารางทันที %

source: Too many table locks were not granted immediately.
th: ตารางถูกล็อกไว้มากมายไม่ได้รับการอนุมัติทันที

source: Optimize queries and/or use InnoDB to reduce lock wait.
th: ปรับปรุงประสิทธิภาพคำสั่งและ/หรือใช้ InnoDB เพื่อลดระยะเวลารอการล็อก

source: Immediate table locks: %s%%, this value should be above 95%%
th: การล็อกตารางทันที: %s%% ค่านี้ควรสูงกว่า 95%%

source: Table lock wait rate
th: อัตราการรอตารางล็อก

source: Table lock wait rate: %s, this value should be less than 1 per hour
th: อัตราการรอตารางล็อก: %s ค่านี้ควรน้อยกว่า 1 ครั้งต่อชั่วโมง

source: Thread cache
th: แคชรอบการทำงาน

source: Thread cache is disabled, resulting in more overhead from new connections to MySQL.
th: แคชรอบการทำงานถูกปิดใช้งาน ส่งผลให้เกิดภาระงานเพิ่มขึ้นจากการเชื่อมต่อใหม่ไปยัง MySQL

source: Enable the thread cache by setting {thread_cache_size} > 0.
th: เปิดใช้งานแคชรอบการทำงานโดยตั้งค่า {thread_cache_size} > 0

source: The thread cache is set to 0
th: แคชรอบการทำงานถูกตั้งค่าเป็น 0

source: Thread cache hit rate %
th: อัตราการเข้าถึงแคชของรอบการทำงาน (%)

source: Thread cache is not efficient.
th: แคชรอบการทำงานไม่มีประสิทธิภาพ

source: Increase {thread_cache_size}.
th: เพิ่มค่า {thread_cache_size}

source: Thread cache hitrate: %s%%, this value should be above 80%%
th: อัตราการถึงแคชรอบการทำงาน: %s%% ค่านี้ควรสูงกว่า 80%%

source: Threads that are slow to launch
th: รอบการทำงานที่เริ่มต้นช้า

source: There are too many threads that are slow to launch.
th: มีรอบการทำงานจำนวนมากที่เริ่มต้นทำงานช้าเกินไป

source: This generally happens in case of general system overload as it is pretty simple operations. You might want to monitor your system load carefully.
th: โดยทั่วไปแล้วเหตุการณ์นี้มักเกิดขึ้นในกรณีที่ระบบทำงานหนักเกินไป เนื่องจากเป็นการทำงานที่ค่อนข้างง่าย คุณอาจต้องมอนิเตอร์ภาระการทำงานของระบบอย่างระมัดระวัง

source: %s thread(s) took longer than %s seconds to start, it should be 0
th: %s รอบการทำงานใช้เวลานานกว่า %s วินาทีในการเริ่มต้น ซึ่งควรจะเป็น 0

source: Slow launch time
th: เวลาเปิดตัวช้า

source: Slow_launch_time is above 2s.
th: Slow_launch_time สูงกว่า 2 วินาที

source: Set {slow_launch_time} to 1s or 2s to correctly count threads that are slow to launch.
th: ตั้งค่า {slow_launch_time} เป็น 1 หรือ 2 วินาที เพื่อนับจำนวนรอบการทำงานที่เริ่มต้นทำงานช้าอย่างถูกต้อง

source: slow_launch_time is set to %s
th: slow_launch_time ถูกตั้งค่าเป็น %s

source: Percentage of used connections
th: เปอร์เซ็นต์ของการเชื่อมต่อที่ใช้แล้ว

source: The maximum amount of used connections is getting close to the value of {max_connections}.
th: จำนวนการเชื่อมต่อที่ใช้สูงสุดกำลังเข้าใกล้ค่า {max_connections} แล้ว

source: Increase {max_connections}, or decrease {wait_timeout} so that connections that do not close database handlers properly get killed sooner. Make sure the code closes database handlers properly.
th: เพิ่มค่า {max_connections} หรือลดค่า {wait_timeout} เพื่อให้การเชื่อมต่อที่ไม่ปิดตัวจัดการฐานข้อมูลอย่างถูกต้องถูกยุติเร็วขึ้น ตรวจสอบให้แน่ใจว่าโค้ดปิดตัวจัดการฐานข้อมูลอย่างถูกต้อง

source: Max_used_connections is at %s%% of max_connections, it should be below 80%%
th: Max_used_connections อยู่ที่ %s%% ของ max_connections ซึ่งควรจะต่ำกว่า 80%%

source: Percentage of aborted connections
th: เปอร์เซ็นต์ของการเชื่อมต่อที่ถูกยกเลิก

source: Too many connections are aborted.
th: มีการยกเลิกการเชื่อมต่อมากเกินไป

source: Connections are usually aborted when they cannot be authorized. <a href="https://www.percona.com/blog/2008/08/23/how-to-track-down-the-source-of-aborted_connects/">This article</a> might help you track down the source.
th: การเชื่อมต่อมักถูกยกเลิกเมื่อไม่สามารถให้สิทธิ์ได้ <a href="https://www.percona.com/blog/2008/08/23/how-to-track-down-the-source-of-aborted_connects/">บทความนี้</a> อาจช่วยคุณค้นหาต้นตอของปัญหาได้

source: %s%% of all connections are aborted. This value should be below 1%%
th: %s%% ของการเชื่อมต่อทั้งหมดถูกยกเลิก ค่านี้ควรต่ำกว่า 1%%

source: Rate of aborted connections
th: อัตราการเชื่อมต่อที่ถูกยกเลิก

source: Aborted connections rate is at %s, this value should be less than 1 per hour
th: อัตราการเชื่อมต่อถูกยกเลิกอยู่ที่ %s ซึ่งค่านี้ควรน้อยกว่า 1 ครั้งต่อชั่วโมง

source: Percentage of aborted clients
th: เปอร์เซ็นต์ของเครื่องลูกข่ายที่ยกเลิก

source: Too many clients are aborted.
th: เครื่องลูกข่ายจำนวนมากถูกยกเลิก

source: Clients are usually aborted when they did not close their connection to MySQL properly. This can be due to network issues or code not closing a database handler properly. Check your network and code.
th: โดยปกติแล้ว การทำงานของเครื่องลูกข่ายจะถูกยกเลิกเมื่อไม่ได้ปิดการเชื่อมต่อกับ MySQL อย่างถูกต้อง ซึ่งอาจเกิดจากปัญหาเครือข่ายหรือโค้ดไม่ได้ปิดตัวจัดการฐานข้อมูลอย่างถูกต้อง ตรวจสอบเครือข่ายและโค้ดของคุณ

source: %s%% of all clients are aborted. This value should be below 2%%
th: %s%% ของเครื่องลูกข่ายทั้งหมดถูกยกเลิก ค่านี้ควรต่ำกว่า 2%%

source: Rate of aborted clients
th: อัตราเครื่องลูกข่ายที่ถูกยกเลิก

source: Aborted client rate is at %s, this value should be less than 1 per hour
th: อัตราเครื่องลูกข่ายที่ถูกยกเลิกอยู่ที่ %s ซึ่งค่านี้ควรน้อยกว่า 1 ต่อชั่วโมง

source: Is InnoDB disabled?
th: InnoDB ถูกปิดใช้งานอยู่หรือไม่?

source: You do not have InnoDB enabled.
th: คุณไม่ได้เปิดใช้งาน InnoDB

source: InnoDB is usually the better choice for table engines.
th: โดยทั่วไปแล้ว InnoDB เป็นตัวเลือกที่ดีกว่าสำหรับระบบจัดการตารางข้อมูล

source: have_innodb is set to 'value'
th: have_innodb ถูกตั้งค่าเป็น 'value'

source: InnoDB log size
th: ขนาดบันทึกของ InnoDB

source: The InnoDB log file size is not an appropriate size, in relation to the InnoDB buffer pool.
th: ขนาดไฟล์บันทึกของ InnoDB มีขนาดไม่เหมาะสม ที่มีความสัมพันธ์กับบัฟเฟอร์พูลของ InnoDB

source: Especially on a system with a lot of writes to InnoDB tables you should set {innodb_log_file_size} to 25% of {innodb_buffer_pool_size}. However the bigger this value, the longer the recovery time will be when database crashes, so this value should not be set much higher than 256 MiB. Please note however that you cannot simply change the value of this variable. You need to shutdown the server, remove the InnoDB log files, set the new value in my.cnf, start the server, then check the error logs if everything went fine. See also <a href="https://mysqldatabaseadministration.blogspot.com/2007/01/increase-innodblogfilesize-proper-way.html">this blog entry</a>
th: โดยเฉพาะอย่างยิ่งในระบบที่มีการเขียนข้อมูลลงตาราง InnoDB จำนวนมาก คุณควรตั้งค่า {innodb_log_file_size} เป็น 25% ของ {innodb_buffer_pool_size} อย่างไรก็ตาม ยิ่งค่านี้สูงเท่าไร เวลาในการกู้คืนเมื่อฐานข้อมูลล่มก็จะยิ่งนานขึ้นเท่านั้น ดังนั้นค่านี้ไม่ควรตั้งไว้สูงกว่า 256 MiB มากนัก โปรดทราบว่าคุณไม่สามารถเปลี่ยนค่าของตัวแปรนี้ได้โดยตรง คุณต้องปิดเซิร์ฟเวอร์ ลบไฟล์บันทึก InnoDB ตั้งค่าใหม่ใน my.cnf เริ่มเซิร์ฟเวอร์ จากนั้นตรวจสอบบันทึกข้อผิดพลาดว่าทุกอย่างเรียบร้อยดีหรือไม่ ดูเพิ่มเติมที่ <a href="https://mysqldatabaseadministration.blogspot.com/2007/01/increase-innodblogfilesize-proper-way.html">บทความในบล็อกนี้</a>

source: Your InnoDB log size is at %s%% in relation to the InnoDB buffer pool size, it should not be below 20%%
th: ขนาดบันทึกของ InnoDB เป็น %s%% สัมพันธ์กับบัฟเฟอร์พูลของ InnoDB ซึ่งไม่ควรจะต่ำกว่า 20%%

source: Max InnoDB log size
th: ขนาดบันทึกสูงสุดของ InnoDB

source: The InnoDB log file size is inadequately large.
th: ขนาดไฟล์บันทึกของ InnoDB นั้นใหญ่ไม่พอ

source: It is usually sufficient to set {innodb_log_file_size} to 25% of the size of {innodb_buffer_pool_size}. A very big {innodb_log_file_size} slows down the recovery time after a database crash considerably. See also <a href="https://www.percona.com/blog/2006/07/03/choosing-proper-innodb_log_file_size/">this Article</a>. You need to shutdown the server, remove the InnoDB log files, set the new value in my.cnf, start the server, then check the error logs if everything went fine. See also <a href="https://mysqldatabaseadministration.blogspot.com/2007/01/increase-innodblogfilesize-proper-way.html">this blog entry</a>
th: โดยปกติแล้ว การตั้งค่า {innodb_log_file_size} ให้มีขนาด 25% ของขนาด {innodb_buffer_pool_size} ก็เพียงพอแล้ว การตั้งค่า {innodb_log_file_size} ให้มีขนาดใหญ่เกินไปจะทำให้เวลาในการกู้คืนหลังจากฐานข้อมูลล่มช้าลงอย่างมาก ดูเพิ่มเติมได้ที่ <a href="https://www.percona.com/blog/2006/07/03/choosing-proper-innodb_log_file_size/">บทความนี้</a> คุณต้องปิดเซิร์ฟเวอร์ ลบไฟล์บันทึก InnoDB ตั้งค่าใหม่ใน my.cnf เริ่มเซิร์ฟเวอร์ จากนั้นตรวจสอบบันทึกข้อผิดพลาดว่าทุกอย่างเรียบร้อยดีหรือไม่ ดูเพิ่มเติมได้ที่ <a href="https://mysqldatabaseadministration.blogspot.com/2007/01/increase-innodblogfilesize-proper-way.html">บทความในบล็อกนี้</a>

source: Your absolute InnoDB log size is %s MiB
th: ขนาดไฟล์บันทึก InnoDB ของคุณคือ %s MiB

source: InnoDB buffer pool size
th: ขนาดบัฟเฟอร์พูลของ InnoDB

source: Your InnoDB buffer pool is fairly small.
th: บัฟเฟอร์พูล InnoDB ของคุณมีขนาดค่อนข้างเล็ก

source: The InnoDB buffer pool has a profound impact on performance for InnoDB tables. Assign all your remaining memory to this buffer. For database servers that use solely InnoDB as storage engine and have no other services (e.g. a web server) running, you may set this as high as 80% of your available memory. If that is not the case, you need to carefully assess the memory consumption of your other services and non-InnoDB-Tables and set this variable accordingly. If it is set too high, your system will start swapping, which decreases performance significantly. See also <a href="https://www.percona.com/blog/2007/11/03/choosing-innodb_buffer_pool_size/">this article</a>
th: บัฟเฟอร์พูลของ InnoDB มีผลกระทบอย่างมากต่อประสิทธิภาพของตาราง InnoDB ควรจัดสรรหน่วยความจำที่เหลือทั้งหมดให้กับบัฟเฟอร์นี้ สำหรับเซิร์ฟเวอร์ฐานข้อมูลที่ใช้ InnoDB เป็นกลไกจัดเก็บข้อมูลเพียงอย่างเดียวและไม่มีบริการอื่น ๆ (เช่น เว็บเซิร์ฟเวอร์) ทำงานอยู่ คุณอาจตั้งค่านี้ได้สูงถึง 80% ของหน่วยความจำที่มีอยู่ แต่ถ้าไม่ใช่กรณีนั้น คุณต้องประเมินการใช้หน่วยความจำของบริการอื่น ๆ และตารางที่ไม่ใช่ InnoDB อย่างรอบคอบ และตั้งค่าตัวแปรนี้ให้เหมาะสม หากตั้งค่าสูงเกินไป ระบบของคุณจะเริ่มทำการสวอป ซึ่งจะลดประสิทธิภาพลงอย่างมาก ดูเพิ่มเติมได้ที่ <a href="https://www.percona.com/blog/2007/11/03/choosing-innodb_buffer_pool_size/">บทความนี้</a>

source: You are currently using %s%% of your memory for the InnoDB buffer pool. This rule fires if you are assigning less than 60%%, however this might be perfectly adequate for your system if you don't have much InnoDB tables or other services running on the same machine.
th: คุณกำลังใช้หน่วยความจำ %s%% สำหรับบัฟเฟอร์พูลของ InnoDB กฎนี้จะทำงานหากคุณจัดสรรหน่วยความจำน้อยกว่า 60%% อย่างไรก็ตาม นี่อาจดีมากพอสำหรับระบบของคุณ หากไม่ได้มีตาราง InnoDB หรือบริการอื่น ๆ ทำงานอยู่บนเครื่องเดียวกันมากนัก

source: MyISAM concurrent inserts
th: การแทรกข้อมูลพร้อมกันของ MyISAM

source: Enable {concurrent_insert} by setting it to 1
th: เปิดใช้งาน {concurrent_insert} โดยตั้งค่าเป็น 1

source: Setting {concurrent_insert} to 1 reduces contention between readers and writers for a given table. See also <a href="https://dev.mysql.com/doc/refman/5.5/en/concurrent-inserts.html">MySQL Documentation</a>
th: การตั้งค่า {concurrent_insert} เป็น 1 จะช่วยลดการใช้งานระหว่างตัวอ่านและตัวเขียนสำหรับตารางที่กำหนด ดูเพิ่มเติม<a href="https://dev.mysql.com/doc/refman/5.5/en/concurrent-inserts.html">เอกสาร MySQL</a>

source: concurrent_insert is set to 0
th: concurrent_insert ถูกตั้งค่าเป็น 0

source: Query cache disabled
th: แคชคำสั่งถูกปิดใช้งาน

source: The query cache is not enabled.
th: แคชคำสั่งไม่ได้เปิดใช้งาน

source: The query cache is known to greatly improve performance if configured correctly. Enable it by setting {query_cache_size} to a 2 digit MiB value and setting {query_cache_type} to 'ON'. <b>Note:</b> If you are using memcached, ignore this recommendation.
th: แคชคำสั่งเป็นที่ทราบกันดีว่าช่วยปรับปรุงประสิทธิภาพได้อย่างมากหากกำหนดค่าอย่างถูกต้อง เปิดใช้งานโดยการตั้งค่า {query_cache_size} เป็นค่า MiB สองหลัก และตั้งค่า {query_cache_type} เป็น 'ON' <b>หมายเหตุ:</b> หากคุณใช้ memcached โปรดละเว้นคำแนะนำนี้

source: query_cache_size is set to 0 or query_cache_type is set to 'OFF'
th: หากตั้งค่า query_cache_size เป็น 0 หรือตั้งค่า query_cache_type เป็น 'OFF'

source: Query cache efficiency (%)
th: ประสิทธิภาพแคชของคำสั่ง (%)

source: Query cache not running efficiently, it has a low hit rate.
th: แคชคำสั่งทำงานได้ไม่เต็มประสิทธิภาพ มีอัตราการถึงต่ำ

source: Consider increasing {query_cache_limit}.
th: ลองพิจารณาเพิ่มค่า {query_cache_limit}

source: The current query cache hit rate of %s%% is below 20%%
th: อัตราการถึงแคชคำสั่งปัจจุบันของ %s%% ต่ำกว่า 20%%

source: Query Cache usage
th: การใช้งานแคชคำสั่ง

source: Less than 80% of the query cache is being utilized.
th: มีการใช้งานแคชการค้นหาน้อยกว่า 80%

source: This might be caused by {query_cache_limit} being too low. Flushing the query cache might help as well.
th: ปัญหานี้อาจเกิดจากค่า {query_cache_limit} ต่ำเกินไป การล้างแคชคำสั่งอาจช่วยได้เช่นกัน

source: The current ratio of free query cache memory to total query cache size is %s%%. It should be above 80%%
th: อัตราส่วนปัจจุบันของหน่วยความจำแคชคำสั่งที่ว่างอยู่ต่อขนาดแคชคำสั่งทั้งหมดคือ %s%% ซึ่งควรจะสูงกว่า 80%%

source: Query cache fragmentation
th: การกระจัดกระจายของแคชคำสั่ง

source: The query cache is considerably fragmented.
th: แคชคำสั่งกระจัดกระจายเป็นอย่างมาก

source: Severe fragmentation is likely to (further) increase Qcache_lowmem_prunes. This might be caused by many Query cache low memory prunes due to {query_cache_size} being too small. For a immediate but short lived fix you can flush the query cache (might lock the query cache for a long time). Carefully adjusting {query_cache_min_res_unit} to a lower value might help too, e.g. you can set it to the average size of your queries in the cache using this formula: (query_cache_size - qcache_free_memory) / qcache_queries_in_cache
th: การกระจัดกระจายอย่างรุนแรงอาจทำให้ Qcache_lowmem_prunes เพิ่มขึ้น (อีก) ซึ่งอาจเกิดจากการตัดหน่วยความจำต่ำของแคชคำสั่งจำนวนมากเนื่องจาก {query_cache_size} มีขนาดเล็กเกินไป สำหรับการแก้ไขปัญหาเร่งด่วนในระยะสั้น คุณสามารถล้างแคชคำสั่ง (อาจทำให้แคชคำสั่งถูกล็อกเป็นเวลานาน) การปรับ {query_cache_min_res_unit} ให้มีค่าต่ำลงอย่างระมัดระวังก็อาจช่วยได้เช่นกัน เช่น คุณสามารถตั้งค่าให้เป็นขนาดเฉลี่ยของคำสั่งในแคชโดยใช้สูตรนี้: (query_cache_size - qcache_free_memory) / qcache_queries_in_cache

source: The cache is currently fragmented by %s%% , with 100%% fragmentation meaning that the query cache is an alternating pattern of free and used blocks. This value should be below 20%%.
th: ขณะนี้แคชกระจัดกระจายเป็น %s%% โดยการกระจัดกระจาย 100%% หมายความว่าแคชคำสั่งมีรูปแบบสลับกันระหว่างบล็อกว่างและบล็อกที่ใช้งานอยู่ ค่านี้ควรต่ำกว่า 20%%

source: Query cache low memory prunes
th: การลบแคชคำสั่งที่มีหน่วยความจำเหลือน้อย

source: Cached queries are removed due to low query cache memory from the query cache.
th: คำสั่งที่ถูกแคชไว้จะถูกลบออกเนื่องจากหน่วยความจำแคชคำสั่งเหลือน้อย

source: You might want to increase {query_cache_size}, however keep in mind that the overhead of maintaining the cache is likely to increase with its size, so do this in small increments and monitor the results.
th: คุณอาจต้องการเพิ่มขนาด {query_cache_size} แต่โปรดจำไว้ว่าทรัพยากรที่ใช้ในการบำรุงรักษาแคชมีแนวโน้มที่จะเพิ่มขึ้นตามขนาดของแคช ดังนั้นควรเพิ่มทีละน้อยและตรวจสอบผลลัพธ์สม่ำเสมอ

source: The ratio of removed queries to inserted queries is %s%%. The lower this value is, the better (This rules firing limit: 0.1%%)
th: อัตราส่วนของคำสั่งที่ถูกลบต่อคำสั่งที่ถูกแทรกคือ %s%% ค่านี้ยิ่งต่ำยิ่งดี (ขีดจำกัดการทำงานของกฎนี้คือ 0.1%%)

source: Query cache max size
th: ขนาดสูงสุดของแคชคำสั่ง

source: The query cache size is above 128 MiB. Big query caches may cause significant overhead that is required to maintain the cache.
th: ขนาดของแคชคำสั่งมีขนาดใหญ่กว่า 128 MiB แคชคำสั่งขนาดใหญ่อาจทำให้เกิดภาระงานเพิ่มเติมจำนวนมากที่จำเป็นในการบำรุงรักษาแคช

source: Depending on your environment, it might be performance increasing to reduce this value.
th: ขึ้นอยู่กับสภาพแวดล้อมของคุณ การลดค่านี้อาจช่วยเพิ่มประสิทธิภาพได้

source: Current query cache size: %s
th: ขนาดแคชคำสั่งปัจจุบัน: %s

source: Query cache min result size
th: ขนาดผลลัพธ์ขั้นต่ำของแคชคำสั่ง

source: The max size of the result set in the query cache is the default of 1 MiB.
th: ขนาดสูงสุดของชุดผลลัพธ์ในแคชคำสั่งคือค่าเริ่มต้นที่ 1 MiB

source: Changing {query_cache_limit} (usually by increasing) may increase efficiency. This variable determines the maximum size a query result may have to be inserted into the query cache. If there are many query results above 1 MiB that are well cacheable (many reads, little writes) then increasing {query_cache_limit} will increase efficiency. Whereas in the case of many query results being above 1 MiB that are not very well cacheable (often invalidated due to table updates) increasing {query_cache_limit} might reduce efficiency.
th: การเปลี่ยนค่า {query_cache_limit} (โดยปกติคือการเพิ่มค่า) อาจช่วยเพิ่มประสิทธิภาพได้ ตัวแปรนี้กำหนดขนาดสูงสุดที่ผลลัพธ์ของคำสั่งจะต้องถูกแทรกเข้าไปในแคชคำสั่ง หากมีผลลัพธ์ของคำสั่งจำนวนมากที่มีขนาดเกิน 1 MiB และสามารถแคชได้ดี (มีการอ่านมาก การเขียนน้อย) การเพิ่มค่า {query_cache_limit} จะช่วยเพิ่มประสิทธิภาพ ในขณะที่ในกรณีที่ผลลัพธ์ของคำสั่งจำนวนมากมีขนาดเกิน 1 MiB และไม่สามารถแคชได้ดีนัก (มักถูกทำให้ไม่ถูกต้องเนื่องจากการอัปเดตตาราง) การเพิ่มค่า {query_cache_limit} อาจลดประสิทธิภาพลง

source: query_cache_limit is set to 1 MiB
th: query_cache_limit ถูกตั้งไว้ที่ 1 MiB

source: Search:
th: ค้นหา:

source: Unknown
th: ไม่ระบุ

# Collation
source: German (phone book order)
th: เยอรมัน (เรียงตามหนังสือหมายเลขโทรศัพท์)

# Collation
source: German (dictionary order)
th: เยอรมัน (เรียงตามพจนานุกรม)

# Collation
source: Spanish (traditional)
th: สเปน (ดั้งเดิม)

# Collation
source: Spanish (modern)
th: สเปน (ใหม่)

# Collation variant
source: case-insensitive
th: ไม่สนใจตัวพิมพ์เล็กใหญ่

# Collation variant
source: case-sensitive
th: สนใจตัวพิมพ์เล็กใหญ่

# Collation variant
source: accent-insensitive
th: ไม่สนใจสำเนียง

# Collation variant
source: accent-sensitive
th: สนใจสำเนียง

# Collation variant
source: kana-sensitive
th: สนใจระบบตัวอักษรภาษาญี่ปุ่น

# Collation variant
source: multi-level
th: หลายระดับ

# Collation variant
source: binary
th: ไบนารี

# Collation variant
source: no-pad
th: ไม่ต้องเติม

# Collation
source: Binary
th: ไบนารี

# Collation
source: Unicode
th: ยูนิโค้ด

# Collation
source: West European
th: ยุโรปตะวันตก

# Collation
source: Central European
th: ยุโรปกลาง

# Collation
source: Russian
th: รัสเซีย

# Collation
source: Simplified Chinese
th: จีน (ตัวย่อ)

# Collation
source: Traditional Chinese
th: จีน (ตัวเต็ม)

# Collation
source: Chinese
th: จีน

# Collation
source: Japanese
th: ญี่ปุ่น

# Collation
source: Baltic
th: บอลติก

# Collation
source: Armenian
th: อาร์เมเนีย

# Collation
source: Cyrillic
th: ซีริลลิก

# Collation
source: Arabic
th: อาหรับ

# Collation
source: Korean
th: เกาหลี

# Collation
source: Hebrew
th: ฮิบรู

# Collation
source: Georgian
th: จอร์เจีย

# Collation
source: Greek
th: กรีก

# Collation
source: Czech-Slovak
th: เช็ก-สโลวัก

# Collation
source: Ukrainian
th: ยูเครน

# Collation
source: Turkish
th: ตุรกี

# Collation
source: Swedish
th: สวีเดน

# Collation
source: Thai
th: ไทย

# Collation
source: Unknown
th: ไม่ระบุ

# Collation
source: Bulgarian
th: บัลเกเรีย

# Collation
source: Croatian
th: โครเอเชีย

# Collation
source: Czech
th: เช็ก

# Collation
source: Danish
th: เดนมาร์ก

# Collation
source: English
th: อังกฤษ

# Collation
source: Esperanto
th: เอสเปรันโต
