Repository: phpmyadmin/phpmyadmin
Catalog: resources/po/*.po
Languages: th

source: Add privileges on the following table:
th: เพิ่มสิทธิ์การเข้าถึงตารางต่อไปนี้:

source: Add privileges on the following routine:
th: เพิ่มสิทธิ์การเข้าถึงให้กับรูทีนต่อไปนี้:

source: Allows reading data.
th: อนุญาตให้อ่านข้อมูลได้

source: Or
th: หรือ

# None privileges
source: None
th: ไม่มี

source: Allows inserting and replacing data.
th: อนุญาตให้แทรกและแทนที่ข้อมูลได้

source: Allows changing data.
th: อนุญาตให้เปลี่ยนข้อมูลได้

source: Has no effect in this MySQL version.
th: ไม่มีผลกับ MySQL เวอร์ชันนี้

source: Allows deleting data.
th: อนุญาตให้ลบข้อมูลได้

source: Allows creating new tables.
th: อนุญาตให้สร้างตารางใหม่ได้

source: Allows dropping tables.
th: อนุญาตให้ลบตารางได้

source: Allows user to give to other users or remove from other users the privileges that user possess yourself.
th: อนุญาตให้ผู้ใช้สามารถมอบสิทธิพิเศษให้แก่ผู้ใช้รายอื่น หรือลบสิทธิพิเศษที่ผู้ใช้เองมีอยู่จากผู้ใช้รายอื่นได้

source: Allows creating and dropping indexes.
th: อนุญาตให้สร้าง และทิ้งดัชนีได้

source: Allows altering the structure of existing tables.
th: อนุญาตให้แก้ไขโครงสร้างของตารางที่มีอยู่ได้

source: Allows creating new views.
th: อนุญาตให้สร้างมุมมองใหม่ได้

source: Allows performing SHOW CREATE VIEW queries.
th: อนุญาตให้ดำเนินการค้นหาข้อมูลด้วยคำสั่ง SHOW CREATE VIEW

source: Allows creating and dropping triggers.
th: อนุญาตให้สร้างและลบทริกเกอร์ได้

source: Allows deleting historical rows.
th: อนุญาตให้ลบแถวข้อมูลเก่าได้

source: Global
th: ทั้งระบบ

source: Global privileges
th: สิทธิพิเศษเพื่อทั้งระบบ

source: Database-specific privileges
th: สิทธิพิเศษเฉพาะฐานข้อมูล

source: Allows importing data from and exporting data into files.
th: อนุญาตให้นำเข้าข้อมูล และส่งออกข้อมูลไปที่ไฟล์ได้

source: Allows creating new databases and tables.
th: อนุญาตให้สร้างฐานข้อมูล และตารางใหม่ได้

source: Allows dropping databases and tables.
th: อนุญาตให้ทิ้งฐานข้อมูล และตารางได้

source: Allows creating temporary tables.
th: อนุญาตให้สร้างตารางชั่วคราวได้

source: Allows creating stored routines.
th: อนุญาตให้สร้างรูทีนที่บันทึกไว้ได้

source: Allows altering and dropping stored routines.
th: อนุญาตให้แก้ไขและลบรูทีนที่บันทึกไว้ได้

source: Allows executing stored routines.
th: อนุญาตให้เรียกใช้รูทีนที่จัดเก็บไว้

source: Allows to set up events for the event scheduler.
th: อนุญาตให้ตั้งค่ากิจกรรมสำหรับตัวกำหนดตารางกิจกรรมได้

source: Administration
th: การดูแลระบบ

source: Allows adding users and privileges without reloading the privilege tables.
th: อนุญาตให้เพิ่มผู้ใช้และสิทธิพิเศษได้โดยไม่ต้องโหลดตารางสิทธิพิเศษใหม่

source: Allows connecting, even if maximum number of connections is reached; required for most administrative operations like setting global variables or killing threads of other users.
th: อนุญาตให้เชื่อมต่อได้ แม้ว่าจะถึงจำนวนการเชื่อมต่อสูงสุดแล้วก็ตาม; ซึ่งจำเป็นสำหรับการดำเนินการด้านการดูแลระบบส่วนใหญ่ เช่น การตั้งค่าตัวแปรเพื่อทั้งระบบ หรือการยุติรอบการทำงานของผู้ใช้รายอื่น

source: Allows viewing processes of all users.
th: อนุญาตให้ดูขั้นตอนการทำงานของผู้ใช้ทั้งหมดได้

source: Allows reloading server settings and flushing the server's caches.
th: อนุญาตให้เรียกใช้ค่ากำหนดของเซิร์ฟเวอร์ใหม่ และล้างแคชของเซิร์ฟเวอร์ได้

source: Allows shutting down the server.
th: อนุญาตให้ปิดเซิร์ฟเวอร์ได้

source: Gives access to the complete list of databases.
th: ให้สิทธิ์เข้าถึงรายการฐานข้อมูลทั้งหมด

source: Allows locking tables for the current thread.
th: อนุญาตให้ล็อกตารางสำหรับรอบการทำงานปัจจุบันได้

source: Not used on MariaDB.
th: ไม่ได้ใช้กับ MariaDB

source: Needed for the replication replicas.
th: จำเป็นสำหรับการสร้างการจำลอง

source: Allows creating, dropping and renaming user accounts.
th: อนุญาตให้สร้าง ลบ และแก้ไขชื่อบัญชีผู้ใช้ได้

source: Resource limits
th: ขีดจำกัดของทรัพยากร

source: Note: Setting these options to 0 (zero) removes the limit.
th: โปรดทราบ: ตั้งค่าเหล่านี้เป็น 0 (ศูนย์) เพื่อยกเลิกขีดจำกัด

source: Limits the number of queries the user may send to the server per hour.
th: จำกัดจำนวนคำสั่งที่ผู้ใช้จะสามารถส่งมาที่เซิร์ฟเวอร์ได้ต่อชั่วโมง

source: Limits the number of commands that change any table or database the user may execute per hour.
th: จำกัดจำนวนคำสั่งที่เปลี่ยนแปลงตารางหรือฐานข้อมูลใด ๆ ที่ผู้ใช้สามารถดำเนินการได้ต่อชั่วโมง

source: Limits the number of new connections the user may open per hour.
th: จำกัดจำนวนการเชื่อมต่อใหม่ที่ผู้ใช้สามารถเปิดได้ต่อชั่วโมง

source: Limits the number of simultaneous connections the user may have.
th: จำกัดจำนวนการเชื่อมต่อพร้อมกันที่ผู้ใช้สามารถมีได้

source: Does not require SSL-encrypted connections.
th: ไม่จำเป็นต้องใช้การเชื่อมต่อที่เข้ารหัสด้วย SSL

source: Requires SSL-encrypted connections.
th: จำเป็นต้องใช้การเชื่อมต่อที่เข้ารหัสด้วย SSL

source: Requires a valid X509 certificate.
th: ต้องใช้ใบรับรอง X509 ที่ถูกต้อง

source: Requires that a specific cipher method be used for a connection.
th: จำเป็นต้องใช้วิธีการเข้ารหัสเฉพาะเพื่อใช้ในการเชื่อมต่อ

source: Requires that a valid X509 certificate issued by this CA be presented.
th: จำเป็นต้องแสดงใบรับรอง X509 ที่ถูกต้องซึ่งออกโดย CA นี้

source: Requires that a valid X509 certificate with this subject be presented.
th: จำเป็นต้องแสดงใบรับรอง X509 ที่ถูกต้องซึ่งมีเนื้อหาเกี่ยวกับหัวข้อนี้

source: User accounts overview
th: ภาพรวมบัญชีผู้ใช้

source: User groups
th: กลุ่มผู้ใช้

source: The selected user was not found in the privilege table.
th: ไม่พบผู้ใช้ที่เลือกไว้ในตารางสิทธิ์

source: Change login information / Copy user account
th: เปลี่ยนข้อมูลการเข้าสู่ระบบ / คัดลอกบัญชีผู้ใช้

source: Create a new user account with the same privileges and …
th: สร้างบัญชีผู้ใช้ใหม่ที่มีสิทธิ์การใช้งานเหมือนกันทุกประการ และ…

source: … keep the old one.
th: … เก็บของเก่าไว้.

source: … delete the old one from the user tables.
th: … ลบของเก่าทิ้งไปจากตารางผู้ใช้.

source: … revoke all active privileges from the old one and delete it afterwards.
th: …เพิกถอนสิทธิ์การใช้งานทั้งหมดจากบัญชีเก่า แล้วลบบัญชีนั้นทิ้งไป

source: … delete the old one from the user tables and reload the privileges afterwards.
th: ...ลบข้อมูลเก่าออกจากตารางผู้ใช้ แล้วโหลดสิทธิ์การใช้งานใหม่หลังจากนั้น

source: User group
th: กลุ่มผู้ใช้

# Unlock the account.
source: Unlock
th: ปลดล็อก

# Lock the account.
source: Lock
th: ล็อก

source: Remove selected user accounts
th: ลบบัญชีผู้ใช้ที่เลือก

source: Revoke all active privileges from the users and delete them afterwards.
th: เพิกถอนสิทธิ์การใช้งานทั้งหมดของผู้ใช้ และลบสิทธิ์เหล่านั้นทิ้งในภายหลัง

source: Drop the databases that have the same names as the users.
th: ลบฐานข้อมูลที่มีชื่อซ้ำกับชื่อผู้ใช้

source: Make sure you have a unique server-id in your configuration file (my.cnf). If not, please add the following line into [mysqld] section:
th: โปรดตรวจสอบให้แน่ใจว่าคุณมี server-id ที่ไม่ซ้ำกันในไฟล์การกำหนดค่าของคุณ (my.cnf) หากไม่มี โปรดเพิ่มบรรทัดต่อไปนี้ลงในส่วน [mysqld]:

source: Host:
th: โฮสต์:

source: Port:
th: พอร์ต:

source: This server is not configured as primary in a replication process. Would you like to %sconfigure%s it?
th: เซิร์ฟเวอร์นี้ไม่ได้กำหนดค่าให้เป็นหลักในกระบวนการการจำลองแบบ คุณต้องการที่จะ %sกำหนดค่า%s หรือไม่?

source: Use text field:
th: ใช้ช่องข้อความ:

source: Host
th: โฮสต์

source: Generate password:
th: สร้างรหัสผ่าน:

source: Generate
th: สร้าง

source: This server is not configured as a primary server in a replication process. You can choose from either replicating all databases and ignoring some of them (useful if you want to replicate a majority of the databases) or you can choose to ignore all databases by default and allow only certain databases to be replicated. Please select the mode:
th: เซิร์ฟเวอร์นี้ไม่ได้ถูกกำหนดค่าให้เป็นเซิร์ฟเวอร์หลักในกระบวนการจำลองข้อมูล คุณสามารถเลือกได้ว่าจะจำลองฐานข้อมูลทั้งหมดหรือละเว้นบางส่วน (มีประโยชน์หากคุณต้องการจำลองฐานข้อมูลส่วนใหญ่) หรือคุณสามารถเลือกที่จะละเว้นฐานข้อมูลทั้งหมดโดยค่าเริ่มต้นและอนุญาตให้จำลองเฉพาะฐานข้อมูลบางส่วนเท่านั้น โปรดเลือกโหมด:

source: Replicate all databases; Ignore:
th: คัดลอกฐานข้อมูลทั้งหมด; ละเว้น:

source: Ignore all databases; Replicate:
th: ละเว้นฐานข้อมูลทั้งหมด; ทำซ้ำ:

source: Please select databases:
th: กรุณาเลือกฐานข้อมูล:

source: Now, add the following lines at the end of [mysqld] section in your my.cnf and please restart the MySQL server afterwards.
th: ตอนนี้ ให้เพิ่มบรรทัดต่อไปนี้ที่ส่วนท้ายของ [mysqld] ในไฟล์ my.cnf ของคุณ แล้วโปรดรีสตาร์ทเซิร์ฟเวอร์ MySQL หลังจากนั้น

source: Once you restarted MySQL server, please click on Go button. Afterwards, you should see a message informing you, that this server <strong>is</strong> configured as primary.
th: หลังจากรีสตาร์ทเซิร์ฟเวอร์ MySQL แล้ว โปรดคลิกปุ่ม Go จากนั้น คุณจะเห็นข้อความแจ้งให้ทราบว่าเซิร์ฟเวอร์นี้ <strong>ได้รับ</strong> การกำหนดค่าให้เป็นเซิร์ฟเวอร์หลัก

source: Show connected replicas
th: แสดงแบบจำลองที่เชื่อมต่อ

source: Only replicas started with the --report-host=host_name option are visible in this list.
th: เฉพาะแบบจำลองที่เริ่มต้นด้วยตัวเลือก --report-host=host_name เท่านั้นที่จะปรากฏในรายการนี้

source: Replica SQL Thread not running!
th: รอบการทำงาน SQL จำลองไม่ทำงาน!

source: Replica IO Thread not running!
th: รอบการทำงานแบบจำลอง IO ไม่ทำงาน!

source: Start SQL Thread only
th: เริ่มรอบการทำงาน SQL เท่านั้น

source: Stop SQL Thread only
th: หยุดรอบการทำงาน SQL เท่านั้น

source: Start IO Thread only
th: เริ่มรอบการทำาน IO เท่านั้น

source: Stop IO Thread only
th: หยุดรอบการทำงาน IO เท่านั้น

source: Error management:
th: การจัดการที่ผิดพลาด:

source: Skipping errors might lead into unsynchronized primary and replica!
th: การข้ามข้อผิดพลาดอาจส่งผลให้เซิร์ฟเวอร์หลักและเซิร์ฟเวอร์สำรองไม่ซิงก์กัน!

source: Skip current error
th: ข้ามข้อผิดพลาดปัจจุบัน

source: Skip next %s errors.
th: ข้ามข้อผิดพลาด %s ถัดไป

source: This server is not configured as replica in a replication process. Would you like to %sconfigure%s it?
th: เซิร์ฟเวอร์นี้ไม่ได้กำหนดค่าให้เป็นสเลฟในกระบวนการการจำลองแบบ คุณต้องการที่จะ %sกำหนดค่า%s หรือไม่?

source: Variable
th: ตัวแปร

source: Current server:
th: เซิร์ฟเวอร์ปัจจุบัน:

source: Servers
th: เซิร์ฟเวอร์

source: Advisor system
th: ระบบที่ปรึกษา

source: Not enough privilege to view the advisor.
th: ไม่มีสิทธิ์เพียงพอในการดูตัวแนะนำ

source: Instructions
th: คำแนะนำ

source: The Advisor system can provide recommendations on server variables by analyzing the server status variables.
th: ระบบ Advisor สามารถให้คำแนะนำเกี่ยวกับตัวแปรของเซิร์ฟเวอร์ได้โดยการวิเคราะห์ตัวแปรสถานะของเซิร์ฟเวอร์

source: Do note however that this system provides recommendations based on simple calculations and by rule of thumb which may not necessarily apply to your system.
th: อย่างไรก็ตาม โปรดทราบว่าระบบนี้ให้คำแนะนำโดยอิงจากการคำนวณอย่างง่ายและหลักการทั่วไป ซึ่งอาจไม่จำเป็นต้องใช้ได้กับระบบของคุณเสมอไป

source: Prior to changing any of the configuration, be sure to know what you are changing (by reading the documentation) and how to undo the change. Wrong tuning can have a very negative effect on performance.
th: ก่อนที่จะเปลี่ยนแปลงการกำหนดค่าใด ๆ โปรดตรวจสอบให้แน่ใจว่าคุณเข้าใจสิ่งที่คุณกำลังเปลี่ยนแปลง (โดยการอ่านเอกสารประกอบ) และวิธีการยกเลิกการเปลี่ยนแปลง การปรับตั้งค่าที่ไม่ถูกต้องอาจส่งผลเสียอย่างมากต่อประสิทธิภาพการทำงาน

source: The best way to tune your system would be to change only one setting at a time, observe or benchmark your database, and undo the change if there was no clearly measurable improvement.
th: วิธีที่ดีที่สุดในการปรับตั้งระบบของคุณคือการเปลี่ยนการตั้งค่าทีละอย่าง สังเกตหรือทดสอบประสิทธิภาพของฐานข้อมูล และยกเลิกการเปลี่ยนแปลงหากไม่มีการปรับปรุงที่วัดผลได้ชัดเจน

source: Possible performance issues
th: ปัญหาด้านประสิทธิภาพที่อาจเกิดขึ้น

source: Server
th: เซิร์ฟเวอร์

source: Processes
th: กระบวนการ

source: Query statistics
th: สถิติของคำสั่ง

source: All status variables
th: สถานะตัวแปรทั้งหมด

source: Monitor
th: ตรวจสอบ

source: Advisor
th: ที่ปรึกษา

source: Instructions/Setup
th: คำแนะนำ/การตั้งค่า

source: Add chart
th: เพิ่มแผนภูมิ

source: Enable charts dragging
th: เปิดใช้งานการลากแผนภูมิ

source: Done dragging (rearranging) charts
th: เสร็จสิ้นการลาก (จัดเรียงใหม่) แผนภูมิแล้ว

source: Refresh rate
th: อัตราการรีเฟรช

source: %d second
th: %d วินาที

source: %d minute
th: %d นาที

source: Chart columns
th: คอลัมน์แผนภูมิ

source: Chart arrangement
th: การจัดเรียงแผนภูมิ

source: The arrangement of the charts is stored to the browsers local storage. You may want to export it if you have a complicated set up.
th: การจัดเรียงแผนภูมิจะถูกบันทึกไว้ในพื้นที่จัดเก็บข้อมูลภายในเครื่องของเบราว์เซอร์ คุณอาจต้องการส่งออกข้อมูลหากการตั้งค่าของคุณค่อนข้างซับซ้อน

source: Please select the file you want to import:
th: กรุณาเลือกไฟล์ที่คุณต้องการนำเข้า

source: Reset to default
th: รีเซ็ตเป็นค่าเริ่มต้น

source: The phpMyAdmin Monitor can assist you in optimizing the server configuration and track down time intensive queries. For the latter you will need to set log_output to 'TABLE' and have either the slow_query_log or general_log enabled. Note however, that the general_log produces a lot of data and increases server load by up to 15%.
th: phpMyAdmin Monitor สามารถช่วยคุณในการปรับแต่งการกำหนดค่าเซิร์ฟเวอร์และติดตามการเรียกใช้คำสั่งที่ใช้เวลานาน หลังจากนั้นคุณจะต้องตั้งค่า log_output เป็น 'TABLE' และเปิดใช้งาน slow_query_log หรือ general_log อย่างไรก็ตาม โปรดทราบว่า general_log สร้างข้อมูลจำนวนมากและเพิ่มภาระให้กับเซิร์ฟเวอร์ได้มากถึง 15%

source: Using the monitor:
th: การใช้งาน monitor:

source: Your browser will refresh all displayed charts in a regular interval. You may add charts and change the refresh rate under 'Settings', or remove any chart using the cog icon on each respective chart.
th: เบราว์เซอร์ของคุณจะรีเฟรชแผนภูมิที่แสดงทั้งหมดเป็นระยะ คุณสามารถเพิ่มแผนภูมิและเปลี่ยนอัตราการรีเฟรชได้ใน 'การตั้งค่า' หรือลบแผนภูมิใด ๆ โดยใช้ไอคอนรูปเฟืองที่อยู่บนแผนภูมิแต่ละรายการ

source: To display queries from the logs, click on any chart. Once confirmed, this will load a table of grouped queries, there you may click on any occurring SELECT statements to further analyze them.
th: หากต้องการแสดงคำสั่งจากบันทึก ให้คลิกที่แผนภูมิใดก็ได้ เมื่อยืนยันแล้ว ระบบจะโหลดตารางคำสั่งที่จัดกลุ่มไว้ คุณสามารถคลิกที่คำสั่ง SELECT ที่ปรากฏอยู่ในตารางนั้นเพื่อวิเคราะห์เพิ่มเติมได้

source: Please note:
th: โปรดทราบ:

source: Enabling the general_log may increase the server load by 5-15%. Also be aware that generating statistics from the logs is a load intensive task, so it is advisable to select only a small time span and to disable the general_log and empty its table once monitoring is not required any more.
th: การเปิดใช้งาน general_log อาจทำให้ภาระงานของเซิร์ฟเวอร์เพิ่มขึ้น 5-15% นอกจากนี้ โปรดทราบว่าการสร้างสถิติจากบันทึกเป็นงานที่ใช้ทรัพยากรมาก ดังนั้นจึงควรเลือกช่วงเวลาสั้น ๆ และปิดใช้งาน general_log และล้างตารางเมื่อไม่ต้องการตรวจสอบอีกต่อไป

source: Chart Title
th: ชื่อแผนภูมิ

source: Preset chart
th: แผนภูมิที่ตั้งค่าไว้ล่วงหน้า

source: Status variable(s)
th: สถานะของตัวแปร

source: Select series:
th: เลือกรูปแบบ:

source: Commonly monitored
th: มีการมอนิเตอร์โดยทั่วไป

source: or type variable name:
th: หรือพิมพ์ชื่อตัวแปร:

source: Display as differential value
th: แสดงผลเป็นค่าส่วนต่าง

source: Apply a divisor
th: ใช้ตัวหาร

source: KiB
th: กิโลไบต์

source: MiB
th: เมกกะไบต์

source: Append unit to data values
th: เพิ่มหน่วยให้กับค่าข้อมูล

source: Add this series
th: เพิ่มซีรีส์นี้

source: Clear series
th: ล้างซีรีส์

source: Series in chart:
th: ซีรีส์ในแผนภูมิ:

source: Add chart to grid
th: เพิ่มแผนภูมิลงในตาราง

source: Log statistics
th: สถิติในบันทึก

source: Selected time range:
th: ช่วงเวลาที่เลือก:

source: Only retrieve SELECT,INSERT,UPDATE and DELETE Statements
th: ดึงข้อมูลเฉพาะคำสั่ง SELECT, INSERT, UPDATE และ DELETE เท่านั้น

source: Remove variable data in INSERT statements for better grouping
th: ลบข้อมูลตัวแปรในคำสั่ง INSERT เพื่อการจัดกลุ่มที่ดีขึ้น

source: Choose from which log you want the statistics to be generated from.
th: เลือกบันทึกที่คุณต้องการใช้ในการสร้างสถิติ

source: Results are grouped by query text.
th: ผลลัพธ์ถูกจัดกลุ่มตามข้อความคำสั่ง

source: From slow log
th: จากบันทึกการทดสอบความหน่วงช้า

source: From general log
th: จากบันทึกทั่วไป

source: Query analyzer
th: ตัววิเคราะห์คำสั่ง

source: Query
th: คำสั่งเรียกดู

source: Analyse query
th: วิเคราะห์คำสั่งเรียกดู

source: Analysing logs
th: บันทึกการวิเคราะห์

source: Cancel request
th: ยกเลิกคำร้อง

source: No data found
th: ไม่พบข้อมูล

source: Log analysed, but no data found in this time span.
th: ได้ทำการวิเคราะห์บันทึกแล้ว แต่ไม่พบข้อมูลในช่วงเวลาดังกล่าว

source: Loading logs
th: กำลังโหลดบันทึก

source: Log data loaded. Queries executed in this time span:
th: โหลดข้อมูลบันทึกแล้ว คำสั่ง SQL ที่ดำเนินการในช่วงเวลานี้:

source: Monitor refresh failed
th: การรีเฟรชการมอนิเตอร์ล้มเหลว

source: While requesting new chart data the server returned an invalid response. This is most likely because your session expired. Reloading the page and reentering your credentials should help.
th: ขณะที่กำลังร้องขอข้อมูลแผนภูมิใหม่ เซิร์ฟเวอร์มีการตอบกลับที่ไม่ถูกต้อง ซึ่งโดยมากแล้วอาจเป็นเพราะเซสชันของคุณหมดอายุแล้ว การโหลดหน้าเว็บใหม่และป้อนข้อมูลประจำตัวของคุณอีกครั้งน่าจะช่วยได้

source: Reload page
th: โหลดหน้าเว็บใหม่

source: Local monitor configuration incompatible!
th: การตั้งค่าจอภาพในเครื่องไม่เข้ากัน!

source: Show only active
th: แสดงเฉพาะที่ใช้งานอยู่

source: Note: Enabling the auto refresh here might cause heavy traffic between the web server and the MySQL server.
th: หมายเหตุ: การเปิดใช้งานการรีเฟรชอัตโนมัติในที่นี้อาจทำให้เกิดปริมาณการรับส่งข้อมูลจำนวนมากระหว่างเว็บเซิร์ฟเวอร์และเซิร์ฟเวอร์ MySQL

source: Start auto refresh
th: เริ่มการรีเฟรชอัตโนมัติ

source: Kill
th: กำจัด

source: Not enough privilege to view query statistics.
th: ไม่มีสิทธิ์เพียงพอในการดูสถิติคำสั่ง

source: ø per hour: %s
th: ø ต่อชั่วโมง: %s

source: ø per minute: %s
th: ø ต่อนาที: %s

source: ø per second: %s
th: ø ต่อวินาที: %s

source: Statements
th: คำสั่ง

source: Pie chart with the most frequent statements.
th: แผนภูมิวงกลมแสดงข้อความที่ปรากฏบ่อยที่สุด

source: Network traffic since startup: %s
th: การจราจรเครือข่ายตั้งแต่เริ่มต้นระบบ: %s

source: This MySQL server has been running for %1$s. It started up on %2$s.
th: เซิร์ฟเวอร์ MySQL นี้ทำงานมาเป็นเวลา %1$s แล้ว เริ่มตอน %2$s

source: Traffic
th: การจราจร

source: On a busy server, the byte counters may overrun, so those statistics as reported by the MySQL server may be incorrect.
th: ในเซิร์ฟเวอร์ที่มีการใช้งานหนัก ตัวนับไบต์อาจทำงานเกินขีดจำกัด ดังนั้น สถิติที่รายงานโดยเซิร์ฟเวอร์ MySQL อาจไม่ถูกต้อง

source: Connections
th: การเชื่อมต่อ

source: This MySQL server works as <b>primary</b> and <b>replica</b> in <b>replication</b> process.
th: เซิร์ฟเวอร์ MySQL นี้ทำหน้าที่เป็นทั้ง <b>เซิร์ฟเวอร์หลัก</b> และ <b>เซิร์ฟเวอร์จำลอง</b> ในกระบวนการ <b>การจำลองข้อมูล</b>

source: This MySQL server works as <b>primary</b> in <b>replication</b> process.
th: เซิร์ฟเวอร์ MySQL นี้ทำหน้าที่เป็น <b>เซิร์ฟเวอร์หลัก</b> ในกระบวนการ <b>การจำลองแบบ</b>

source: This MySQL server works as <b>replica</b> in <b>replication</b> process.
th: เซิร์ฟเวอร์ MySQL นี้ทำหน้าที่เป็น <b>เซิร์ฟเวอร์จำลอง</b> ในกระบวนการ <b>การจำลองแบบ</b>

source: Replication status
th: สถานะการจำลองข้อมูล

source: Not enough privilege to view server status.
th: ไม่มีสิทธิ์เพียงพอในการดูสถานะเซิร์ฟเวอร์

source: Show only alert values
th: แสดงเฉพาะค่าการแจ้งเตือน

source: Filter by category…
th: กรองตามหมวดหมู่…

source: Show unformatted values
th: แสดงค่าที่ไม่ได้จัดรูปแบบ

source: Related links:
th: ลิงก์ที่เกี่ยวข้อง:

source: Not enough privilege to view status variables.
th: ไม่มีสิทธิ์เพียงพอในการดูสถานะตัวแปร

source: Add user group
th: เพิ่มกลุ่มผู้ใช้

source: Edit user group: '%s'
th: แก้ไขกลุ่มผู้ใช้: '%s'

source: User group menu assignments
th: การกำหนดเมนูกลุ่มผู้ใช้

source: Group name:
th: ชื่อกลุ่ม:

source: Server level tabs
th: แท็บระดับเซิร์ฟเวอร์

source: Database level tabs
th: แท็บระดับฐานข้อมูล

source: Table level tabs
th: แท็บระดับตาราง

source: Users of '%s' user group
th: ผู้ใช้กลุ่มผู้ใช้ '%s'

source: No users were found belonging to this user group.
th: ไม่พบผู้ใช้รายใดที่อยู่ในกลุ่มผู้ใช้นี้

source: User
th: ผู้ใช้

source: Server variables and settings
th: ตัวแปรของเซิร์ฟเวอร์และการตั้งค่า

source: This is a read-only variable and can not be edited
th: ตัวแปรนี้เป็นแบบอ่านอย่างเดียวและไม่สามารถแก้ไขได้

source: Session value
th: ค่าเซสชั่น

source: Not enough privilege to view server variables and settings. %s
th: ไม่มีสิทธิ์เพียงพอที่จะดูตัวแปรและการตั้งค่าเซิร์ฟเวอร์ %s

source: Overview
th: ภาพรวม

source: Configuration file
th: ไฟล์กำหนดค่า

source: Download
th: ดาวน์โหลด

source: Submitted form contains errors
th: แบบฟอร์มที่ส่งมามีข้อผิดพลาด

source: Try to revert erroneous fields to their default values
th: ลองกลับค่าในช่องข้อมูลที่ไม่ถูกต้องไปเป็นค่าเริ่มต้น

source: Ignore errors
th: เพิกเฉยข้อผิดพลาด

source: Show form
th: แสดงแบบฟอร์ม

source: Authentication type
th: ประเภทการยืนยันตัวตน

source: There are no configured servers
th: ไม่มีเซิร์ฟเวอร์ที่กำหนดค่าไว้

source: New server
th: เซิร์ฟเวอร์ใหม่

source: Default language
th: ภาษาเริ่มต้น

source: Default server
th: เซิร์ฟเวอร์เริ่มต้น

source: let the user choose
th: ให้ผู้ใช้เลือก

source: - none -
th: - ไม่มี -

source: End of line
th: ท้ายบรรทัด

source: Display
th: แสดง

source: phpMyAdmin homepage
th: หน้าหลัก phpMyAdmin

source: Donate
th: บริจาค

source: Check for latest version
th: ตรวจสอบเวอร์ชันล่าสุด

source: Edit server
th: แก้ไขเซิร์ฟเวอร์

source: Add a new server
th: เพิ่มเซิร์ฟเวอร์ใหม่

source: Something went wrong.
th: เกิดข้อผิดพลาดบางอย่างขึ้น

source: Bookmark this SQL query
th: บุ๊กมาร์กคำสั่ง SQL นี้

source: Let every user access this bookmark
th: อนุญาตให้ผู้ใช้ทุกคนเข้าถึงบุ๊กมาร์กนี้

source: Detailed profile
th: รายละเอียดโปรไฟล์

source: Order
th: เรียงลำดับ

source: State
th: สถานะ

source: Time
th: เวลา

source: Summary by state
th: สรุปแยกตามสถานะ

source: Total Time
th: เวลารวม

source: % Time
th: % เวลา

source: Calls
th: เรียก

source: ø Time
th: ø เวลา

source: Your SQL query has been executed successfully.
th: คำสั่ง SQL ของคุณได้รับการดำเนินการเรียบร้อยแล้ว

source: SQL query
th: คำสั่ง SQL

source: Format as a single line
th: จัดรูปแบบเป็นบรรทัดเดียว

source: Get auto-saved query
th: ใช้การบันทึกคำสั่งอัตโนมัติ

source: Bind parameters
th: โยงพารามิเตอร์

source: Columns
th: คอลัมน์

source: Bookmark this SQL query:
th: บุ๊กมาร์กคำสั่ง SQL นี้:

source: Replace existing bookmark of same name
th: แทนที่บุ๊กมาร์กที่มีอยู่แล้วที่มีชื่อเดียวกัน

source: Delimiter
th: ตัวคั่น

source: Show this query here again
th: แสดงคำสั่งนี้ที่นี่อีกครั้ง

source: Retain query box
th: คงกล่องคำสั่ง SQL ไว้

source: Rollback when finished
th: ย้อนกลับเมื่อเสร็จสิ้น

source: Bookmarked SQL query
th: คำสั่ง SQL ที่บุ๊กมาร์กไว้

source: shared
th: ﻿ใช้ร่วมกัน

source: View only
th: ดูอย่างเดียว

source: Simulate query
th: จำลองคำสั่งเรียกดู

source: Browse foreign values
th: เปิดหาค่านอก

source: Use this value
th: ใช้ค่านี้

# Chart type
source: Bar
th: แบบแท่ง

# Chart type
source: Column
th: คอลัมน์

# Chart type
source: Line
th: แบบเส้น

# Chart type
source: Spline
th: แบบเส้นโค้ง

# Chart type
source: Area
th: แบบพื้นที่

# Chart type
source: Pie
th: แบบพาย

# Chart type
source: Timeline
th: ไทม์ไลน์

# Chart type
source: Scatter
th: แบบกระจาย

source: Stacked
th: แบบเรียงซ้อน

source: Chart title:
th: ชื่อแผนภูมิ:

source: X-Axis:
th: แกน X:

source: Series:
th: ซีรีส์:

source: X-Axis label:
th: ป้ายชื่อแกน X:

source: X Values
th: ค่า X

source: Y-Axis label:
th: ป้ายชื่อแกน Y:

source: Y Values
th: ค่า Y

source: Series names are in a column
th: ชื่อซีรีส์อยู่ในคอลัมน์

source: Series column:
th: คอลัมน์ซีรีส์:

source: Value Column:
th: คอลัมน์ค่า:

source: The generated chart
th: แผนภูมิที่สร้างขึ้น

source: Save chart as image
th: บันทึกแผนภูมิเป็นรูปภาพ
