Repository: phpmyadmin/phpmyadmin
Catalog: resources/po/*.po
Languages: th

source: You must provide a valid timing for the trigger!
th: คุณต้องระบุช่วงเวลาที่ถูกต้องสำหรับการทำงานของทริกเกอร์!

source: You must provide a valid event for the trigger!
th: คุณต้องระบุเหตุการณ์ที่ถูกต้องเพื่อใช้เป็นทริกเกอร์!

source: You must provide a valid table name!
th: คุณต้องระบุชื่อตารางที่ถูกต้อง!

source: You must provide a trigger definition.
th: คุณต้องระบุคำจำกัดความของทริกเกอร์

source: not empty
th: ไม่ว่างเปล่า

source: A 1-byte integer, signed range is -128 to 127, unsigned range is 0 to 255
th: จำนวนเต็ม 1 ไบต์ ช่วงค่าแบบมีเครื่องหมาย คือ -128 ถึง 127 ช่วงค่าแบบไม่มีเครื่องหมาย คือ 0 ถึง 255

source: A 2-byte integer, signed range is -32,768 to 32,767, unsigned range is 0 to 65,535
th: จำนวนเต็ม 2 ไบต์ ช่วงค่าแบบมีเครื่องหมาย คือ -32,768 ถึง 32,767 ช่วงค่าแบบไม่มีเครื่องหมาย คือ 0 ถึง 65,535

source: A 3-byte integer, signed range is -8,388,608 to 8,388,607, unsigned range is 0 to 16,777,215
th: จำนวนเต็ม 3 ไบต์ ช่วงค่าแบบมีเครื่องหมาย คือ -8,388,608 ถึง 8,388,607 ช่วงค่าแบบไม่มีเครื่องหมาย คือ 0 ถึง 16,777,215

source: A 4-byte integer, signed range is -2,147,483,648 to 2,147,483,647, unsigned range is 0 to 4,294,967,295
th: จำนวนเต็ม 4 ไบต์ ช่วงค่าแบบมีเครื่องหมาย คือ -2,147,483,648 ถึง 2,147,483,647 ช่วงค่าแบบไม่มีเครื่องหมาย คือ 0 ถึง 4,294,967,295

source: An 8-byte integer, signed range is -9,223,372,036,854,775,808 to 9,223,372,036,854,775,807, unsigned range is 0 to 18,446,744,073,709,551,615
th: จำนวนเต็ม 8 ไบต์ ช่วงค่าแบบมีเครื่องหมาย คือ -9,223,372,036,854,775,808 ถึง 9,223,372,036,854,775,807 ช่วงค่าแบบไม่มีเครื่องหมาย คือ 0 ถึง 18,446,744,073,709,551,615

source: A fixed-point number (M, D) - the maximum number of digits (M) is 65 (default 10), the maximum number of decimals (D) is 30 (default 0)
th: ตัวเลขแบบจุดคงที่ (M, D) - จำนวนหลักสูงสุด (M) คือ 65 (ค่าเริ่มต้นคือ 10) จำนวนจุดทศนิยมสูงสุด (D) คือ 30 (ค่าเริ่มต้นคือ 0)

source: A small floating-point number, allowable values are -3.402823466E+38 to -1.175494351E-38, 0, and 1.175494351E-38 to 3.402823466E+38
th: จำนวนทศนิยมขนาดเล็ก ค่าที่อนุญาตคือ -3.402823466E+38 ถึง -1.175494351E-38, 0 และ 1.175494351E-38 ถึง 3.402823466E+38

source: A double-precision floating-point number, allowable values are -1.7976931348623157E+308 to -2.2250738585072014E-308, 0, and 2.2250738585072014E-308 to 1.7976931348623157E+308
th: เลขทศนิยมความแม่นยำสูง ค่าที่อนุญาตคือ ตั้งแต่ -1.7976931348623157E+308 ถึง -2.2250738585072014E-308, 0 และ 2.2250738585072014E-308 ถึง 1.7976931348623157E+308

source: Synonym for DOUBLE (exception: in REAL_AS_FLOAT SQL mode it is a synonym for FLOAT)
th: คำพ้องความหมายของ DOUBLE (ยกเว้น: ในโหมด SQL REAL_AS_FLOAT คำพ้องความหมายของ FLOAT)

source: A bit-field type (M), storing M of bits per value (default is 1, maximum is 64)
th: ชนิดข้อมูลบิตฟิลด์ (M) สำหรับจัดเก็บค่าแต่ละค่าด้วยบิตจำนวน M บิต (ค่าเริ่มต้นคือ 1 ค่าสูงสุดคือ 64)

source: A synonym for TINYINT(1), a value of zero is considered false, nonzero values are considered true
th: คำพ้องความหมายของ TINYINT(1) ค่าศูนย์ถือว่าเป็นเท็จ ค่าที่ไม่ใช่ศูนย์ถือว่าเป็นจริง

source: An alias for BIGINT UNSIGNED NOT NULL AUTO_INCREMENT UNIQUE
th: นามแฝงของ BIGINT UNSIGNED NOT NULL AUTO_INCREMENT UNIQUE

source: A date, supported range is %1$s to %2$s
th: วันที่ ช่วงวันที่ที่รองรับคือ %1$s ถึง %2$s

source: A date and time combination, supported range is %1$s to %2$s
th: รูปแบบวันที่พร้อมเวลาที่รองรับคือช่วง %1$s ถึง %2$s

source: A timestamp, range is 1970-01-01 00:00:01 UTC to 2038-01-19 03:14:07 UTC on 32-bit platforms (MariaDB 11.3 and earlier), and up to 2106-02-07 06:28:15 UTC on 64-bit platforms (MariaDB 11.5 and later), stored as the number of seconds since the epoch (1970-01-01 00:00:00 UTC)
th: ข้อมูลเวลาจะถูกบันทึกในช่วงเวลา 1970-01-01 00:00:01 UTC ถึง 2038-01-19 03:14:07 UTC บนแพลตฟอร์ม 32 บิต (MariaDB 11.3 และรุ่นก่อนหน้า) และถึง 2106-02-07 06:28:15 UTC บนแพลตฟอร์ม 64 บิต (MariaDB 11.5 และรุ่นที่ใหม่กว่า) โดยจะบันทึกเป็นจำนวนวินาทีตั้งแต่ยุคเริ่มต้น (1970-01-01 00:00:00 UTC)

source: A time, range is %1$s to %2$s
th: เวลา ช่วงเวลาคือ %1$s ถึง %2$s

source: A year in four-digit (4, default) or two-digit (2) format, the allowable values are 70 (1970) to 69 (2069) or 1901 to 2155 and 0000
th: ปีในรูปแบบสี่หลัก (4, ค่าเริ่มต้น) หรือสองหลัก (2) ค่าที่อนุญาตคือ 70 (1970) ถึง 69 (2069) หรือ 1901 ถึง 2155 และ 0000

source: A fixed-length (0-255, default 1) string that is always right-padded with spaces to the specified length when stored
th: สตริงความยาวคงที่ (0-255 ค่าเริ่มต้นคือ 1) ที่จะถูกเติมช่องว่างด้านขวาให้ครบตามความยาวที่ระบุเสมอเมื่อจัดเก็บ

source: A variable-length (%s) string, the effective maximum length is subject to the maximum row size
th: สตริงที่มีความยาวแปรผัน (%s) ความยาวสูงสุดที่ใช้งานได้จริงนั้นขึ้นอยู่กับขนาดแถวสูงสุด

source: A TEXT column with a maximum length of 255 (2^8 - 1) characters, stored with a one-byte prefix indicating the length of the value in bytes
th: คอลัมน์ข้อความ (TEXT) ที่มีความยาวตัวอักษรสูงสุด 255 (2^8 - 1) โดยจัดเก็บพร้อมคำนำหน้าหนึ่งไบต์ที่ระบุความยาวของค่าเป็นไบต์

source: A TEXT column with a maximum length of 65,535 (2^16 - 1) characters, stored with a two-byte prefix indicating the length of the value in bytes
th: คอลัมน์ข้อความ (TEXT) ที่มีความยาวตัวอักษรสูงสุด 65,535 (2^16 - 1) โดยจัดเก็บพร้อมคำนำหน้าสองไบต์ที่ระบุความยาวของค่าเป็นไบต์

source: A TEXT column with a maximum length of 16,777,215 (2^24 - 1) characters, stored with a three-byte prefix indicating the length of the value in bytes
th: คอลัมน์ข้อความ (TEXT) ที่มีความยาวตัวอักษรสูงสุด 16,777,215 (2^24 - 1) โดยจัดเก็บพร้อมคำนำหน้าสามไบต์ที่ระบุความยาวของค่าเป็นไบต์

source: A TEXT column with a maximum length of 4,294,967,295 or 4GiB (2^32 - 1) characters, stored with a four-byte prefix indicating the length of the value in bytes
th: คอลัมน์ข้อความ (TEXT) ที่มีความยาวตัวอักษรสูงสุด 4,294,967,295 หรือ 4 กิกะไบต์ (2^32 - 1) โดยจัดเก็บพร้อมคำนำหน้าสี่ไบต์ที่ระบุความยาวของค่าในหน่วยไบต์

source: Similar to the CHAR type, but stores binary byte strings rather than non-binary character strings
th: คล้ายกับชนิดข้อมูล CHAR แต่เก็บตัวอักษรเป็นไบต์แบบไบนารีแทนที่จะเป็นอักขระที่ไม่ใช่แบบไบนารี

source: Similar to the VARCHAR type, but stores binary byte strings rather than non-binary character strings
th: คล้ายกับชนิดข้อมูล VARCHAR แต่เก็บตัวอักษรเป็นไบต์แบบไบนารีแทนที่จะเป็นอักขระที่ไม่ใช่แบบไบนารี

source: A BLOB column with a maximum length of 255 (2^8 - 1) bytes, stored with a one-byte prefix indicating the length of the value
th: คอลัมน์ BLOB ที่มีความยาวสูงสุด 255 (2^8 - 1) ไบต์ จัดเก็บโดยมีคำนำหน้าหนึ่งไบต์ที่ระบุความยาวของค่า

source: A BLOB column with a maximum length of 16,777,215 (2^24 - 1) bytes, stored with a three-byte prefix indicating the length of the value
th: คอลัมน์ BLOB ที่มีความยาวสูงสุด 16,777,215 (2^24 - 1) ไบต์ จัดเก็บโดยมีคำนำหน้าสามไบต์ที่ระบุความยาวของค่า

source: A BLOB column with a maximum length of 65,535 (2^16 - 1) bytes, stored with a two-byte prefix indicating the length of the value
th: คอลัมน์ BLOB ที่มีความยาวสูงสุด 65,535 (2^16 - 1) ไบต์ จัดเก็บโดยมีคำนำหน้าสองไบต์ที่ระบุความยาวของค่า

source: A BLOB column with a maximum length of 4,294,967,295 or 4GiB (2^32 - 1) bytes, stored with a four-byte prefix indicating the length of the value
th: คอลัมน์ BLOB ที่มีความยาวสูงสุด 4,294,967,295 or 4GiB (2^32 - 1) ไบต์ จัดเก็บโดยมีคำนำหน้าสี่ไบต์ที่ระบุความยาวของค่า

source: An enumeration, chosen from the list of up to 65,535 values or the special '' error value
th: การนับค่า ค่าที่เลือกจากรายการค่าสูงสุด 65,535 ค่า หรือค่าพิเศษ '' ที่ผิดพลาด

source: A single value chosen from a set of up to 64 members
th: ค่าเดี่ยวที่ถูกเลือกจากชุดค่าที่มีสมาชิกได้มากถึง 64 ค่า

source: A type that can store a geometry of any type
th: ประเภทที่สามารถจัดเก็บรูปทรงเรขาคณิตได้ทุกประเภท

source: A point in 2-dimensional space
th: จุดในพื้นที่ 2 มิติ

source: A curve with linear interpolation between points
th: เส้นโค้งที่มีการประมาณค่าเชิงเส้นระหว่างจุดต่าง ๆ

source: A polygon
th: รูปหลายเหลี่ยม

source: A collection of points
th: คอลเลคชั่นของพอยต์

source: A collection of curves with linear interpolation between points
th: คอลเลคชั่นของเส้นโค้งที่มีการประมาณค่าเชิงเส้นระหว่างจุดต่าง ๆ

source: A collection of polygons
th: คอลเลคชั่นของรูปหลายเหลี่ยม

source: A collection of geometry objects of any type
th: คอลเลคชั่นของวัตถุรูปทรงเรขาคณิตประเภทใด ๆ

source: Stores and enables efficient access to data in JSON (JavaScript Object Notation) documents
th: จัดเก็บและช่วยให้เข้าถึงข้อมูลในเอกสาร JSON (JavaScript Object Notation) ได้อย่างมีประสิทธิภาพ

source: Intended for storage of IPv6 addresses, as well as IPv4 addresses assuming conventional mapping of IPv4 addresses into IPv6 addresses
th: จงใจจัดเก็บที่อยู่ IPv6 รวมถึงที่อยู่ IPv4 โดยสมมติว่ามีการแปลงที่อยู่ IPv4 เป็นที่อยู่ IPv6 ตามปกติ

source: 128-bit UUID (Universally Unique Identifier)
th: UUID (Universally Unique Identifier) ขนาด 128 บิต

# numeric types
source: Numeric
th: ตัวเลข

# date and time types
source: Date and time
th: วันและเวลา

# spatial types
source: Spatial
th: เชิงพื้นที่

source: The profile has been updated.
th: ปรับปรุงโปรไฟล์เรียบร้อยแล้ว

source: Password is too long!
th: รหัสผ่านยาวเกินไป!

source: Max: %s%s
th: มากสุด: %s%s

# AM/PM indication in time
source: PM
th: บ่าย

# AM/PM indication in time
source: AM
th: เช้า

source: %s days, %s hours, %s minutes and %s seconds
th: %s วัน, %s ชั่วโมง, %s นาที และ %s วินาที

source: Users
th: ผู้ใช้

source: Error in ZIP archive:
th: เกิดข้อผิดพลาดในไฟล์ ZIP:

source: No files found inside ZIP archive!
th: ไม่พบไฟล์ใด ๆ ภายในไฟล์ ZIP!
