Repository: phpmyadmin/phpmyadmin
Catalog: resources/po/*.po
Languages: th

source: Javascript must be enabled past this point!
th: จำเป็นต้องเปิดใช้งาน JavaScript เพื่อใช้งานในส่วนถัดไป

source: Open user account menu
th: เปิดเมนูบัญชีผู้ใช้

source: phpMyAdmin documentation
th: เอกสารประกอบของ phpMyAdmin

source: MariaDB documentation
th: เอกสารประกอบ MariaDB

source: MySQL documentation
th: เอกสารประกอบ MySQL

source: Appearance:
th: การตั้งค่าลักษณะ

source: Color mode for the theme
th: โหมดสีสำหรับธีม

# Light color mode of the theme
source: Light
th: สว่าง

# Dark color mode of the theme
source: Dark
th: มืด

source: Settings
th: การตั้งค่า

source: Log out
th: ออกจากระบบ

source: Page-related settings
th: การตั้งค่าหน้าที่เกี่ยวข้อง

source: Click on the bar to scroll to top of page
th: คลิกที่แถบเพื่อเลื่อนไปยังบนสุดของหน้า

source: Open new phpMyAdmin window
th: เปิดหน้าต่าง phpMyAdmin ใหม่

source: phpMyAdmin Demo Server
th: เซิร์ฟเวอร์ phpMyAdmin ทดลองใช้งาน

source: Currently running Git revision %1$s from the %2$s branch.
th: ขณะนี้กำลังใช้งาน Git revision %1$s จาก branch %2$s

source: Git information missing!
th: ข้อมูล Git หายไป!

source: Edit ENUM/SET values
th: แก้ไขค่า ENUM/SET

# for default
source: None
th: ไม่มี

source: As defined:
th: ตามที่ระบุ:

source: You don't have sufficient privileges to perform this operation; Please refer to the documentation for more details
th: คุณไม่มีสิทธิ์เพียงพอที่จะดำเนินการนี้; โปรดดูเอกสารประกอบสำหรับรายละเอียดเพิ่มเติม

source: Primary
th: หลัก

source: Unique
th: เอกลักษณ์

source: Index
th: ดัชนี

source: Fulltext
th: ข้อความเต็ม (fulltext)

source: Spatial
th: เชิงพื้นที่

source: Expression
th: คำสั่งแสดง

source: first
th: ที่หนึ่ง

source: after %s
th: หลัง %s

source: None
th: ไม่มี

source: Table name
th: ชื่อตาราง

source: Add
th: เพิ่ม

source: column(s)
th: คอลัมน์

source: Go
th: ไป

source: Table comments:
th: คำอธิบายตาราง:

source: Collation:
th: การตรวจทาน:

source: Storage Engine:
th: ระบบการเก็บข้อมูล:

source: Connection:
th: การเชื่อมต่อ:

source: Storage engine
th: ระบบเก็บข้อมูล

source: PARTITION definition:
th: การนิยาม PARTITION:

# Online transaction part of the SQL DDL for InnoDB
source: Online transaction
th: ธุรกรรมออนไลน์

source: Preview SQL
th: ดูตัวอย่าง SQL

source: Save
th: บันทึก

source: The column width of integer types is ignored in your MySQL version unless defining a TINYINT(1) column
th: ความกว้างของคอลัมน์ประเภทจำนวนเต็มจะถูกละเว้นใน MySQL เวอร์ชันของคุณ เว้นแต่จะกำหนดคอลัมน์ TINYINT(1)

source: Loading
th: กำลังโหลด…

source: Close
th: ปิด

source: Referenced by %s.
th: อ้างอิงโดย %s.

source: Is a foreign key.
th: เลือกคีย์นอก

source: Column
th: คอลัมน์

source: Pick from Central Columns
th: เลือกจากคอลัมน์ส่วนกลาง

source: Partition by:
th: พาร์ทิชันโดย:

source: Expression or column list
th: รายการคำสั่งหรือคอลัมน์

source: Partitions:
th: พาร์ทิชัน:

source: Subpartition by:
th: พาร์ทิชันย่อยโดย:

source: Subpartitions:
th: พาร์ทิชันย่อย:

source: Partition
th: พาร์ทิชัน

source: Values
th: ค่า

source: Subpartition
th: พาร์ทิชันย่อย

source: Engine
th: เครื่องมือ

source: Comment
th: หมายเหตุ

source: Data directory
th: พจนานุกรมข้อมูล

source: Index directory
th: ดัชนีสารบัญ

source: Max rows
th: จำนวนแถวสูงสุด

source: Min rows
th: จำนวนแถวต่ำสุด

source: Table space
th: ช่องว่างตาราง

source: Node group
th: กลุ่มโหนด

source: Structure
th: โครงสร้าง

source: Name
th: ชื่อ

source: Type
th: ชนิด

source: Length/Values
th: ความยาว/เซต*

source: If column type is "enum" or "set", please enter the values using this format: 'a','b','c'…<br>If you ever need to put a backslash ("\") or a single quote ("'") amongst those values, precede it with a backslash (for example '\\xyz' or 'a\'b').
th: หากคอลัมน์เป็นประเภท "enum" หรือ "set" โปรดป้อนค่าโดยใช้รูปแบบนี้: 'a','b','c'…<br>หากคุณต้องการใส่เครื่องหมายแบ็กสแลช ("\") หรือเครื่องหมายอัญประกาศเดี่ยว ("'") ระหว่างค่าเหล่านั้น ให้ใส่เครื่องหมายแบ็กสแลชนำหน้า (เช่น '\\xyz' หรือ 'a\'b')

source: Default
th: ค่าเริ่มต้น

source: For default values, please enter just a single value, without backslash escaping or quotes, using this format: a
th: สำหรับค่าเริ่มต้น กรุณาป้อนค่าเพียงค่าเดียว โดยไม่ต้องใช้เครื่องหมายเลี่ยงอย่างแบ็กสแลชหรืออัญประกาศ ให้ใช้รูปแบบนี้: a

source: Collation
th: ชุดเทียบเคียงอักษร

source: Attributes
th: แอตทริบิวต์

source: Null
th: ไม่มีค่า

source: Adjust privileges
th: แก้ไขสิทธิพิเศษ

source: Comments
th: หมายเหตุ

source: Virtuality
th: เสมือนจริง

source: Move column
th: ย้ายคอลัมน์

source: Media type
th: ประเภทสื่อ

source: List of available transformations and their options
th: รายการการแปลงที่มีให้เลือกและตัวเลือกต่าง ๆ

source: Browser display transformation
th: การแปลงการแสดงผลเบราว์เซอร์

source: Browser display transformation options
th: ตัวเลือกการแปลงการแสดงผลเบราว์เซอร์

source: Please enter the values for transformation options using this format: 'a', 100, b,'c'…<br>If you ever need to put a backslash ("\") or a single quote ("'") amongst those values, precede it with a backslash (for example '\\xyz' or 'a\'b').
th: ถ้าชนิดของฟิลด์เป็น "enum" หรือ "set" โปรดใส่ค่าตามรูปแบบ: 'a','b','c'…<br>ถ้าต้องการใส่เครื่องหมาย backslash ("\") หรือ อัญประกาศเดี่ยว ("'") เข้าไปในค่าเหล่านั้น ให้ใส่เครื่องหมาย แบ๊กแสลช นำหน้า (ตัวอย่าง: '\\xyz' or 'a\'b')

source: Input transformation
th: การแปลงอินพุต

source: Input transformation options
th: ตัวเลือกการแปลงข้อมูลเข้า

source: Apply
th: นำไปใช้

source: Reset
th: รีเซ็ต

source: Documentation
th: เอกสารประกอบ

source: This setting is disabled, it will not be applied to your configuration.
th: การตั้งค่านี้ถูกปิดใช้งาน และจะไม่ถูกนำไปใช้กับการกำหนดค่าของคุณ

source: Disabled
th: ปิดการใช้อยู่

source: Yes
th: ใช่

source: No
th: ไม่

source: Set value: %s
th: ตั้งค่า: %s

source: Restore default value
th: คืนค่าเริ่มต้น

source: Allow users to customize this value
th: อนุญาตให้ผู้ใช้ปรับแต่งค่านี้

source: Collapse
th: ยุบลง

source: Expand
th: ขยาย

source: Requery
th: สั่งคำสั่งอีกครั้ง

source: Edit
th: แก้ไข

source: Delete
th: ลบ

source: Database
th: ฐานข้อมูล

source: SQL Query Console
th: คอนโซลคำสั่ง SQL

source: Console
th: คอนโซล

source: Clear
th: ล้าง

source: History
th: ประวัติ

source: Options
th: ตัวเลือก

source: Bookmarks
th: บุ๊กมาร์ก

source: Debug SQL
th: ดีบั๊ก SQL

source: Press Ctrl+Enter to execute query
th: กด Ctrl+Enter เพื่อรันคำสั่ง

source: Press Enter to execute query
th: กด Enter เพื่อรันคำสั่ง

source: Explain
th: อธิบาย

source: Profiling
th: การทำแฟ้มประวัติ

source: Bookmark
th: บุ๊กมาร์ก

source: Query failed
th: คำสั่งล้มเหลว

source: Queried time
th: เวลาที่คำสั่งรัน

source: During current session
th: ในระหว่างเซสชันปัจจุบัน

source: ascending
th: น้อยไปมาก

source: descending
th: มากไปน้อย

source: Order:
th: ลำดับ:

source: Count
th: นับ

source: Execution order
th: ลำดับการสั่งการ

source: Time taken
th: เวลาที่ใช้

source: Order by:
th: เรียงลำดับโดย:

source: Group queries
th: คำสั่ง SQL แบบกลุ่ม

source: Ungroup queries
th: ยกเลิกการจัดกลุ่มคำสั่ง

source: Show trace
th: แสดงเส้นทาง

source: Hide trace
th: ซ่อนเส้นทาง

source: Count:
th: จำนวน:

source: Time taken:
th: ใช้เวลา:

source: Refresh
th: รีเฟรช

source: Add bookmark
th: เพิ่มบุ๊กมาร์ก

source: Label
th: ป้ายชื่อ

source: Target database
th: ฐานข้อมูลเป้าหมาย

source: Share this bookmark
th: แขร์บุ๊กมาร์กนี้

source: OK
th: ตกลง

source: Restore default values
th: คืนค่าเริ่มต้น

source: Always expand query messages
th: ขยายข้อความคำสั่งเรียกดูเสมอ

source: Show query history at start
th: แสดงประวัติคำสั่ง SQL ตอนเริ่มต้นใช้งาน

source: Show current browsing query
th: แสดงผลการค้นหาคำสั่งเรียกดูปัจจุบัน

source: Execute queries on Enter and insert new line with Shift+Enter. To make this permanent, view settings.
th: เรียกใช้คำสั่งเมื่อกด Enter และแทรกบรรทัดใหม่เมื่อกด Shift+Enter หากต้องการตั้งค่าถาวร ให้ดูที่การตั้งค่า

source: Switch to dark theme
th: สลับไปธีมมืด

source: Create version %1$s of %2$s
th: สร้างเวอร์ชั่น %1$s ของ %2$s

source: Create version %1$s
th: สร้างเวอร์ชัน %1$s

source: Track these data definition statements:
th: คำสั่งติดตามนิยามของข้อมูลเหล่านี้:

source: Track these data manipulation statements:
th: คำสั่งติดตามการจัดการข้อมูลเหล่านี้:

source: Create version
th: สร้างเวอร์ชัน

source: Add new column
th: เพิ่มคอลัมน์ใหม่

source: Length/Value
th: ความยาว/ค่า

source: Attribute
th: แอตทริบิวต์

source: The central list of columns for the current database is empty
th: รายการคอลัมน์หลักสำหรับฐานข้อมูลปัจจุบันว่างเปล่า

source: Filter rows:
th: ตัวกรองแถว:

source: Search this table
th: ค้นหาตารางนี้

source: Add column
th: เพิ่มคอลัมน์

source: Select a table
th: เลือกตาราง

source: Select a column.
th: เลือกคอลัมน์

source: Click to sort.
th: คลิกเพื่อเรียงลำดับ

source: Action
th: กระทำการ

source: Cancel
th: ยกเลิก

source: Create new table
th: สร้างตารางใหม่

source: Number of columns
th: จำนวนคอลัมน์

source: Create
th: สร้าง

source: Database comment:
th: หมายเหตุของฐานข้อมูล:

source: Print
th: พิมพ์

source: Links to
th: เชื่อมไปยัง

source: Indexes
th: ดัชนี

source: Keyname
th: ชื่อคีย์

source: Packed
th: กลุ่ม

source: Cardinality
th: จำนวนสมาชิก

source: No index defined!
th: ยังไม่ได้กำหนดดัชนีใดๆ!

source: Select all
th: เลือกทั้งหมด

source: Show/hide columns
th: แสดง/ซ่อนคอลัมน์

source: See table structure
th: ดูโครงสร้างตาราง

source: Select "%s"
th: เลือก "%s"

source: Add an option for column "%s".
th: เพิ่มตัวเลือกสำหรับคอลัมน์ "%s"

source: Page to open
th: หน้าที่จะเปิด:

source: Page to delete
th: หน้าที่จะลบ

source: Untitled
th: ไม่มีชื่อ

source: Show/Hide tables list
th: แสดง/ซ่อนรายการตาราง

source: View in fullscreen
th: ดูแบบเต็มหน้าจอ

source: Exit fullscreen
th: ออกจากโหมดเต็มหน้าจอ

source: Add tables from other databases
th: เพิ่มตารางจากฐานข้อมูลอื่น ๆ

source: New page
th: หน้าใหม่

source: Open page
th: เปิดหน้า

source: Save page
th: บันทึกหน้า

source: Save page as
th: บันทึกหน้าเป็น

source: Delete pages
th: ลบหน้า

source: Create table
th: สร้างตาราง

source: Create relationship
th: สร้างความสัมพันธ์

source: Choose column to display
th: เลือกคอลัมน์ที่จะแสดง

source: Reload
th: โหลดซ้ำ

source: Help
th: ช่วยเหลือ

source: Angular links
th: ลิงก์เชิงมุม

source: Direct links
th: ลิงก์ตรง

source: Snap to grid
th: จัดวางให้ตรงกับเส้นตาราง

source: Small/Big All
th: เล็ก/ใหญ่ ทั้งหมด

source: Toggle small/big
th: สลับขนาดเล็ก/ใหญ่

source: Toggle relationship lines
th: สลับเส้นความสัมพันธ์

source: Export schema
th: ส่งออกโครงร่าง

source: Build Query
th: สร้างคำสั่ง

source: Move Menu
th: เมนูย้าย

source: Pin text
th: ปักหมุดข้อความ

source: Hide/Show all
th: ซ่อน/แสดงทั้งหมด

source: Hide/Show tables with no relationship
th: ซ่อน/แสดงตารางโดยไม่มีความสัมพันธ์

source: Number of tables:
th: จำนวนตาราง:

source: Delete relationship
th: ลบความสัมพันธ์

source: Relationship operator
th: ตัวดำเนินการความสัมพันธ์

source: Except
th: ยกเว้น

source: Value
th: ค่า

source: subquery
th: คำสั่งย่อย

source: Rename to
th: แก้ไขชื่อเป็น

source: New name
th: ชื่อใหม่

source: Aggregate
th: รวม

source: Operator
th: ตัวปฏิบัติการ

source: Active options
th: ตัวเลือกที่ใช้งานอยู่

source: Submit
th: ส่ง

source: Save to selected page
th: บันทึกไปยังหน้าที่เลือก

source: Create a page and save to it
th: สร้างหน้าและบันทึกลงไป

source: New page name
th: ชื่อหน้าใหม่

source: Select page
th: เลือกหน้า

source: Select export relational type:
th: เลือกประเภทความสัมพันธ์สำหรับการส่งออก:

source: Details
th: รายละเอียด

source: Event name
th: ชื่อเหตุการณ์

source: Status
th: สถานะ

source: Event type
th: ประเภทเหตุการณ์

source: Change to %s
th: เปลี่ยนเป็น %s

source: Execute at
th: ดำเนินการที่

source: Execute every
th: ดำเนินการทุก ๆ

# Start of recurring event
source: Start
th: เริ่ม

# End of recurring event
source: End
th: สิ้นสุด

source: Definition
th: นิยาม

source: Format
th: รูปแบบ

source: On completion preserve
th: คงสถานะเสร็จสมบูรณ์

source: Definer
th: ตัวกำหนด

source: Events
th: เหตุการณ์

source: Check all
th: เลือกทั้งหมด

source: Export
th: ส่งออก

source: Drop
th: ลบทิ้ง

source: Create new event
th: สร้างเหตุการณ์ใหม่

source: There are no events to display.
th: ไม่มีเหตุการณ์ที่จะแสดง

source: Event scheduler status
th: สถานะตัวกำหนดตารางเวลากิจกรรม

source: Click to toggle
th: คลิกเพื่อสลับ

source: ON
th: เปิด

source: OFF
th: ปิด

source: Event editor
th: ตัวแก้ไขเหตุการณ์

source: Loading…
th: กำลังโหลด…

source: Save changes
th: บันทึกการเปลี่ยนแปลง

source: Export event
th: ส่งออกเหตุการณ์

source: @SERVER@ will become the server name and @DATABASE@ will become the database name.
th: @SERVER@ จะกลายเป็นชื่อเซิร์ฟเวอร์ และ @DATABASE@ จะกลายเป็นชื่อฐานข้อมูล

source: Exporting a raw query
th: การส่งคำสั่งหยาบ

source: Exporting tables from "%s" database
th: กำลังส่งออกตารางจาก "%s" ฐานข้อมูล

source: Tables:
th: ตาราง:

source: Tables
th: ตาราง

source: Data
th: ข้อมูล

source: Export the data of all tables.
th: ส่งออกข้อมูลของทุกตาราง

source: Importing into the database "%s"
th: กำลังนำเข้าสู่ฐานข้อมูล "%s"

source: Query window
th: หน้าต่างคำสั่งเรียกดู

source: select table
th: เลือกตาราง

source: select column
th: เลือกคอลัมน์

source: Show
th: แสดง

source: Table alias
th: นามแฝงตาราง

source: Column alias
th: นามแฝงคอลัมน์

source: Use this column in criteria
th: ใช้คอลัมน์นี้เป็นเงื่อนไข

source: criteria
th: เงื่อนไข

source: Sort
th: เรียง

source: Ascending
th: น้อยไปมาก

source: Descending
th: มากไปน้อย

source: Add as
th: เพิ่มเป็น

source: Text
th: ข้อความ

source: Another column
th: คอลัมน์อื่น

source: Enter criteria as free text
th: ระบุเงื่อนไขเป็นข้อความอิสระ

source: Remove this column
th: ลบคอลัมน์นี้

source: + Add column
th: + เพิ่มคอลัมน์

source: Update query
th: คำสั่งอัปเดต

source: Copy query
th: คัดลอกคำสั่ง

source: Submit query
th: ส่งคำสั่ง

source: Database operations
th: การปฏิบัติการฐานข้อมูล

source: Database comment
th: คำอธิบายฐานข้อมูล

source: Rename database to
th: แก้ไขชื่อฐานข้อมูลเป็น

source: New database name
th: ชื่อฐานข้อมูลใหม่

source: You don't have sufficient privileges to perform this operation; Please refer to the documentation for more details.
th: คุณไม่มีสิทธิ์เพียงพอที่จะดำเนินการนี้; โปรดดูเอกสารประกอบสำหรับรายละเอียดเพิ่มเติม

source: Remove database
th: ลบฐานข้อมูล

source: Database %s has been dropped.
th: ลบฐานข้อมูล %s ทิ้งไปเรียบร้อยแล้ว

source: Drop the database (DROP)
th: ลบฐานข้อมูลทิ้ง (DROP)

source: Copy database to
th: คัดลอกฐานข้อมูลไปยัง

source: Database name
th: ชื่อฐานข้อมูล

source: Structure only
th: เฉพาะโครงสร้าง

source: Structure and data
th: โครงสร้างและข้อมูล

source: Data only
th: เฉพาะข้อมูล

source: CREATE DATABASE before copying
th: CREATE DATABASE ก่อนคัดลอก

source: Add %s
th: เพิ่ม %s

source: Add AUTO_INCREMENT value
th: เพิ่มค่า AUTO_INCREMENT

source: Add constraints
th: เพิ่ม constraints

source: Switch to copied database
th: สลับไปยังฐานข้อมูลที่ถูกทำสำเนาไว้

source: Change all tables collations
th: เปลี่ยนการเรียงลำดับของตารางทั้งหมด

source: Change all tables columns collations
th: เปลี่ยนการจัดเรียงคอลัมน์ของตารางทั้งหมด

source: Users having access to "%s"
th: ผู้ใช้มีสิทธิ์เข้าถึงฐานข้อมูล "%s"

source: User name
th: ชื่อผู้ใช้

source: Host name
th: ชื่อโฮสต์

source: Privileges
th: สิทธิพิเศษ

source: Grant
th: มอบสิทธิ์

source: Any
th: ใด ๆ

source: global
th: ทั้งระบบ

source: database-specific
th: ฐานข้อมูลเฉพาะ

source: wildcard
th: ไวล์การ์ด

source: routine
th: รูทีน

source: Edit privileges
th: แก้ไขสิทธิ์

source: No user found.
th: ไม่พบผู้ใช้งาน

source: With selected:
th: ด้วยสิ่งที่เลือก:

source: Not enough privilege to view users.
th: ไม่มีสิทธิ์เพียงพอที่จะดูข้อมูลผู้ใช้

source: Add user account
th: เพิ่มบัญชีผู้ใช้

source: Routine name
th: ชื่อรูทีน

source: Parameters
th: พารามิเตอร์

source: Direction
th: ทิศทาง

source: Add parameter
th: เพิ่มพารามิเตอร์

source: Remove last parameter
th: ลบพารามิเตอร์ตัวสุดท้าย

source: Return type
th: ประเภทการส่งกลับ

source: Return length/values
th: ส่งคืน ความยาว/ค่า

source: Return options
th: ตัวเลือกการส่งคืน

source: Charset
th: ชุดตัวอักษร

source: Is deterministic
th: เป็นแบบกำหนดได้แน่นอน

source: You do not have sufficient privileges to perform this operation; Please refer to the documentation for more details.
th: คุณไม่มีสิทธิ์เพียงพอที่จะดำเนินการนี้; โปรดดูเอกสารประกอบสำหรับรายละเอียดเพิ่มเติม

source: Security type
th: ประเภทความปลอดภัย

source: SQL data access
th: เข้าถึงข้อมูล SQL

source: Routine parameters
th: พารามิเตอร์รูทีน

source: Function
th: ฟังก์ชั่น

source: This routine does not require any parameters.
th: ขั้นตอนการทำงานประจำนี้ไม่จำเป็นต้องใช้พารามิเตอร์ใด ๆ

source: Routines
th: กิจวัตร

source: Search
th: ค้นหา

source: Create new routine
th: สร้างกิจวัตรใหม่

source: There are no routines to display.
th: ไม่มีรูทีนใดให้แสดง

source: Returns
th: ส่งคืน

source: Routine editor
th: ตัวแก้ไขกิจวัตร

source: Export routine
th: ส่งออกกิจวัตร

source: Execute routine
th: ดำเนินการรูทีน

source: Execute
th: ดำเนินการ

source: ENUM/SET editor
th: ตัวแก้ไข ENUM/SET

source: Search in database
th: ค้นหาในฐานข้อมูล

source: Words or values to search for (wildcard: "%"):
th: คำหรือค่าที่ต้องการค้นหา (ตัวอักษรแทนค่า: "%"):

source: Find:
th: ค้นหา:

source: at least one of the words
th: อย่างน้อยหนึ่งคำ

source: Words are separated by a space character (" ").
th: คำถูกแบ่งด้วยช่องว่าง (" ").

source: all of the words
th: ทุกคำ

source: the exact phrase as substring
th: เหมือนทั้งวลีเป็นส่วนย่อย

source: the exact phrase as whole field
th: เหมือนทั้งวลีทั้งช่องข้อมูล

source: as regular expression
th: รูปแบบคำพ้อง (regular expression)

source: Options:
th: ตัวเลือก:

source: include hex matches
th: รวมการจับคู่เลขฐานสิบหก

source: Inside tables:
th: ภายในตาราง:

source: Unselect all
th: ยกเลิกการเลือกทั้งหมด

source: Inside column:
th: ภายในคอลัมน์:

source: %1$s match in <strong>%2$s</strong>
th: %1$s ตรงกับ <strong>%2$s</strong>

source: Browse
th: เรียกดู

source: <strong>Total:</strong> <em>%s</em> match
th: <strong>ทั้งหมด:</strong> <em>%s</em> ค้นพบ

source: Add prefix
th: เพิ่มคำนำหน้า

source: %s table
th: %s ตาราง

source: Replication
th: การจำลองแบบ

source: Sum
th: ผลรวม

source: %s is the default storage engine on this MySQL server.
th: %s คือระบบจัดเก็บข้อมูลเริ่มต้นบนเซิร์ฟเวอร์ MySQL นี้

source: Continue
th: ต่อ

source: From
th: ตั้งแต่

source: To
th: ถึง

source: Check tables having overhead
th: ตรวจสอบตารางที่ต้องดำเนินการก่อน

source: Copy table
th: คัดลอกตาราง

source: Show create
th: แสดงการสร้าง

source: Delete data or table
th: ลบข้อมูลหรือตาราง

source: Empty
th: ล้างข้อมูล

source: Table maintenance
th: การบำรุงรักษาตาราง

source: Analyze table
th: วิเคราะห์ตาราง

source: Check table
th: ตรวจสอบตาราง

source: Checksum table
th: ตารางตรวจสอบผลรวม

source: Optimize table
th: ปรับแต่งตาราง

source: Repair table
th: ซ่อมแซมตาราง

source: Prefix
th: คำนำหน้า

source: Add prefix to table
th: เพิ่มคำนำไปยังตาราง

source: Replace table prefix
th: แทนที่คำนำหน้าตาราง

source: Copy table with prefix
th: คัดลอกตารางพร้อมคำนำหน้า

source: Central columns
th: คอลัมน์กลาง

source: Add columns to central list
th: เพิ่มคอลัมน์ไปยังรายการส่วนกลาง

source: Remove columns from central list
th: ลบคอลัมน์ออกจากรายการส่วนกลาง

source: Make consistent with central list
th: ทำให้ตรงกันกับรายการส่วนกลาง

source: Are you sure?
th: คุณแน่ใจหรือไม่?

source: This action may change some of the columns definition.[br]Are you sure you want to continue?
th: การกระทำนี้อาจเปลี่ยนกำหนดการของคอลัมน์บางอย่าง[br]คุณแน่ใจหรือไม่ว่าคุณจะไปต่อ?

source: Database:
th: ฐานข้อมูล:

source: Add DROP TABLE
th: เพิ่มคำสั่ง DROP TABLE

source: Add AUTO INCREMENT value
th: เพิ่มค่า AUTO_INCREMENT

source: Do you really want to execute the following query?
th: คุณต้องการเรียกใช้คำสั่งต่อไปนี้จริง ๆ หรือไม่?

source: Enable foreign key checks
th: เปิดการตรวจสอบคีย์นอก

source: Remove from Favorites
th: ลบออกจากรายการโปรด

source: Add to Favorites
th: เพิ่มไปรายการโปรด

source: Data dictionary
th: พจนานุกรมข้อมูล

source: No tables found in database.
th: ไม่พบตารางในฐานข้อมูล

source: Showing create queries
th: แสดงคำสั่งการสร้าง

source: Table
th: ตาราง

source: Views
th: มุมมอง

source: View
th: มุมมอง

source: Create view
th: สร้างมุมมอง

source: Not replicated
th: ไม่ทำซ้ำ

source: Replicated
th: ทำซ้ำเรียบร้อยแล้ว

source: Insert
th: แทรก

source: Table %s has been emptied.
th: ลบข้อมูลในตาราง %s เรียบร้อยแล้ว

source: in use
th: ใช้อยู่

source: Rows
th: แถว

source: May be approximate. Click on the number to get the exact count. See [doc@faq3-11]FAQ 3.11[/doc].
th: เป็นเพียงค่าประมาณ คลิกที่ตัวเลขเพื่อดูจำนวนที่แน่นอน ดู [doc@faq3-11]คำถามที่พบบ่อย 3.11[/doc]

source: Size
th: ขนาด

source: Overhead
th: เกินความจำเป็น

source: Creation
th: สร้างเมื่อ

source: Last update
th: ปรับปรุงล่าสุด

source: Last check
th: ตรวจสอบสุดท้าย

source: Tracking is active.
th: การติดตามทำงานอยู่

source: Tracking is not active.
th: การติดตามไม่ได้ทำงานอยู่

source: Tracked tables
th: ตารางที่ถูกติดตาม

source: Last version
th: เวอร์ชันที่แล้ว

source: Created
th: ถูกสร้าง

source: Updated
th: อัปเดตแล้ว

source: active
th: ใช้งาน

source: not active
th: ไม่ได้ใช้งาน

source: Delete tracking
th: ลบข้อมูลการติดตาม

source: Versions
th: เวอร์ชัน

source: Tracking report
th: รายงานการติดตาม

source: Structure snapshot
th: ภาพรวมโครงสร้าง

source: Untracked tables
th: ตารางที่เลิกติดตามแล้ว

source: Track table
th: ตารางที่ติดตาม

source: You can also edit most values by clicking directly on them.
th: นอกจากนี้ คุณยังสามารถแก้ไขค่าส่วนใหญ่ได้โดยการคลิกที่ค่าเหล่านั้นโดยตรง

source: You can also edit most values by double-clicking directly on them.
th: นอกจากนี้ คุณยังสามารถแก้ไขค่าส่วนใหญ่ได้โดยการดับเบิ้ลคลิกที่ค่าเหล่านั้นโดยตรง

# First page
source: Begin
th: เริ่มต้น

# Previous page
source: Previous
th: ก่อนหน้า

# Next page
source: Next
th: ถัดไป

# Last page
source: End
th: สิ้นสุด

source: Show all
th: แสดงทั้งหมด

source: Save edited data
th: บันทึกข้อมูลที่แก้ไข

source: Restore column order
th: คืนค่าลำดับคอลัมน์

source: Number of rows:
th: จำนวนแถว:

source: All
th: ทั้งหมด

source: Sort by key:
th: เรียงโดยคีย์:

source: Extra options
th: ตัวเลือกพิเศษ

source: Partial texts
th: ข้อความบางส่วน

source: Full texts
th: ข้อความเต็ม

source: Relational key
th: คีย์ความสัมพันธ์

source: Display column for relationships
th: แสดงคอลัมน์สำหรับความสัมพันธ์

source: Show binary contents
th: แสดงเนื้อหาไบนารี

source: Show BLOB contents
th: แสดงเนื้อหา BLOB

source: Hide browser transformation
th: ซ่อนการแปลงเบราว์เซอร์

source: Geometry
th: เรขาคณิต

source: Well Known Text
th: ข้อความที่รู้จักกันดี

source: Well Known Binary
th: ไบนารีที่รู้จักกันดี

source: Copy
th: คัดลอก

source: Query results operations
th: ผลลัพธ์คำสั่งเรียกดูการดำเนินการ

source: Copy to clipboard
th: คัดลอกไปยังคลิปบอร์ด

source: Display chart
th: แสดงแผนภูมิ

source: Visualize GIS data
th: แสดงภาพของข้อมูล GIS

# None encoding conversion
source: None
th: ไม่มี

source: Convert to Kana
th: แปลงเป็นอักษรคะนะ

source: Error
th: ผิดพลาด

source: This report automatically includes data about the error and information about relevant configuration settings. It will be sent to the phpMyAdmin team for debugging the error.
th: รายงานนี้จะรวมข้อมูลเกี่ยวกับข้อผิดพลาดและข้อมูลเกี่ยวกับการกำหนดค่าที่เกี่ยวข้องโดยอัตโนมัติ มันจะถูกส่งไปยังทีม phpMyAdmin เพื่อแก้ไขข้อผิดพลาด

source: Can you tell us the steps leading to this error? It decisively helps in debugging:
th: คุณช่วยบอกขั้นตอนที่นำไปสู่ข้อผิดพลาดนี้ได้ไหม? มันจะช่วยในการแก้ไขปัญหาได้อย่างมาก:

source: You may examine the data in the error report:
th: คุณสามารถตรวจสอบข้อมูลในรายงานข้อผิดพลาดได้:

source: Automatically send report next time
th: ส่งรายงานโดยอัตโนมัติในครั้งต่อไป

source: Submit error report
th: ยืนยันส่งรายงานข้อผิดพลาด

source: Send error report
th: ส่งรายงานข้อผิดพลาด

source: Something went wrong
th: เกิดข้อผิดพลาดบางอย่าง
