Repository: phpmyadmin/phpmyadmin
Catalog: resources/po/*.po
Languages: th

source: Leave blank for no user preferences storage in database, suggested: [kbd]pma__userconfig[/kbd].
th: เว้นว่างไว้หากไม่ต้องการบันทึกการตั้งค่าของผู้ใช้ลงในฐานข้อมูล แนะนำให้ใช้: [kbd]pma__userconfig[/kbd]

source: Both this table and the user groups table are required to enable the configurable menus feature; leaving either one of them blank will disable this feature, suggested: [kbd]pma__users[/kbd].
th: ทั้งตารางนี้และตารางกลุ่มผู้ใช้จำเป็นสำหรับการเปิดใช้งานคุณสมบัติเมนูที่อนุญาตให้กำหนดค่าได้; การเว้นว่างตารางใดตารางหนึ่งจะปิดใช้งานคุณสมบัตินี้ แนะนำให้ใช้: [kbd]pma__users[/kbd]

source: Both this table and the users table are required to enable the configurable menus feature; leaving either one of them blank will disable this feature, suggested: [kbd]pma__usergroups[/kbd].
th: ทั้งตารางนี้และตารางผู้ใช้จำเป็นสำหรับการเปิดใช้งานคุณสมบัติเมนูที่อนุญาตให้กำหนดค่าได้ การปล่อยให้ตารางใดตารางหนึ่งว่างจะปิดใช้งานคุณสมบัตินี้ แนะนำให้ใช้: [kbd]pma__usergroups[/kbd]

source: Leave blank to disable the feature to hide and show navigation items, suggested: [kbd]pma__navigationhiding[/kbd].
th: เว้นว่างไว้เพื่อปิดใช้งานคุณสมบัติการซ่อนและแสดงรายการนำทาง คำแนะนำ: [kbd]pma__navigationhiding[/kbd]

source: A user-friendly description of this server. Leave blank to display the hostname instead.
th: คำอธิบายที่เข้าใจง่ายสำหรับเซิร์ฟเวอร์นี้ เว้นว่างไว้เพื่อแสดงชื่อโฮสต์แทน

source: Leave blank if not used.
th: เว้นว่างไว้หากไม่ได้ใช้งาน

source: Leave blank for defaults.
th: เว้นว่างเป็นค่าเริ่มต้น

source: HTTP Basic Auth Realm name to display when doing HTTP Auth.
th: ชื่อ HTTP Basic Auth Realm ที่แสดงเมื่อดำเนินการ HTTP Auth

source: Authentication method to use.
th: วิธีการยืนยันตัวตนที่ใช้

source: Compress connection to MySQL server.
th: บีบอัดการเชื่อมต่อไปยังเซิร์ฟเวอร์ MySQL

source: Hide databases matching regular expression (PCRE).
th: ซ่อนฐานข้อมูลที่ตรงกับนิพจน์ปกติ (PCRE)

source: Hostname where MySQL server is running.
th: ชื่อโฮสต์ซึ่งเซิร์ฟเวอร์ MySQL กำลังทำงานอยู่

source: Leave empty if not using config auth.
th: เว้นว่างไว้ ถ้าไม่ใช้การกำหนดค่าการรับรองความถูกต้อง

source: Port on which MySQL server is listening, leave empty for default.
th: พอร์ตที่เซิร์ฟเวอร์ MySQL กำลังเปิดรับอยู่ เว้นว่างไว้เพื่อใช้ค่าเริ่มต้น

source: Socket on which MySQL server is listening, leave empty for default.
th: ซ็อกเก็ตที่เซิร์ฟเวอร์ MySQL กำลังเปิดรับอยู่ เว้นว่างไว้เพื่อใช้ค่าเริ่มต้น

source: Enable SSL for connection to MySQL server.
th: เปิดใช้งาน SSL สำหรับการเชื่อมต่อไปยังเซิร์ฟเวอร์ MySQL

source: Please note that enabling this has no effect with [kbd]config[/kbd] authentication mode because the password is hard coded in the configuration file; this does not limit the ability to execute the same command directly.
th: โปรดทราบว่าการเปิดใช้งานตัวเลือกนี้ไม่มีผลใด ๆ กับ [kbd]config[/kbd] โหมดการตรวจสอบสิทธิ์ เนื่องจากรหัสผ่านถูกกำหนดไว้ในไฟล์การกำหนดค่าอยู่แล้ว; ซึ่งไม่ได้จำกัดความสามารถในการเรียกใช้คำสั่งเดียวกันโดยตรง

source: Show or hide a column displaying the Creation timestamp for all tables.
th: แสดงหรือซ่อนคอลัมน์ที่แสดงเวลาสร้างสำหรับทุกตาราง

source: Show or hide a column displaying the Last update timestamp for all tables.
th: แสดงหรือซ่อนคอลัมน์ที่แสดงเวลาอัปเดตล่าสุดสำหรับทุกตาราง

source: Show or hide a column displaying the Last check timestamp for all tables.
th: แสดงหรือซ่อนคอลัมน์ที่แสดงเวลาตรวจสอบล่าสุดสำหรับทุกตาราง

source: Defines whether or not type fields should be initially displayed in edit/insert mode.
th: กำหนดว่าไม่ว่าจะมีหรือไม่มีประเภทช่องข้อมูลก็ควรแสดงในโหมดแก้ไข/แทรกข้อมูลในตอนเริ่มต้น

source: Shows link to [a@https://www.php.net/manual/en/function.phpinfo.php]phpinfo()[/a] output.
th: แสดงลิงก์ไปยังผลลัพธ์ของ [a@https://www.php.net/manual/en/function.phpinfo.php]phpinfo()[/a]

source: Whether a user should be displayed a "show all (rows)" button.
th: ไม่ว่าจะควรแสดงปุ่ม "แสดงทุก (แถว)" ให้ผู้ใช้เห็นหรือไม่

source: Show or hide a column displaying the comments for all tables.
th: แสดงหรือซ่อนคอลัมน์ที่แสดงหมายเหตุสำหรับทุกตาราง

source: Show or hide a column displaying the charset for all tables.
th: แสดงหรือซ่อนคอลัมน์ที่แสดงชุดอักขระสำหรับทุกตาราง

source: Display the function fields in edit/insert mode.
th: แสดงช่องข้อมูลฟังก์ชันในโหมดแก้ไข/แทรก

source: Whether to show hint or not.
th: ไม่ว่าจะแสดงคำแนะนำหรือไม่ก็ตาม

source: Defines whether SQL queries generated by phpMyAdmin should be displayed.
th: ไม่ว่าคำสั่ง SQL จะถูกสร้างขึ้นโดย phpMyAdmin หรือไม่ก็ควรต้องแสดง

source: Allow to display database and table statistics (e.g. space usage).
th: อนุญาตให้แสดงสถิติของฐานข้อมูลและตาราง (เช่น การใช้พื้นที่)

source: Mark used tables and make it possible to show databases with locked tables.
th: ทำเครื่องหมายตารางที่ใช้งานอยู่ และทำให้สามารถแสดงฐานข้อมูลที่มีตารางที่ถูกล็อกได้

source: Disable the default warning that is displayed on the main page if Suhosin is detected.
th: ปิดใช้งานคำเตือนเริ่มต้นที่แสดงบนหน้าหลักหากตรวจพบ Suhosin

source: Disable the default warning that is displayed on the main page if the value of the PHP setting session.gc_maxlifetime is less than the value of `LoginCookieValidity`.
th: ปิดใช้งานคำเตือนเริ่มต้นที่แสดงบนหน้าหลัก หากค่าของการตั้งค่า PHP session.gc_maxlifetime น้อยกว่าค่าของ `LoginCookieValidity`

source: Textarea size (columns) in edit mode, this value will be emphasized for SQL query textareas (*2).
th: ขนาดของ Textarea (คอลัมน์) ในโหมดแก้ไข ค่านี้จะถูกเน้นสำหรับ Textarea คำสั่ง SQL (*2)

source: Textarea size (rows) in edit mode, this value will be emphasized for SQL query textareas (*2).
th: ขนาดของ Textarea (แถว) ในโหมดแก้ไข ค่านี้จะถูกเน้นสำหรับ Textarea ของคำสั่ง SQL (*2)

source: Input proxies as [kbd]IP: trusted HTTP header[/kbd]. The following example specifies that phpMyAdmin should trust a HTTP_X_FORWARDED_FOR (X-Forwarded-For) header coming from the proxy 1.2.3.4:[br][kbd]1.2.3.4: HTTP_X_FORWARDED_FOR[/kbd].
th: พร็อกซีอินพุตเป็น [kbd]IP: trusted HTTP header[/kbd] ตัวอย่างต่อไปนี้ระบุว่า phpMyAdmin ควรเชื่อถือส่วนหัว HTTP_X_FORWARDED_FOR (X-Forwarded-For) ที่มาจากพร็อกซี 1.2.3.4:[br][kbd]1.2.3.4: HTTP_X_FORWARDED_FOR[/kbd]

source: When disabled, users cannot set any of the options below, regardless of the checkbox on the right.
th: เมื่อปิดใช้งาน ผู้ใช้จะไม่สามารถตั้งค่าตัวเลือกใด ๆ ด้านล่างได้ ไม่ว่าจะมีเครื่องหมายถูกในช่องด้านขวาหรือไม่ก็ตาม

source: The URL of the proxy to be used when retrieving the information about the latest version of phpMyAdmin, or when submitting error reports. You need this if the server where phpMyAdmin is installed does not have direct access to the Internet. The format is: "hostname:portnumber".
th: URL ของพร็อกซีที่จะใช้เมื่อเรียกดูข้อมูลเกี่ยวกับเวอร์ชันล่าสุดของ phpMyAdmin หรือเมื่อส่งรายงานข้อผิดพลาด คุณจำเป็นต้องใช้สิ่งนี้หากเซิร์ฟเวอร์ที่ติดตั้ง phpMyAdmin ไม่สามารถเข้าถึงอินเทอร์เน็ตได้โดยตรง รูปแบบคือ: "hostname:portnumber"

source: The username for authenticating with the proxy. By default, no authentication is performed. If a username is supplied, Basic Authentication will be performed. No other types of authentication are currently supported.
th: ชื่อผู้ใช้สำหรับยืนยันตัวตนกับพร็อกซี โดยค่าเริ่มต้น จะไม่มีการยืนยันตัวตนใด ๆ หากระบุชื่อผู้ใช้ ระบบจะทำการยืนยันตัวตนแบบพื้นฐาน (Basic Authentication) ซึ่งขณะนี้ยังไม่รองรับการยืนยันตัวตนประเภทอื่น ๆ

source: Queries are executed by pressing Enter (instead of Ctrl+Enter). New lines will be inserted with Shift+Enter.
th: คำสั่ง SQL ทำงานได้โดยการกดปุ่ม Enter (แทนการกด Ctrl+Enter) การแทรกบรรทัดใหม่ทำได้โดยการกด Shift+Enter

source: Enable Zero Configuration mode which lets you set up phpMyAdmin configuration storage tables automatically.
th: เปิดใช้งานโหมด Zero Configuration ซึ่งจะช่วยให้คุณตั้งค่าตารางจัดเก็บการกำหนดค่า phpMyAdmin ได้โดยอัตโนมัติ

source: Highlight selected rows.
th: ไฮไลท์แถวที่เลือก

source: Highlight row pointed by the mouse cursor.
th: ไฮไลท์แถวที่ถูกชี้โดยเม้าส์เคอร์เซอร์

source: Number of columns for CHAR/VARCHAR textareas.
th: จำนวนของคอลัมน์ของ textarea สำหรับ CHAR / VARCHAR

source: Number of rows for CHAR/VARCHAR textareas.
th: จำนวนแถวของ textarea ของ CHAR / VARCHAR

source: Log SQL queries and their execution time, to be displayed in the console
th: บันทึกคำสั่ง SQL และเวลาในการดำเนินการที่จะแสดงในคอนโซล

source: Tab that is displayed when entering a database.
th: แท็บที่แสดงเมื่อเข้าสู่หน้าฐานข้อมูล

source: Tab that is displayed when entering a server.
th: แท็บที่จะแสดงเมื่อเข้าสู่เซิร์ฟเวอร์

source: Tab that is displayed when entering a table.
th: แท็บที่จะแสดงเมื่อเข้าสู่ตาราง

source: Whether the table structure actions should be hidden.
th: ควรซ่อนการดำเนินการโครงสร้างตาราง

source: Whether column comments should be shown in table structure view
th: ควรแสดงคอลัมน์ความคิดเห็นในมุมมองโครงสร้างตาราง

source: Show server listing as a list instead of a drop down.
th: แสดงรายการเซิร์ฟเวอร์เป็นแบบรายการแทนที่จะเป็นแบบดรอปดาวน์

source: A dropdown will be used if fewer items are present.
th: จะมีการใช้ดรอปดาวน์หากรายการที่แสดงมีจำนวนน้อย

source: Default value for foreign key checks checkbox for some queries.
th: ค่าเริ่มต้นสำหรับช่องทำเครื่องหมายตรวจสอบคีย์นอกเพื่อบางคำสั่งเรียกดู

source: Uncheck the checkbox to disable drag and drop import
th: ยกเลิกการเลือกช่องทำเครื่องหมายเพื่อปิดใช้งานการนำเข้าแบบลากและวาง

source: How many rows can be inserted at one time.
th: ให้แทรกข้อมูลได้กี่แถวในครั้งเดียว

source: Maximum number of characters shown in any non-numeric column on browse view.
th: จำนวนอักขระสูงสุดที่แสดงในคอลัมน์ที่ไม่ใช่ตัวเลขใด ๆ ในมุมมองการเรียกดู

source: Define how long (in seconds) a login cookie is valid.
th: กำหนดระยะเวลา (เป็นวินาที) อายุการใช้งานคุกกี้สำหรับการเข้าสู่ระบบ

source: Double size of textarea for LONGTEXT columns.
th: เพิ่มขนาดเป็นสองเท่าของ textarea สำหรับคอลัมน์ LONGTEXT

source: Maximum number of databases displayed in database list.
th: จำนวนฐานข้อมูลสูงสุดที่แสดงในรายการฐานข้อมูล

source: Maximum number of tables displayed in table list.
th: จำนวนตารางสูงสุดที่แสดงในรายการตาราง

source: Maximum number of recently used tables; set 0 to disable.
th: จำนวนตารางที่ใช้งานล่าสุดสูงสุด; กำหนด 0 เพื่อปิดใช้งาน

source: Maximum number of favorite tables; set 0 to disable.
th: จำนวนตารางโปรดสูงสุด; กำหนด 0 เพื่อปิดใช้งาน

source: These are Edit, Copy and Delete links.
th: นี่คือลิงก์สำหรับแก้ไข คัดลอก และลบ

source: Whether to show row links even in the absence of a unique key.
th: จะแสดงลิงก์แถว แม้ว่าจะไม่มีคีย์เฉพาะก็ตาม

source: Disable shortcut keys
th: ปิดการใช้งานคีย์ลัด

source: Use natural order for sorting table and database names.
th: ใช้การเรียงลำดับตามธรรมชาติสำหรับชื่อตารางและฐานข้อมูล

source: Use only icons, only text or both.
th: ใช้เฉพาะไอคอน เฉพาะข้อความ หรือทั้งสองอย่างก็ได้

source: Use GZip output buffering for increased speed in HTTP transfers.
th: ใช้การบัฟเฟอร์เอาต์พุต GZip เพื่อเพิ่มความเร็วในการถ่ายโอนข้อมูลผ่าน HTTP

source: Use persistent connections to MySQL databases.
th: ใช้การเชื่อมต่อแบบถาวรกับฐานข้อมูล MySQL

source: Disallow BLOB and BINARY columns from editing.
th: ไม่อนุญาตให้แก้ไขคอลัมน์ประเภท BLOB และ BINARY

source: How many queries are kept in history.
th: มีการบันทึกประวัติคำสั่งเรียกดูไว้กี่ครั้ง

source: Select which functions will be used for character set conversion.
th: เลือกฟังก์ชันที่จะใช้สำหรับการแปลงชุดอักขระ

source: When browsing tables, the sorting of each table is remembered.
th: เมื่อเรียกดูตาราง ระบบจะจดจำลำดับการจัดเรียงของแต่ละตารางไว้

source: Default sort order for tables with a primary key.
th: ลำดับการจัดเรียงเริ่มต้นสำหรับตารางที่มีคีย์หลัก

source: Repeat the headers every X cells, [kbd]0[/kbd] deactivates this feature.
th: ทำส่วนหัวซ้ำในทุก ๆ เซลส์ X [kbd]0[/kbd] ปิดใช้งานฟีเจอร์นี้

source: For display Options
th: สำหรับตัวเลือกการแสดงผล

source: Directory where exports can be saved on server.
th: ไดเรกทอรีที่สามารถบันทึกการส่งออกไว้บนเซิร์ฟเวอร์

source: Defines whether the query box should stay on-screen after its submission.
th: กำหนดว่าไม่ว่าอย่างไรช่องคำถามก็ควรแสดงอยู่บนหน้าจอหลังจากส่งคำถามแล้ว

source: Title of browser window when a database is selected.
th: ชื่อหน้าต่างเบราว์เซอร์เมื่อเลือกฐานข้อมูลแล้ว

source: Title of browser window when nothing is selected.
th: ชื่อหน้าต่างเบราว์เซอร์เมื่อไม่มีการเลือกใด ๆ

source: Title of browser window when a server is selected.
th: ชื่อหน้าต่างเบราว์เซอร์เมื่อเลือกเซิร์ฟเวอร์แล้ว

source: Title of browser window when a table is selected.
th: ชื่อหน้าต่างเบราว์เซอร์เมื่อเลือกตารางแล้ว

source: Directory on server where you can upload files for import.
th: ไดเรกทอรีบนเซิร์ฟเวอร์ซึ่งคุณสามารถอัปโหลดไฟล์เพื่อการนำเข้า

source: Allow for searching inside the entire database.
th: อนุญาตให้ค้นหาภายในฐานข้อมูลทั้งหมดได้

source: Enables check for latest version on main phpMyAdmin page.
th: เปิดใช้งานการตรวจหาเวอร์ชันล่าสุดบนหน้าหลัก phpMyAdmin

source: The password for authenticating with the proxy.
th: รหัสผ่านสำหรับยืนยันตัวตนกับพร็อกซี

source: Enable ZIP compression for import and export operations.
th: เปิดใช้งานการบีบอัดไฟล์ ZIP สำหรับการนำเข้าและส่งออกข้อมูล

source: Choose the default action when sending error reports.
th: เลือกการดำเนินการเริ่มต้นเมื่อส่งรายงานข้อผิดพลาด

source: Allow login to any MySQL server
th: อนุญาตให้เข้าสู่ระบบเซิร์ฟเวอร์ MySQL ใดก็ได้

source: Restrict login to MySQL server
th: จำกัดการลงชื่อเข้าสู่ระบบเซิร์ฟเวอร์ MySQL

source: Allow third party framing
th: อนุญาตให้ผู้ใช้ภายนอกทำการจัดเฟรม

source: Show "Drop database" link to normal users
th: แสดงลิงก์ "ละทิ้งฐานข้อมูล" ไปยังผู้ใช้ปกติ

source: Blowfish secret
th: ข้อความลับ Blowfish

source: Row marker
th: เครื่องหมายแถว

source: Highlight pointer
th: ไฮไลท์ตัวชี้

source: CHAR columns editing
th: แก้ไขคอลัมน์ CHAR

source: Enable CodeMirror
th: เปิดใช้งาน CodeMirror

source: Enable linter
th: เปิดใช้งาน Linter

source: Minimum size for input field
th: ขนาดต่ำสุดสำหรับช่องกรอกข้อมูล

source: Maximum size for input field
th: ขนาดสูงสุดสำหรับช่องกรอกข้อมูล

source: CHAR textarea columns
th: คอลัมน์ textarea ของ CHAR

source: CHAR textarea rows
th: แถว textarea ของ CHAR

source: Check config file permissions
th: ตรวจสอบสิทธิ์ไฟล์การกำหนดค่า

source: Compress on the fly
th: บีบอัดในทันที

source: Confirm DROP queries
th: ยืนยันคำสั่ง DROP

source: Paper size
th: ขนาดกระดาษ

source: Default database tab
th: แท็บฐานข้อมูลเริ่มต้น

source: Default server tab
th: แท็บเซิร์ฟเวอร์เริ่มต้น

source: Default table tab
th: แท็บตารางเริ่มต้น

source: Enable autocomplete for table and column names
th: เปิดใช้งานการเติมชื่อโดยอัตโนมัติสำหรับชื่อตารางและคอลัมน์

source: Show column comments
th: แสดงคอลัมน์หมายเหตุ

source: Hide table structure actions
th: ซ่อนการดำเนินการโครงสร้างตาราง

source: Default transformations for Hex
th: การแปลงค่าเริ่มต้นสำหรับเลขฐานสิบหก

source: Default transformations for Substring
th: การแปลงค่าเริ่มต้นสำหรับสตริงย่อย

source: Default transformations for Bool2Text
th: การแปลงค่าเริ่มต้นสำหรับ Bool2Text

source: Default transformations for External
th: การแปลงค่าเริ่มต้นสำหรับภายนอก

source: Default transformations for PreApPend
th: การแปลงค่าเริ่มต้นสำหรับ PreApPend

source: Default transformations for DateFormat
th: การแปลงค่าเริ่มต้นสำหรับ DateFormat

source: Default transformations for Inline
th: การแปลงค่าเริ่มต้นสำหรับ Inline

source: Default transformations for TextImageLink
th: การแปลงค่าเริ่มต้นสำหรับ TextImageLink

source: Default transformations for TextLink
th: การแปลงค่าเริ่มต้นสำหรับ TextLink

source: Display servers as a list
th: แสดงเซิร์ฟเวอร์เป็นรายการ

source: Disable multi table maintenance
th: ปิดใช้งานการบำรุงรักษาหลายตาราง

source: Maximum execution time
th: เวลาดำเนินการสูงสุด

source: Use [code]LOCK TABLES[/code] statement
th: ใช้คำสั่ง [code]LOCK TABLES[/code]

source: Save as file
th: บันทึกเป็นไฟล์

source: Character set of the file
th: ชุดอักขระของไฟล์

source: Compression
th: บีบอัดข้อมูล

source: Put columns names in the first row
th: ใส่ชื่อคอลัมน์ไว้ในแถวแรก

source: Columns enclosed with
th: คอลัมน์ที่ล้อมรอบด้วย

source: Columns escaped with
th: คอลัมน์ละเว้นด้วย

source: Replace NULL with
th: แทนที่ค่า NULL ด้วย

source: Remove CRLF characters within columns
th: ลบอักขระ CRLF ภายในคอลัมน์

source: Columns terminated with
th: คอลัมน์ที่สิ้นสุดด้วย

source: Lines terminated with
th: บรรทัดที่สิ้นสุดด้วย

source: Excel edition
th: รุ่น Excel

source: Database name template
th: ต้นแบบชื่อฐานข้อมูล

source: Server name template
th: ต้นแบบชื่อเซิร์ฟเวอร์

source: Table name template
th: ต้นแบบชื่อตาราง

source: Dump table
th: สำรองตาราง

source: Include table caption
th: ใส่คำอธิบายตาราง

source: Table caption
th: คำอธิบายตาราง

source: Continued table caption
th: คำอธิบายตารางต่อเนื่อง

source: Label key
th: คีย์ป้ายชื่อ

source: Relationships
th: ความสัมพันธ์

source: Export method
th: วิธีการส่งออก

source: Save on server
th: บันทึกบนเซิร์ฟเวอร์

source: Export as separate files
th: ส่งออกแบบแยกไฟล์

source: Remember filename template
th: จดจำต้นแบบชื่อไฟล์

source: Remove DEFINER clause from definitions
th: ลบวลี DEFINER จากนิยาม

source: Enclose table and column names with backquotes
th: เติมชื่อตารางและคอลัมน์ด้วย backquotes

source: SQL compatibility mode
th: โหมดความเข้ากันได้ของ SQL

source: Creation/Update/Check dates
th: สร้าง/อัปเดต/ตรวจสอบวันที่

source: Use delayed inserts
th: ใช้การแทรกแบบหน่วงเวลา

source: Disable foreign key checks
th: ปิดการตรวจสอบคีย์นอก

source: Export views as tables
th: ส่งออกมุมมองเป็นตาราง

source: Export related metadata from phpMyAdmin configuration storage
th: ส่งออกเมตาเดต้าที่เกี่ยวข้องจากที่เก็บข้อมูลการกำหนดค่า phpMyAdmin

source: Use hexadecimal for BINARY & BLOB
th: ใช้เลขฐานสิบหกสำหรับไบนารีและ BLOB

source: Add IF NOT EXISTS (less efficient as indexes will be generated during table creation)
th: เพิ่มคำสั่ง IF NOT EXISTS (ประสิทธิภาพต่ำกว่า เนื่องจากดัชนีจะถูกสร้างขึ้นในระหว่างการสร้างตาราง)

source: %s view
th: %s มุมมอง

source: Use ignore inserts
th: ใช้การละเว้นการแทรก

source: Syntax to use when inserting data
th: ไวยกรณ์ที่ใช้ขณะแทรกข้อมูล

source: Maximal length of created query
th: ความยาวสูงสุดของคำสั่งเรียกดูที่สร้างขึ้น

source: Export type
th: ประเภทการส่งออก

source: Enclose export in a transaction
th: รวมการส่งออกไว้ในรายการ

source: Export time in UTC
th: ส่งออกเวลาเป็นรูปแบบ UTC

source: Foreign key dropdown order
th: ลำดับดรอปดาวน์คีย์นอก

source: Foreign key limit
th: ข้อจำกัดคีย์นอก

source: Foreign key checks
th: ตรวจสอบคีย์นอก

source: First day of calendar
th: วันแรกของปฏิทิน

source: Browse mode
th: โหมดเรียกดู

source: Developer
th: ผู้พัฒนา

source: Edit mode
th: โหมดแก้ไข

source: Export defaults
th: ค่าเริ่มต้นการส่งออก

source: General
th: ทั่วไป

source: Import defaults
th: ค่าเริ่มต้นการนำเข้า

source: Import / export
th: นำเข้า / ส่งออก

source: Navigation tree
th: แผนผังการนำทาง

source: Microsoft Office
th: ไมโครซอฟต์ออฟฟิศ

source: Other core settings
th: การตั้งค่าหลักอื่น ๆ

source: Page titles
th: ชื่อหน้า

source: Security
th: ความปลอดภัย

source: Basic settings
th: การตั้งค่าพื้นฐาน

source: Authentication
th: การตรวจสอบสิทธิ์

source: Server configuration
th: การกำหนดค่าเซิร์ฟเวอร์

source: Configuration storage
th: กำหนดค่าที่จัดเก็บข้อมูล

source: Changes tracking
th: เปลี่ยนแปลงการติดตาม

source: SQL Query box
th: กล่องคำสั่ง SQL

source: Startup
th: เริ่มระบบ

source: Database structure
th: โครงสร้างฐานข้อมูล

source: Tabs
th: แท็บ

source: Display relational schema
th: แสดงแผนผังความสัมพันธ์

source: Text fields
th: กล่องข้อความ

source: Texy! text
th: Texy! ข้อความ

source: Warnings
th: คำเตือน

source: Extra parameters for iconv
th: พารามิเตอร์พิเศษสำหรับ iconv

source: Ignore multiple statement errors
th: ละเว้นข้อผิดพลาดจากคำสั่งหลายรายการ

source: Enable drag and drop import
th: เปิดใช้งานการนำเข้าแบบลากและวาง

source: Partial import: allow interrupt
th: นำเข้าบางส่วน: อนุญาตให้ขัดจังหวะ

source: Do not abort on INSERT error
th: ห้ามหยุดการทำงานคำสั่ง INSERT เมื่อเกิดข้อผิดพลาด

source: Add ON DUPLICATE KEY UPDATE
th: เพิ่มเมื่อมีการอัปเดตคีย์ซ้ำ

source: Format of imported file
th: รูปแบบของไฟล์ที่นำเข้า

source: Use LOCAL keyword
th: ใช้คีย์เวิร์ดภายในเครื่อง

source: Column names in first row
th: ชื่อคมลัมน์ที่ข้อมูลแถวแรก

source: Do not import empty rows
th: ไม่ต้องนำเข้าแถวที่ไม่มีข้อมูล

source: Import currencies ($5.00 to 5.00)
th: นำเข้าสกุลเงิน ($5.00 ถึง 5.00)

source: Import percentages as proper decimals (12.00% to .12)
th: นำเข้าเปอร์เซ็นต์โดยใช้ทศนิยมที่ถูกต้อง (12.00% เป็น 0.12)

source: Partial import: skip queries
th: นำเข้าบางส่วน: ข้ามคำสั่งเรียกดู

source: Do not use AUTO_INCREMENT for zero values
th: ไม่ต้องใช้ AUTO_INCREMENT สำหรับค่าที่เป็นศูนย์

source: Read as multibytes
th: อ่านเป็นมัลติไบต์

source: Initial state for sliders
th: สถานะเริ่มต้นสำหรับตัวเลื่อน

source: Number of inserted rows
th: จำนวนแถวที่แทรกเข้าไป

source: Limit column characters
th: จำกัดจำนวนอักขระในคอลัมน์

source: Delete all cookies on logout
th: ลบคุ้กกี้ทั้งหมดเมื่อออกจากระบบ

source: Recall user name
th: เรียกคืนชื่อผู้ใช้

source: Login cookie store
th: การเก็บรักษาคุ้กกี้ที่ใช้เข้าสู่ระบบ

source: Login cookie validity
th: ความถูกต้องของคุกกี้ในการเข้าสู่ระบบ

source: Bigger textarea for LONGTEXT
th: เพิ่มขนาดของ textarea ให้ใหญ่ขึ้นสำหรับ LONGTEXT

source: Maximum displayed SQL length
th: ความยาวสูงสุดของคำสั่ง SQL ที่แสดง

source: Maximum databases
th: ฐานข้อมูลสูงสุด

source: Maximum items on first level
th: จำนวนรายการสูงสุดในชั้นแรก

source: Maximum items in branch
th: จำนวนรายการสูงสุดในสาขา

source: Maximum number of rows to display
th: จำนวนแถวสูงสุดที่จะแสดง

source: Maximum tables
th: ตารางสูงสุด

source: Memory limit
th: ขีดจำกัดหน่วยความจำ

source: Show databases navigation as tree
th: แสดงการนำทางฐานข้อมูลในรูปแบบแผนผังต้นไม้

source: Navigation panel width
th: ความกว้างแผงนำทาง

source: Link with main panel
th: เชื่อมกับแผงหลัก

source: Display logo
th: แสดงโลโก้

source: Logo link URL
th: โลโก้ลิงก์ไป URL

source: Logo link target
th: เป้าหมายลิงก์โลโก้

source: Display servers selection
th: การเลือกเซิร์ฟเวอร์แสดงผล

source: Target for quick access icon
th: ไอคอนเป้าหมายสำหรับการเข้าถึงอย่างรวดเร็ว

source: Target for second quick access icon
th: กำหนดเป้าหมายสำหรับไอคอนเข้าถึงด่วนที่สอง

source: Minimum number of items to display the filter box
th: จำนวนรายการขั้นต่ำที่จะแสดงในกล่องตัวกรอง

source: Minimum number of databases to display the database filter box
th: จำนวนรายการฐานข้อมูลขั้นต่ำที่จะแสดงในกล่องตัวกรอง

source: Group items in the tree
th: จัดกลุ่มรายการในโครงสร้างแบบต้นไม้

source: Database tree separator
th: ตัวคั่นฐานข้อมูลแบบโครงสร้างต้นไม้

source: Table tree separator
th: ตัวคั่นตารางแบบโครงสร้างต้นไม้

source: Maximum table tree depth
th: ความลึกสูงสุดของโครงสร้างตารางแบบต้นไม้

source: Enable highlighting
th: เปิดการใช้งานไฮไลท์

source: Enable navigation tree expansion
th: เปิดใช้งานการขยายแผนผังการนำทาง

source: Show tables in tree
th: แสดงตารางในแผนผังแบบต้นไม้

source: Show views in tree
th: แสดงมุมองในแผนผังแบบต้นไม้

source: Show functions in tree
th: แสดงฟังก์ชันในแผนผังแบบต้นไม้

source: Show procedures in tree
th: แสดงขั้นตอนในรูปแบบแผนผังต้นไม้

source: Show events in tree
th: แสดงเหตุการณ์ในรูปแบบแผนผังต้นไม้

source: Expand single database
th: ขยายฐานข้อมูลเดี่ยว

source: Recently used tables
th: ตารางที่ใช้ล่าสุด

source: Where to show the table row links
th: ตำแหน่งที่จะแสดงลิงก์แถวในตาราง

source: Show row links anyway
th: อย่างไรแล้วก็ต้องแสดงลิงก์แถว

source: Natural order
th: เรียงลำดับตามธรรมชาติ

source: Table navigation bar
th: แถบแผนผังนำทางตาราง

source: GZip output buffering
th: การบัฟเฟอร์เอาต์พุต GZip

source: Default sorting order
th: ลำดับการจัดเรียงเริ่มต้น

source: Persistent connections
th: การเชื่อมต่อที่คงอยู่

source: Missing phpMyAdmin configuration storage tables
th: ไม่พบตารางจัดเก็บการกำหนดค่า phpMyAdmin

source: MySQL reserved word warning
th: คำเตือนเกี่ยวกับคำสงวนของ MySQL
