Repository: phpmyadmin/phpmyadmin
Catalog: resources/po/*.po
Languages: th

source: Go back
th: ย้อนกลับ

source: Select a template
th: เลือกต้นแบบ

source: Export templates:
th: ส่งออกต้นแบบ:

source: New template:
th: ต้นแบบใหม่:

source: Template name
th: ชื่อต้นแบบ

source: Existing templates:
th: ต้นแบบที่มีอยู่:

source: Template:
th: ต้นแบบ:

source: Update
th: อัปเดต

source: SQL query:
th: คำสั่ง SQL:

source: Show SQL query
th: แสดงคำสั่ง SQL

source: Export method:
th: วิธีการส่งออก:

source: Quick - display only the minimal options
th: รวดเร็ว - แสดงเฉพาะตัวเลือกที่น้อยที่สุด

source: Custom - display all possible options
th: กำหนดเอง - แสดงตัวเลือกที่เป็นไปได้ทั้งหมด

source: Format:
th: รูปแบบ:

source: File format to export
th: รูปแบบไฟล์ที่ส่งออก

source: Rows:
th: แถว:

source: Dump all rows
th: ดัมพ์ข้อมูลทุกแถว

source: Dump some row(s)
th: ดัมพ์ข้อมูลบางแถว

source: Row to begin at:
th: เริ่มที่แถว:

source: Output:
th: ผลลัพธ์:

source: Save on server in the directory <strong>%s</strong>
th: บันทึกไว้ในไดเรกทอรีบนเซิร์ฟเวอร์ <strong>%s</strong>

source: Overwrite existing file(s)
th: เขียนทับไฟล์ที่มีอยู่แล้ว

source: Rename exported databases/tables/columns
th: เปลี่ยนชื่อฐานข้อมูล/ตาราง/คอลัมน์ที่ส่งออก

source: Defined aliases
th: นามแฝงที่กำหนดไว้

# Alias
source: Database
th: ฐานข้อมูล

source: Remove
th: ลบ

# Alias
source: Table
th: ตาราง

# Alias
source: Column
th: คอลัมน์

source: Define new aliases
th: กำหนดนามแฝงใหม่

source: Select database:
th: เลือกฐานข้อมูล:

source: Select table:
th: เลือกตาราง:

source: New table name
th: ชื่อตารางใหม่

source: Select column:
th: เลือกคอลัมน์:

source: New column name
th: ชื่อคอลัมน์ใหม่

source: Save & close
th: บันทึกและปิด

source: Use %s statement
th: ใช้คำสั่ง %s

source: View output as text
th: ดูผลลัพธ์ในรูปแบบข้อความ

source: Save output to a file
th: บันทึกผลลัพธ์ลงในไฟล์

source: File name template:
th: ต้นแบบชื่อไฟล์:

source: This value is interpreted using the 'strftime' function, so you can use time formatting strings. Additionally the following transformations will happen: %s Other text will be kept as is. See the FAQ 6.27 for details.
th: ค่านี้จะถูกตีความโดยใช้ฟังก์ชัน 'strftime' ดังนั้นคุณจึงสามารถใช้สตริงการจัดรูปแบบเวลาได้ นอกจากนี้จะมีการแปลงต่อไปนี้เกิดขึ้น: %s ข้อความอื่น ๆ จะยังคงอยู่เหมือนเดิม ดูรายละเอียดเพิ่มเติมที่ FAQ 62.7

source: Use this for future exports
th: ใช้การตั้งค่านี้สำหรับการส่งออกในอนาคต

source: Character set of the file:
th: ชุดอักขระของไฟล์:

source: Compression:
th: บีบอัดข้อมูล:

source: Export databases as separate files
th: ส่งออกฐานข้อมูลเป็นไฟล์แยกกัน

source: Export tables as separate files
th: ส่งออกตารางเป็นไฟล์แยกกัน

source: Skip tables larger than:
th: ข้ามตารางที่มีขนาดใหญ่กว่า:

source: The size is measured in MiB.
th: วัดขนาดไฟล์เป็น MiB

source: Format-specific options:
th: ตัวเลือกรูปแบบเฉพาะ:

source: Encoding Conversion:
th: การแปลงรหัส:

source: Filters
th: ตัวกรอง

source: Containing the word:
th: ที่มีคำว่า:

source: Geometry type:
th: ประเภทเรขาคณิต:

source: Spatial Reference System Identifier
th: ตัวระบุระบบอ้างอิงเชิงพื้นที่

source: Use OpenStreetMaps as Base Layer
th: ใช้ OpenStreetMaps เป็นชั้นพื้นฐาน

source: Output
th: เอาท์พุต

source: Git revision:
th: การแก้ไข Git:

source: no branch
th: ไม่มีสาขา

source: from %s branch
th: จากสาขา %s

source: committed on %s by %s
th: ยืนยันเมื่อ %s โดย %s

source: authored on %s by %s
th: เขียนเมื่อ %s โดย %s

source: You are using the demo server. You can do anything here, but please do not change root, debian-sys-maint and pma users. More information is available at %s.
th: คุณกำลังใช้งานเซิร์ฟเวอร์ทดลอง คุณสามารถทำอะไรก็ได้ในนี้ แต่กรุณาอย่าแก้ไขผู้ใช้ root, debian-sys-maint และ pma ข้อมูลเพิ่มเติมสามารถดูได้ที่ %s

source: General settings
th: การตั้งค่าทั่วไป

source: Change password
th: เปลี่ยนรหัสผ่าน

source: Server connection collation:
th: การเรียงลำดับการเชื่อมต่อเซิร์ฟเวอร์:

source: More settings
th: การตั้งค่าเพิ่มเติม

source: Appearance settings
th: การตั้งค่ารูปลักษณ์

source: Language
th: ภาษา

source: Theme
th: ธีม

# View all themes
source: View all
th: ดูทั้งหมด

source: Database server
th: เซิร์ฟเวอร์ฐานข้อมูล

source: Server:
th: เซิร์ฟเวอร์:

source: Hostname:
th: ชื่อโฮสต์:

source: Server type:
th: ชนิดเซิร์ฟเวอร์:

source: Server connection:
th: การเชื่อมต่อเซิร์ฟเวอร์:

source: Server version:
th: เวอร์ชันของเซิร์ฟเวอร์:

source: User:
th: ผู้ใช้:

source: Server charset:
th: ชุดอักขระของเซิร์ฟเวอร์:

source: Web server
th: เว็บเซิร์ฟเวอร์

source: Database client version:
th: เวอร์ชันของไคลเอนต์ฐานข้อมูล:

source: PHP extension:
th: ส่วนขยาย PHP:

source: PHP version:
th: เวอร์ชันของ PHP:

source: Show PHP information
th: แสดงข้อมูลของ PHP

source: Version information:
th: ข้อมูลเวอร์ชัน:

source: Official Homepage
th: โฮมเพจอย่างเป็นทางการ

source: Contribute
th: สนับสนุน

source: Get support
th: รับการสนับสนุน

source: List of changes
th: รายการของการเปลี่ยนแปลง

source: License
th: ลิขสิทธิ์

source: Warning
th: คำเตือน

source: Notice
th: ประกาศ

source: phpMyAdmin Themes
th: ธีม phpMyAdmin

source: Get more themes!
th: รับธีมเพิ่มเติม!

source: Screenshot of the %s theme.
th: ภาพแคปเจอร์หน้าจอของธีม %s

source: Take it
th: รับไว้

source: Back
th: ย้อนกลับ

source: Import
th: นำเข้า

source: File to import:
th: ไฟล์ที่นำเข้า:

source: File may be compressed (%s) or uncompressed.
th: ไฟล์อาจถูกบีบอัด (%s) หรือไม่ถูกบีบอัดก็ได้

source: A compressed file's name must end in <strong>.[format].[compression]</strong>. Example: <strong>.sql.zip</strong>
th: ชื่อไฟล์ที่ถูกบีบอัดจะต้องลงท้ายด้วย <strong>.[format].[compression]</strong> ตัวอย่าง: <strong>.sql.zip</strong>

source: Upload a file
th: อัปโหลดไฟล์

source: Select file to import
th: เลือกไฟล์นำเข้า

source: Browse your computer:
th: เรียกดูคอมพิวเตอร์ของคุณ:

source: You may also drag and drop a file on any page.
th: คุณยังสามารถลากและวางไฟล์ลงบนหน้าใดก็ได้

source: The directory you set for upload work cannot be reached.
th: ไม่สามารถเข้าถึงไดเร็กทอรีที่คุณตั้งค่าไว้สำหรับการอัปโหลดงานได้

source: Select from the web server upload directory [strong]%s[/strong]:
th: เลือกจากไดเรกทอรีอัปโหลดของเว็บเซิร์ฟเวอร์ [strong]%s[/strong]:

source: There are no files to import!
th: ไม่มีไฟล์ให้นำเข้า!

source: File uploads are not allowed on this server.
th: เซิร์ฟเวอร์นี้ไม่อนุญาตให้ทำการอัปโหลดไฟล์

source: Partial import:
th: นำเข้าบางส่วน:

source: Previous import timed out, after resubmitting will continue from position %d.
th: การนำเข้าครั้งก่อนหมดเวลา หลังจากทำใหม่อีกครั้งจะดำเนินการต่อจากตำแหน่ง %d

source: Allow the interruption of an import in case the script detects it is close to the PHP timeout limit.
th: อนุญาตให้ขัดจังหวะการนำเข้าได้ในกรณีที่สคริปต์ตรวจพบว่าใกล้ถึงขีดจำกัดเวลาหมดอายุของ PHP แล้ว

source: This might be a good way to import large files, however it can break transactions.
th: วิธีนี้อาจเป็นวิธีที่ดีในการนำเข้าไฟล์ขนาดใหญ่ แต่ก็อาจทำให้การทำธุรกรรมล้มเหลวได้

source: Skip this number of queries (for SQL) starting from the first one:
th: ข้ามคำสั่งจำนวนนี้ (สำหรับ SQL) โดยเริ่มจากคำสั่งแรก:

source: Other options
th: ตัวเลือกอื่น ๆ

source: Rename
th: แก้ไขชื่อ

source: The primary key has been dropped.
th: คีย์หลักถูกลบออกแล้ว

source: Index %s has been dropped.
th: ดัชนี %s ถูกยกเลิกแล้ว

source: Taking you to the target site.
th: นำคุณไปยังไซต์เป้าหมาย

source: Page number:
th: หมายเลขหน้า:

source: Log in
th: เข้าสู่ระบบ

source: You can enter hostname/IP address and port separated by space.
th: คุณสามารถป้อนชื่อโฮสต์/ที่อยู่ IP และพอร์ตโดยคั่นด้วยช่องว่าง

source: Username:
th: ชื่อผู้ใช้:

source: Password:
th: รหัสผ่าน:

source: Server choice:
th: ตัวเลือกเซิร์ฟเวอร์:

source: Welcome to %s
th: ยินดีต้อนรับสู่ %s

source: There is a mismatch between HTTPS indicated on the server and client. This can lead to a non working phpMyAdmin or a security risk. Please fix your server configuration to indicate HTTPS properly.
th: การตั้งค่า HTTPS บนเซิร์ฟเวอร์และลูกข่ายไม่ตรงกัน ซึ่งอาจทำให้ phpMyAdmin ใช้งานไม่ได้ หรือเกิดความเสี่ยงด้านความปลอดภัย โปรดแก้ไขการกำหนดค่าเซิร์ฟเวอร์ของคุณให้ระบุ HTTPS อย่างถูกต้อง

source: Please scan following QR code into the two-factor authentication app on your device and enter authentication code it generates.
th: โปรดสแกนคิวอาร์โค้ดต่อไปนี้ลงในแอปพลิเคชันยืนยันตัวตนสองขั้นตอนบนอุปกรณ์ของคุณ และป้อนรหัสยืนยันที่แอปสร้างขึ้น

source: Secret/key:
th: ข้อความลับ/คีย์:

source: Authentication code:
th: รหัสตรวจสอบสิทธิ์:

source: Open the two-factor authentication app on your device to view your authentication code and verify your identity.
th: เปิดแอปตรวจสอบสิทธิ์แบบสองขั้นตอนบนอุปกรณ์ของคุณเพื่อดูรหัสยืนยันและตรวจสอบสิทธิ์ของคุณ

source: The configured two factor authentication is not available, please install missing dependencies.
th: ไม่สามารถใช้งานการตรวจสอบสิทธิ์แบบสองขั้นตอนที่ตั้งค่าไว้ได้ โปรดติดตั้งส่วนพึ่งพาที่ขาดหายไป

source: Deprecated!
th: เลิกใช้แล้ว!

source: The FIDO U2F API has been deprecated in favor of the Web Authentication API (WebAuthn).
th: API FIDO U2F ได้ถูกยกเลิกการใช้งานแล้ว และให้ใช้ Web Authentication API (WebAuthn) แทน

source: You can still use Firefox to authenticate your account using the FIDO U2F API, however it's recommended that you use the WebAuthn authentication instead.
th: คุณยังคงสามารถใช้ Firefox เพื่อยืนยันตัวตนบัญชีของคุณโดยใช้ FIDO U2F API ได้ แต่ขอแนะนำให้ใช้การยืนยันตัวตน WebAuthn แทน

source: Please connect your FIDO U2F device into your computer's USB port. Then confirm registration on the device.
th: โปรดเชื่อมต่ออุปกรณ์ FIDO U2F เข้ากับพอร์ต USB ของคอมพิวเตอร์ จากนั้นยืนยันการลงทะเบียนบนอุปกรณ์

source: You are not using https to access phpMyAdmin, therefore FIDO U2F device will most likely refuse to authenticate you.
th: คุณไม่ได้ใช้ https ในการเข้าถึง phpMyAdmin ดังนั้นอุปกรณ์ FIDO U2F จึงมีแนวโน้มที่จะปฏิเสธการตรวจสอบสิทธิ์ของคุณ

source: Please connect your FIDO U2F device into your computer's USB port. Then confirm login on the device.
th: โปรดเชื่อมต่ออุปกรณ์ FIDO U2F เข้ากับพอร์ต USB ของคอมพิวเตอร์ จากนั้นยืนยันการเข้าสู่ระบบบนอุปกรณ์

source: Verify
th: ตรวจสอบ

source: Please connect your WebAuthn/FIDO2 device. Then confirm registration on the device.
th: โปรดเชื่อมต่ออุปกรณ์ WebAuthn/FIDO2 ของคุณ จากนั้นยืนยันการลงทะเบียนบนอุปกรณ์

source: Please connect your WebAuthn/FIDO2 device. Then confirm login on the device.
th: โปรดเชื่อมต่ออุปกรณ์ WebAuthn/FIDO2 ของคุณ จากนั้นยืนยันการเข้าสู่ระบบบนอุปกรณ์

source: View:
th: มุมมอง:

source: Table:
th: ตาราง:

source: Toggle navigation
th: สลับการนำทาง

source: (current)
th: (ปัจจุบัน)

source: Show hidden navigation tree items.
th: แสดงรายการโครงสร้างการนำทางที่ซ่อนอยู่

source: Unhide
th: เปิดเผย

source: Home
th: หน้าหลัก

source: Empty session data
th: ล้างข้อมูลเซสชัน

source: MariaDB Documentation
th: เอกสารประกอบ MariaDB

source: MySQL Documentation
th: เอกสารประกอบ MySQL

source: Navigation panel settings
th: การตั้งค่าแผงนำทาง

source: Reload navigation panel
th: โหลดแผงนำทางใหม่

source: An error has occurred while loading the navigation display
th: เกิดข้อผิดพลาดขณะโหลดหน้าจอการนำทาง

source: Drop files here
th: หย่อนไฟล์ลงที่นี่

source: SQL upload
th: อัปโหลด SQL

source: Databases
th: ฐานข้อมูล

source: Type to filter these, Enter to search all
th: พิมพ์เพื่อกรองคำเหล่านี้ กด Enter เพื่อค้นหาทั้งหมด

source: Clear fast filter
th: ล้างค่าตัวกรองเร็ว

source: Recently visited tables
th: ตารางที่เข้าชมล่าสุด

source: Recent
th: ล่าสุด

source: Favorite tables
th: ตารางโปรด

source: Favorites
th: รายการโปรด

source: Your browser has phpMyAdmin configuration for this domain. Would you like to import it for current session?
th: เบราว์เซอร์ของคุณมีการกำหนดค่า phpMyAdmin สำหรับโดเมนนี้ คุณต้องการนำเข้าสำหรับการใช้งานในครั้งนี้หรือไม่?

source: Delete settings
th: ลบการตั้งค่า

source: Cannot save settings, submitted form contains errors!
th: ไม่สามารถบันทึกการตั้งค่าได้ แบบฟอร์มที่ส่งมามีข้อผิดพลาด!

source: Manage your settings
th: จัดการการตั้งค่าของคุณ

source: Two-factor authentication
th: การตรวจสอบสิทธิ์แบบสองขั้นตอน

source: Features
th: คุณสมบัติ

source: SQL queries
th: คำสั่ง SQL

source: Navigation panel
th: แผงนำทาง

source: Main panel
th: แผงหลัก

source: Configuration has been saved.
th: บันทึกการกำหนดค่าเรียบร้อยแล้ว

source: Your preferences will be saved for current session only. Storing them permanently requires %sphpMyAdmin configuration storage%s.
th: การกำหนดค่าของคุณจะถูกบันทึกไว้สำหรับเซสชันปัจจุบันเท่านั้น การบันทึกอย่างถาวรต้องใช้ %sphpMyAdmin configuration storage%s

source: Configuration contains incorrect data for some fields.
th: การกำหนดค่ามีข้อมูลที่ไม่ถูกต้องในบางช่องข้อมูล

source: Do you want to import remaining settings?
th: คุณต้องการนำเข้าการตั้งค่าที่เหลือหรือไม่?

source: Saved on: @DATE@
th: บันทึกแล้วเมื่อ: @DATE@

source: Import from file
th: นำเข้าจากไฟล์

source: Import from browser's storage
th: นำเข้าจากที่เก็บข้อมูลของเบราเซอร์

source: Settings will be imported from your browser's local storage.
th: ระบบจะนำเข้าการตั้งค่าจากพื้นที่จัดเก็บข้อมูลภายในเครื่องของเบราว์เซอร์คุณ

source: You have no saved settings!
th: คุณไม่มีการตั้งค่าที่บันทึกไว้!

source: This feature is not supported by your web browser
th: เบราว์เซอร์ของคุณไม่รองรับฟีเจอร์นี้

source: Merge with current configuration
th: ผสานเข้ากับการกำหนดค่าปัจจุบัน

source: You can set more settings by modifying config.inc.php, eg. by using %sSetup script%s.
th: คุณสามารถกำหนดการตั้งค่าเพิ่มเติมได้โดยแก้ไข config.inc.php เช่น โดยการใช้ %sSetup script%s

source: Save as JSON file
th: บันทึกเป็นไฟล์ JSON

source: Save as PHP file
th: บันทึกเป็นไฟล์ PHP

source: Save to browser's storage
th: บันทึกไปยังที่เก็บข้อมูลของเบราเซอร์

source: Settings will be saved in your browser's local storage.
th: การตั้งค่าจะถูกบันทึกไว้ในที่เก็บข้อมูลของเบราเซอร์ภายในเครื่องคุณ

source: Existing settings will be overwritten!
th: การตั้งค่าที่มีอยู่จะถูกเขียนทับ!

source: You can reset all your settings and restore them to default values.
th: คุณสามารถรีเซ็ตการตั้งค่าทั้งหมดของคุณและเรียกคืนเป็นค่าเริ่มต้นได้

source: Configure two-factor authentication
th: ตั้งค่าการตรวจสอบสิทธิ์แบบสองขั้นตอน

source: Enable two-factor authentication
th: เปิดใช้งานการตรวจสอบสิทธิ์แบบสองขั้นตอน

source: Confirm disabling two-factor authentication
th: ยืนยันการปิดใช้งานการตรวจสอบสิทธิ์แบบสองขั้นตอน

source: By disabling two factor authentication you will be again able to login using password only.
th: เมื่อปิดใช้งานการตรวจสอบสิทธิ์แบบสองขั้นตอน คุณจะสามารถเข้าสู่ระบบโดยใช้รหัสผ่านเพียงอย่างเดียวได้อีกครั้ง

source: Disable two-factor authentication
th: ปิดใช้งานการตรวจสอบสิทธิ์แบบสองขั้นตอน

source: Two-factor authentication status
th: สถานะการตรวจสอบสิทธิ์แบบสองขั้นตอน

source: Two-factor authentication is not available, please install optional dependencies to enable authentication backends.
th: ไม่สามารถใช้งานการตรวจสอบสิทธิ์แบบสองขั้นตอนได้ โปรดติดตั้งส่วนประกอบเสริมเพื่อเปิดใช้งานระบบตรวจสอบสิทธิ์

source: Following composer packages are missing:
th: แพ็กเกจ Composer ต่อไปนี้หายไป:

source: Two-factor authentication is available and configured for this account.
th: บัญชีนี้รองรับการตรวจสอบสิทธิ์แบบสองขั้นตอนและได้กำหนดค่าไว้แล้ว

source: Two-factor authentication is available, but not configured for this account.
th: สามารถใช้งานการตรวจสอบสิทธิ์แบบสองขั้นตอนได้ แต่ไม่ได้กำหนดค่าไว้สำหรับบัญชีนี้

source: Please install optional dependencies to enable more authentication backends.
th: โปรดติดตั้งส่วนประกอบเสริมที่จำเป็นเพื่อเปิดใช้งานระบบตรวจสอบสิทธิ์หลังบ้านเพิ่มเติม

source: Two-factor authentication is not available, enable phpMyAdmin configuration storage to use it.
th: ไม่สามารถใช้งานการตรวจสอบสิทธิ์แบบสองขั้นตอนได้ โปรดเปิดใช้งานการจัดเก็บการกำหนดค่า phpMyAdmin เพื่อใช้งาน

source: You have enabled two factor authentication.
th: คุณได้เปิดใช้งานการตรวจสอบสิทธิ์แบบสองขั้นตอนแล้ว

source: No change
th: ไม่มีการเปลี่ยนแปลง

source: There are no favorite tables.
th: ไม่มีตารางโปรด

source: There are no recent tables.
th: ไม่มีตารางล่าสุด

source: phpMyAdmin configuration storage
th: พื้นที่จัดเก็บการตั้งค่า phpMyAdmin

source: Configuration of pmadb…
th: การตั้งค่า pmadb…

source: not OK
th: ไม่ตกลง

source: General relation features
th: ลักษณะความสัมพันธ์ทั่วไป

source: %sCreate%s a database named '%s' and setup the phpMyAdmin configuration storage there.
th: %sCreate%s สร้างฐานข้อมูลชื่อ '%s' และตั้งค่าการจัดเก็บการกำหนดค่า phpMyAdmin ไว้ในฐานข้อมูลนั้น

source: %sCreate%s the phpMyAdmin configuration storage in the current database.
th: %sCreate%s สร้างพื้นที่จัดเก็บการตั้งค่า phpMyAdmin ในฐานข้อมูลปัจจุบัน

source: %sCreate%s missing phpMyAdmin configuration storage tables.
th: %sCreate%s สร้างตารางจัดเก็บการกำหนดค่า phpMyAdmin ที่หายไป

# Correctly working
source: OK
th: ตกลง

source: General relation features:
th: ลักษณะความสัมพันธ์ทั่วไป:

source: Enabled
th: เปิดใช้อยู่

source: Display features:
th: คุณสมบัติการแสดงผล:

source: Designer and creation of PDFs:
th: ออกแบบและสร้างไฟล์ PDF:

source: Displaying column comments:
th: แสดงหมายเหตุของคอลัมน์:

source: Browser transformation:
th: การแปลงเบราว์เซอร์:

source: Please see the documentation on how to update your column_info table.
th: โปรดดูเอกสารประกอบเกี่ยวกับวิธีการอัปเดตตาราง column_info ของคุณ

source: Bookmarked SQL query:
th: บุ๊กมาร์กคำสั่ง SQL:

source: SQL history:
th: ประวัต SQL:

source: Persistent recently used tables:
th: ตารางที่ใช้งานล่าสุดแบบถาวร:

source: Persistent favorite tables:
th: ตารางถาวรที่โปรด:

source: Persistent tables' UI preferences:
th: การกำหนดค่า UI ของตารางถาวร:

source: Tracking:
th: การติดตาม:

source: User preferences:
th: การกำหนดค่าของผู้ใช้:

source: Configurable menus:
th: เมนูที่กำหนดค่าได้:

source: Hide/show navigation items:
th: ซ่อน/แสดงรายการนำทาง:

source: Saving Query-By-Example searches:
th: การบันทึกการค้นหา Query-By-Example:

source: Managing central list of columns:
th: การจัดการรายการคอลัมน์ส่วนกลาง:

source: Quick steps to set up advanced features:
th: ขั้นตอนง่าย ๆ ในการตั้งค่าคุณสมบัติขั้นสูง:

source: Create the needed tables with the <code>%screate_tables.sql</code>.
th: สร้างตารางที่จำเป็นโดยใช้ไฟล์ <code>%screate_tables.sql</code>

source: Create a pma user and give access to these tables.
th: สร้างผู้ใช้ pma และให้สิทธิ์การเข้าถึงตารางเหล่านี้

source: Enable advanced features in configuration file (<code>config.inc.php</code>), for example by starting from <code>config.sample.inc.php</code>.
th: เปิดใช้งานคุณสมบัติขั้นสูงในไฟล์การกำหนดค่า (<code>config.inc.php</code>) ตัวอย่างเช่น โดยเริ่มจาก <code>config.sample.inc.php</code>

source: Re-login to phpMyAdmin to load the updated configuration file.
th: เข้าสู่ระบบ phpMyAdmin อีกครั้งเพื่อโหลดไฟล์การกำหนดค่าที่อัปเดตแล้ว

source: Binary log
th: บันทึกไบนารี

source: Select binary log to view
th: เลือกบันทึกไบนารีเพื่อดู

source: Files
th: ไฟล์

source: Log name
th: ชื่อบันทึก

source: Position
th: ตำแหน่ง

source: Server ID
th: ไอดีเซิร์ฟเวอร์

source: Original position
th: ตำแหน่งดั้งเดิม

source: Information
th: ข้อมูล

source: Character sets and collations
th: ชุดอักขระและการตรวจทาน

source: Databases statistics
th: สถิติฐานข้อมูล

source: Create database
th: สร้างฐานข้อมูล

source: Jump to database '%s'
th: ข้ามไปยังฐานข้อมูล '%s'

source: Check privileges for database "%s".
th: ตรวจสอบสิทธิ์สำหรับฐานข้อมูล "%s"

source: Check privileges
th: ตรวจสอบสิทธิ์

source: Total:
th: รวม:

source: Note: Enabling the database statistics here might cause heavy traffic between the web server and the MySQL server.
th: โปรดทราบ: การเปิดใช้การเก็บสถิติของฐานข้อมูล อาจจะทำให้มีปริมาณการถ่ายโอนข้อมูลจำนวนมาก ระหว่างเว็บเซิร์ฟเวอร์ และเซิร์ฟเวอร์ MySQL.

source: Enable statistics
th: เปิดใช้งานสถิติ

source: No databases
th: ไม่มีฐานข้อมูล

source: Confirm
th: ยืนยัน

source: Storage engines
th: ระบบจัดเก็บข้อมูล

source: Storage Engine
th: ที่จัดเก็บระบบ

source: Description
th: คำอธิบาย

source: Free pages
th: หน่วยความจำว่างในบัฟเฟอร์พูล

source: Dirty pages
th: หน้าข้อมูลในหน่วยความจำชั่วคราว

source: Pages containing data
th: หน่วยความจำที่ประกอบด้วยข้อมูล

source: Pages to be flushed
th: หน่วยความจำที่จะถูกล้าง

source: Busy pages
th: หน้าหน่วยความจำไม่ว่าง

source: Latched pages
th: หน้าหน่วยความจำแบบย่อ

source: %s pages
th: %s หน้า

source: Read requests
th: คำขออ่าน

source: Write requests
th: คำขอเขียน

source: Read misses
th: อ่านพลาด

source: Write waits
th: การเขียนที่อยู่ในระหว่างการรอ

source: Read misses in %
th: อ่านพลาดใน %

source: Write waits in %
th: การเขียนที่อยู่ในระหว่างการรอใน %

source: Variables
th: ตัวแปร

source: @SERVER@ will become the server name.
th: @SERVER@ จะกลายเป็นชื่อเซิร์ฟเวอร์

source: Exporting databases from the current server
th: การส่งออกฐานข้อมูลจากเซิร์ฟเวอร์ปัจจุบัน

source: Importing into the current server
th: กำลังนำเข้าสู่เซิร์ฟเวอร์ปัจจุบัน

source: Plugins
th: ปลั๊กอิน

source: Plugin
th: ปลั๊กอิน

source: Version
th: เวอร์ชัน

source: Author
th: ผู้เขียน

source: disabled
th: ปิดใช้งาน

# Create new user
source: New
th: ใหม่

source: Database for user account
th: ฐานข้อมูลสำหรับบัญชีผู้ใช้

source: Create database with same name and grant all privileges.
th: สร้างฐานข้อมูลที่มีชื่อเดียวกันและให้สิทธิ์การเข้าถึงทั้งหมด

source: Grant all privileges on wildcard name (username\_%).
th: ให้สิทธิ์ทั้งหมดแก่ชื่อผู้ใช้แบบมีเงื่อนไข (ชื่อผู้ใช้\_%)

source: Grant all privileges on database %s.
th: มอบสิทธิ์การเข้าถึงฐานข้อมูล %s ทั้งหมด

source: No Password
th: ไม่มีรหัสผ่าน

source: Enter:
th: เข้า:

source: Re-type:
th: พิมพ์ใหม่:

source: Password Hashing:
th: การเข้ารหัสรหัสผ่าน:

source: This method requires using an '<em>SSL connection</em>' or an '<em>unencrypted connection that encrypts the password using RSA</em>'; while connecting to the server.
th: วิธีการนี้จำเป็นต้องใช้ '<em>การเชื่อมต่อ SSL</em>' หรือ '<em>การเชื่อมต่อที่ไม่เข้ารหัสซึ่งเข้ารหัสรหัสผ่านโดยใช้ RSA </em>'; ในขณะเชื่อมต่อกับเซิร์ฟเวอร์

source: Edit privileges:
th: แก้ไขสิทธิ์:

source: User account
th: บัญชีผู้ใช้

source: Routine
th: รูทีน

source: Note: You are attempting to edit privileges of the user with which you are currently logged in.
th: หมายเหตุ: คุณกำลังพยายามแก้ไขสิทธิ์ของผู้ใช้ที่คุณกำลังเข้าสู่ระบบอยู่

source: Routine-specific privileges
th: สิทธิ์รูทีนเฉพาะ

source: Note: MySQL privilege names are expressed in English.
th: โปรดทราบ: ชื่อของสิทธิพิเศษใน MySQL จะแสดงเป็นภาษาอังกฤษ

source: Allows user to give to other users or remove from other users privileges that user possess on this routine.
th: อนุญาตให้ผู้ใช้สามารถมอบสิทธิ์ให้แก่ผู้ใช้รายอื่น หรือลบสิทธิ์ที่ผู้ใช้รายนี้มีอยู่ในระบบนี้ออกจากผู้ใช้รายอื่นได้

source: Allows altering and dropping this routine.
th: อนุญาตให้แก้ไขและลบรูทีนนี้ได้

source: Allows executing this routine.
th: อนุญาตให้ดำเนินการรูทีนนี้

source: Login Information
th: ข้อมูลการเข้าสู่ระบบ

source: User name:
th: ชื่อผู้ใช้:

source: Any user
th: ผู้ใช้ใด ๆ

source: Use text field
th: ใช้ช่องข้อความ

source: An account already exists with the same username but possibly a different hostname.
th: มีบัญชีผู้ใช้ที่มีชื่อผู้ใช้เดียวกันอยู่แล้ว แต่ชื่อโฮสต์อาจแตกต่างกัน

source: Host name:
th: ชื่อโฮสต์:

source: Any host
th: โฮสต์ใด ๆ

source: Local
th: เครื่องโลคอล

source: When Host table is used, this field is ignored and values stored in Host table are used instead.
th: เมื่อใช้ตารางโฮสต์ ระบบจะละเว้นฟิลด์นี้และใช้ค่าที่จัดเก็บไว้ในตารางโฮสต์แทน

source: Password
th: รหัสผ่าน

source: Do not change the password
th: ห้ามเปลี่ยนรหัสผ่าน

source: Re-type
th: พิมพ์อีกครั้ง

source: Edit user group
th: แก้ไขกลุ่มผู้ใช้

source: Table-specific privileges
th: สิทธิพิเศษเฉพาะตาราง

source: Column-specific privileges
th: สิทธิ์เฉพาะคอลัมน์

source: Add privileges on the following database(s):
th: เพิ่มสิทธิ์การเข้าถึงฐานข้อมูลต่อไปนี้:

source: Wildcards % and _ should be escaped with a \ to use them literally.
th: เครื่องหมายแทน % และ _ ต้องใช้วิธีการหลบเลี่ยงด้วยเครื่องหมาย \ เพื่อใช้มันอย่างถูกต้อง
