Repository: phpmyadmin/phpmyadmin
Catalog: resources/po/*.po
Languages: th

source: @SERVER@ will become the server name, @DATABASE@ will become the database name and @TABLE@ will become the table name.
th: @SERVER@ จะกลายเป็นชื่อเซิร์ฟเวอร์, @DATABASE@ จะกลายเป็นชื่อฐานข้อมูล และ @TABLE@ จะกลายเป็นชื่อตาราง

source: Exporting rows from "%s" table
th: ส่งออกแถวจาก "%s" ตาราง

source: Table search
th: ตารางค้นหา

source: Zoom search
th: ค้นหาแบบ Zoom

source: Find and replace
th: ค้นหาและแทนที่

source: Replace with:
th: แทนที่ด้วย:

source: Column:
th: คอลัมน์:

source: Use regular expression
th: รูป regular expression

source: Find and replace - preview
th: ค้นหาและแทนที่ - ดูตัวอย่าง

source: Original string
th: สตริงดั้งเดิม

source: Replaced string
th: สตริงที่แทนที่

source: Replace
th: แทนที่

source: Display GIS Visualization
th: แสดงภาพข้อมูล GIS

source: Label column
th: ป้ายชื่อคอลัมน์

source: -- None --
th: -- ไม่มี --

source: Spatial column
th: คอลัมน์เชิงพื้นที่

source: Importing into the table "%s"
th: กำลังนำเข้าสู่ตาราง "%s"

source: Index name:
th: ชื่อดัชนี:

source: "PRIMARY" <b>must</b> be the name of and <b>only of</b> a primary key!
th: "PRIMARY" <b>จะต้อง</b>เป็นชื่อของคีย์หลัก<b>เท่านั้น</b>!

source: Index choice:
th: ตัวเลือกดัชนี:

source: Key block size:
th: ขนาดบล็อกคีย์:

source: Index type:
th: ชนิดของดัชนี:

source: Parser:
th: ตัวแยกวิเคราะห์:

source: Comment:
th: หมายเหตุ:

source: Drag to reorder
th: ลากเพื่อจัดเรียงลำดับใหม่

source: Ignore
th: เพิกเฉย

source: Add %s column(s) to index
th: เพิ่ม %s คอลัมน์ไปยังดัชนี

source: Insert as new row
th: แทรกเป็นแถวใหม่

source: Insert as new row and ignore errors
th: แทรกเป็นแถวใหม่และไม่สนใจข้อผิดพลาด

source: Show insert query
th: แสดงคำสั่งแทรก

source: and then
th: แล้วก็

source: Go back to previous page
th: กลับไปยังหน้าก่อนหน้า

source: Insert another new row
th: แทรกอีกหนึ่งแถวใหม่

source: Go back to this page
th: กลับไปยังหน้านี้

source: Edit next row
th: แก้ไขแถวถัดไป

source: Use TAB key to move from value to value, or CTRL+arrows to move anywhere.
th: ใช้ปุ่ม TAB เพื่อเลื่อนจากค่าหนึ่งไปยังอีกค่าหนึ่ง หรือใช้ปุ่ม CTRL + ลูกศร เพื่อเลื่อนไปยังตำแหน่งใดก็ได้

source: Binary
th: ไบนารี

source: Binary - do not edit
th: ไบนารี - ห้ามแก้ไข

source: Edit/Insert
th: แก้ไข/แทรก

source: Amount of rows to insert
th: จำนวนแถวที่จะแทรก

source: Improve table structure (Normalization):
th: ปรับปรุงโครงสร้างตาราง (การทำให้เป็นรูปแบบปกติ):

source: Select up to what step you want to normalize
th: เลือกขั้นตอนที่คุณต้องการปรับค่าให้เป็นมาตรฐาน

source: Hint: Please follow the procedure carefully in order to obtain correct normalization
th: คำแนะนำ: โปรดปฏิบัติตามขั้นตอนอย่างระมัดระวังเพื่อให้ได้ผลลัพธ์การปรับค่ามาตรฐานที่ถูกต้อง

source: First step of normalization (1NF)
th: ขั้นตอนแรกของการนอร์มัลไลเซชัน (1NF)

source: Second step of normalization (1NF+2NF)
th: ขั้นตอนที่สองของการนอร์มัลไลเซชัน (1NF+2NF)

source: Third step of normalization (1NF+2NF+3NF)
th: ขั้นตอนที่สามของการนอร์มัลไลเซชัน (1NF+2NF+3NF)

source: Alter table order by
th: แก้ไขตารางให้เรียงลำดับตาม

source: Table options
th: ตัวเลือกตาราง

source: Rename table to
th: แก้ไขชื่อตารางเป็น

source: Table comments
th: หมายเหตุของตาราง

source: Change all column collations
th: เปลี่ยนการเรียงลำดับคอลัมน์ทั้งหมด

source: Switch to copied table
th: สลับไปที่ตารางที่ถูกทำสำเนาไว้

source: Defragment table
th: จัดระเบียบตาราง

source: Table %s has been flushed.
th: ล้างตาราง %s เรียบร้อยแล้ว

source: Flush the table (FLUSH)
th: ล้างตาราง (FLUSH)

source: Empty the table (TRUNCATE)
th: ลบข้อมูลตาราง (TRUNCATE)

source: View %s has been dropped.
th: มุมมอง %s ถูกลบทิ้งแล้ว

source: Table %s has been dropped.
th: ตาราง %s ถูกลบทิ้งแล้ว

source: Delete the table (DROP)
th: ลบตาราง (DROP)

source: Partition maintenance
th: การบำรุงรักษาพาร์ทิชัน

source: Remove partitioning
th: ลบพาร์ทิชัน

source: Operations
th: การดำเนินงาน

source: Rename view to
th: แก้ไขชื่อมุมมองเป็น

source: Delete the view (DROP)
th: ลบมุมมอง (DROP)

source: Table structure
th: โครงสร้างของตาราง

source: Relation view
th: มุมมองความสัมพันธ์

source: table-specific
th: ตารางเฉพาะ

source: Foreign key constraints
th: ข้อจำกัดคีย์นอก

source: Actions
th: กระทำการ

source: Constraint properties
th: คุณสมบัติข้อจำกัด

source: Creating a foreign key over a non-indexed column would automatically create an index on it. Alternatively, you can define an index below, before creating the foreign key.
th: การสร้างคีย์นอกบนคอลัมน์ที่ยังไม่ได้สร้างดัชนี จะสร้างดัชนีบนคอลัมน์นั้นโดยอัตโนมัติ หรืออีกทางเลือกหนึ่ง คุณสามารถกำหนดดัชนีด้านล่างก่อนที่จะสร้างคีย์นอกได้

source: Only columns with index will be displayed. You can define an index below.
th: แสดงเฉพาะคอลัมน์ที่มีดัชนีเท่านั้น คุณสามารถกำหนดดัชนีได้ด้านล่าง

source: Foreign key constraint
th: ข้อจำกัดคีย์นอก

source: + Add constraint
th: + เพิ่มข้อจำกัด

source: Internal relationships
th: ความสัมพันธ์ภายใน

source: Internal relation
th: ความสัมพันธ์ภายใน

source: An internal relation is not necessary when a corresponding FOREIGN KEY relation exists.
th: ไม่จำเป็นต้องมีความสัมพันธ์ภายในหากมีความสัมพันธ์มี FOREIGN KEY ที่สอดคล้องกันอยู่แล้ว

source: Choose column to display:
th: เลือกคอลัมน์ที่จะแสดง:

source: Foreign key constraint %s has been dropped
th: ข้อจำกัดคีย์นอก %s ถูกลบออกแล้ว

source: Constraint name
th: ชื่อข้อจำกัด

source: Do a "query by example" (wildcard: "%")
th: ใช้ "คำสั่งจากตัวอย่าง" (เครื่องหมายแทน: "%")

source: Select columns (at least one):
th: เลือกคอลัมน์ (อย่างน้อยหนึ่ง):

source: Add search conditions (body of the "where" clause):
th: เพิ่มเงื่อนไขการค้นหา (ส่วนเนื้อหาของคำสั่ง "where"):

source: Number of rows per page
th: จำนวนแถวต่อหน้า

source: Display order:
th: ลำดับการแสดง:

source: Range search
th: ช่วงการค้นหา

source: Minimum value:
th: ค่าต่ำสุด:

source: Maximum value:
th: ค่าสูงสุด:

source: Start row:
th: เริ่มที่แถว:

source: Partitions
th: พาร์ทิชัน

source: No partitioning defined!
th: ไม่ได้การกำหนดพาร์ทิชัน!

source: Partitioned by:
th: พาร์ทิชันโดย:

source: Sub partitioned by:
th: พาร์ทิชันรองโดย:

source: Data length
th: ความยาวข้อมูล

source: Index length
th: ความยาวดัชนี

source: Analyze
th: วิเคราะห์

source: Check
th: ตรวจสอบ

source: Optimize
th: ปรับให้เหมาะสม

source: Rebuild
th: สร้างใหม่

source: Repair
th: ซ่อมแซม

source: Truncate
th: ล้มตาราง

source: Partition table
th: ตารางพาร์ทิชัน

source: Edit partitioning
th: แก้ไขพาร์ทิชัน

source: Extra
th: เพิ่มเติม

# None for default
source: None
th: ไม่มี

source: Change
th: เปลี่ยน

source: Column %s has been dropped.
th: คอลัมน์ %s ถูกลบทิ้งแล้ว

source: More
th: เพิ่มเติม

source: Distinct values
th: ค่าที่แตกต่างกัน

source: Remove from central columns
th: ลบออกจากคอลัมน์ส่วนกลาง

source: Add to central columns
th: เพิ่มเข้าไปในคอลัมน์ส่วนกลาง

source: Move columns
th: ย้ายคอลัมน์

source: Move the columns by dragging them up and down.
th: เลื่อนคอลัมน์โดยการลากขึ้นและลง

source: Edit view
th: แก้ไขมุมมอง

source: Propose table structure
th: โครงสร้างตารางที่เสนอ

source: Normalize
th: นอมอลไลซ์

source: Track view
th: ติดตามมุมมอง

source: Add %s column(s)
th: เพิ่ม %s คอลัมน์

source: at beginning of table
th: ที่จุดเริ่มต้นของตาราง

source: Space usage
th: พื้นที่ที่ใช้

source: Effective
th: มีผล

source: Total
th: รวม

source: Row statistics
th: สถิติของแถว

source: static
th: คงที่

source: dynamic
th: แปรผัน

source: partitioned
th: พาร์ทิชัน

source: Row length
th: ความยาวแถว

source: Row size
th: ขนาดแถว

source: Next autoindex
th: ดัชนีอัตโนมัติถัดไป

source: Delete version
th: เวอร์ชันลบ

source: Activate tracking for %s
th: เปิดใช้การติดตามสำหรับ %s

source: Activate now
th: เปิดใช้งานเลย

source: Deactivate tracking for %s
th: ปิดใช้การติดตามสำหรับ %s

source: Deactivate now
th: ปิดใช้งานเลย

source: Date
th: วันที่

source: Username
th: ชื่อผู้ใช้

source: Do a "query by example" (wildcard: "%") for two different columns
th: ใช้ "คำสั่งจากตัวอย่าง" (เครื่องหมายแทน: "%") สำหรับสองคอลัมน์ที่ต่างกัน

source: Additional search criteria
th: เงื่อนไขการค้นหาเพิ่มเติม

source: Use this column to label each point
th: ใช้คอลัมน์นี้เพื่อติดป้ายกำกับแต่ละจุด

source: Maximum rows to plot
th: จำนวนแถวสูงสุดที่จะพล็อต

source: Browse/Edit the points
th: เรียกดู/แก้ไขคะแนน

source: How to use
th: วิธีการใช้

source: Reset zoom
th: รีเซ็ตการซูม

source: Available media types
th: ประเภทสื่อที่มีให้เลือก

source: Available browser display transformations
th: การแปลงการแสดงผลเบราว์เซอร์ที่มีให้เลือก

# for media type transformation
source: Description
th: รายละเอียด

source: Available input transformations
th: การแปลงข้อมูลอินพุตที่ใช้งานได้

source: Trigger name
th: ชื่อทริกเกอร์

# Trigger action time
source: Time
th: เวลา

source: Event
th: เหตุการณ์

source: Export of trigger %s
th: ส่งออกทริกเกอร์ %s

source: Triggers
th: ทริกเกอร์

source: There are no triggers to display.
th: ไม่มีทริกเกอร์ที่จะแสดง

source: VIEW name
th: ชื่อมุมมอง

source: Column names
th: ชื่อคอลัมน์

source: Error when evaluating: %s
th: เกิดข้อผิดพลาดขณะประเมิน: %s

source: Failed evaluating precondition for rule '%s'.
th: ไม่สามารถประเมินเงื่อนไขเบื้องต้นสำหรับกฎ '%s' ได้

source: Failed calculating value for rule '%s'.
th: คำนวณค่าสำหรับกฎ '%s' ล้มเหลว

source: Failed running test for rule '%s'.
th: การทดสอบกฎ '%s' ล้มเหลว

source: Failed formatting string for rule '%s'.
th: ไม่สามารถที่จะจัดรูปแบบข้อความตามกฎ '%s'

source: per second
th: ต่อวินาที

source: per minute
th: ต่อนาที

source: per hour
th: ต่อชั่วโมง

source: per day
th: ต่อวัน

source: Uptime below one day
th: ระยะเวลาการทำงานต่ำกว่าหนึ่งวัน

source: Uptime is less than 1 day, performance tuning may not be accurate.
th: ระยะเวลาการทำงานต่อเนื่องน้อยกว่า 1 วัน การปรับแต่งประสิทธิภาพอาจไม่แม่นยำ

source: To have more accurate averages it is recommended to let the server run for longer than a day before running this analyzer
th: เพื่อให้ได้ค่าเฉลี่ยที่แม่นยำยิ่งขึ้น แนะนำให้ปล่อยให้เซิร์ฟเวอร์ทำงานนานกว่าหนึ่งวันก่อนเรียกใช้โปรแกรมวิเคราะห์นี้

source: The uptime is only %s
th: เวลาทำงานมีเพียง %s เท่านั้น

source: Questions below 1,000
th: จำนวนคำถามไม่ถึง 1,000

source: Fewer than 1,000 questions have been run against this server. The recommendations may not be accurate.
th: มีคำถามที่ถูกเรียกใช้ผ่านเซิร์ฟเวอร์นี้น้อยกว่า 1,000 คำถาม คำแนะนำอาจไม่แม่นยำ

source: Let the server run for a longer time until it has executed a greater amount of queries.
th: ปล่อยให้เซิร์ฟเวอร์ทำงานต่อไปอีกนานจนกว่าจะประมวลผลคำสั่งค้นหาได้มากขึ้น

source: Current amount of Questions: %s
th: จำนวนคำถามปัจจุบัน: %s

source: Percentage of slow queries
th: ค่าเปอร์เซ็นต์ของคำสั่งที่ทำงานช้า

source: There is a lot of slow queries compared to the overall amount of Queries.
th: มีคำสั่งที่ตอบสนองช้าจำนวนมากเมื่อเทียบกับจำนวนคำสั่งโดยรวม

source: You might want to increase {long_query_time} or optimize the queries listed in the slow query log
th: คุณอาจต้องเพิ่ม {long_query_time} หรือเร่งประสิทธิภาพคำสั่งที่แสดงในข้อมูลบันทึกคำสั่งที่ทำงานช้า

source: The slow query rate should be below 5%%, your value is %s%%.
th: อัตราคำสั่งที่ทำงานช้าควรจะต่ำกว่า 5%% แต่ค่าของคุณอยู่ที่ %s%%

source: Slow query rate
th: อัตราคำสั่งที่ทำงานช้า

source: There is a high percentage of slow queries compared to the server uptime.
th: มีค่าเปอร์เซ็นต์ของคำสั่งที่ทำงานช้าสูงเมื่อเทียบกับเวลาทำงานของเซิร์ฟเวอร์

source: You have a slow query rate of %s per hour, you should have less than 1%% per hour.
th: คุณมีอัตราคำสั่งที่ทำงานช้าอยู่ที่ %s ต่อชั่วโมง ซึ่งค่าของคุณควรจะน้อยกว่า 1%% ต่อชั่วโมง

source: Long query time
th: เวลาคำสั่งที่ทำงานนาน

source: {long_query_time} is set to 10 seconds or more, thus only slow queries that take above 10 seconds are logged.
th: {long_query_time} ถูกตั้งค่าเป็น 10 วินาทีขึ้นไป ดังนั้นจะบันทึกเฉพาะคำสั่งที่ทำงานช้าซึ่งใช้เวลาเกิน 10 วินาทีขึ้นไปเท่านั้น

source: It is suggested to set {long_query_time} to a lower value, depending on your environment. Usually a value of 1-5 seconds is suggested.
th: แนะนำให้ตั้งค่า {long_query_time} เป็นค่าที่ต่ำลง โดยขึ้นอยู่กับสภาพแวดล้อมของคุณ ซึ่งปกติแล้วแนะนำให้ตั้งค่าที่ 1-5 วินาที

source: long_query_time is currently set to %ds.
th: long_query_time ถูกตั้งไว้ที่ %ds

source: Slow query logging
th: การบันทึกคำสั่งที่ช้า

source: The slow query log is disabled.
th: slow_query_log ถูกปิดการใช้งานแล้ว

source: Enable slow query logging by setting {log_slow_queries} to 'ON'. This will help troubleshooting badly performing queries.
th: เปิดใช้งานบันทึก log slow query โดยตั้งค่า {log_slow_queries} เป็น 'ON' เพื่อช่วยวิเคราะห์คำสั่งที่ทำงานช้า

source: log_slow_queries is set to 'OFF'
th: log_slow_queries ถูกตั้งเป็น 'OFF'

source: Enable slow query logging by setting {slow_query_log} to 'ON'. This will help troubleshooting badly performing queries.
th: เปิดใช้งานบันทึก Log slow query โดยตั้งค่า {slow_query_log} เป็น 'เปิด'. เพื่อช่วยวิเคราะห์คำสั่งที่ทำงานช้า

source: slow_query_log is set to 'OFF'
th: slow_query_log ถูกตั้งเป็น 'OFF'

source: Release Series
th: ชุดที่เผยแพร่

source: The MySQL server version less than 5.1.
th: เวอร์ชันเซิร์ฟเวอร์ MySQL ต่ำกว่า 5.1

source: You should upgrade, as MySQL 5.1 has improved performance, and MySQL 5.5 even more so.
th: คุณควรทำการอัปเกรด เนื่องจาก MySQL 5.1 มีประสิทธิภาพที่ดีขึ้น และ MySQL 5.5 มีประสิทธิภาพดียิ่งขึ้นไปอีก

source: Current version: %s
th: เวอร์ชันปัจจุบัน: %s

source: Minor Version
th: เวอร์ชันย่อย

source: Version less than 5.1.30 (the first GA release of 5.1).
th: เวอร์ชันต่ำกว่า 5.1.30 (เวอร์ชัน GA แรกของ 5.1)

source: You should upgrade, as recent versions of MySQL 5.1 have improved performance and MySQL 5.5 even more so.
th: คุณควรทำการอัปเกรด เนื่องจาก MySQL เวอร์ชันล่าสุด 5.1 มีประสิทธิภาพที่ดีขึ้น และ MySQL 5.5 มีประสิทธิภาพดียิ่งขึ้นไปอีก

source: Version less than 5.5.8 (the first GA release of 5.5).
th: เวอร์ชันต่ำกว่า 5.5.8 (เวอร์ชัน GA แรกของ 5.5)

source: You should upgrade, to a stable version of MySQL 5.5.
th: คุณควรอัปเกรดเป็น MySQL เวอร์ชัน 5.5 ที่เสถียร

source: Distribution
th: ชุดเผยแพร่อื่น

source: Version is compiled from source, not a MySQL official binary.
th: เวอร์ชันนี้คอมไพล์จากต้นฉบับ ไม่ใช่ไฟล์ไบนารีอย่างเป็นทางการของ MySQL

source: If you did not compile from source, you may be using a package modified by a distribution. The MySQL manual only is accurate for official MySQL binaries, not any package distributions (such as RedHat, Debian/Ubuntu etc).
th: หากคุณไม่ได้คอมไพล์จากต้นฉบับ คุณอาจกำลังใช้แพ็กเกจที่ถูกดัดแปลงโดยชุดเผยแพร่อื่น คู่มือ MySQL นั้นถูกต้องเฉพาะกับไบนารี MySQL อย่างเป็นทางการเท่านั้น ไม่ใช่แพ็กเกจจากชุดเผยแพร่อื่น (เช่น RedHat, Debian/Ubuntu เป็นต้น)

source: 'source' found in version_comment
th: ตรวจพบคำว่า 'source' ใน version_comment

source: The MySQL manual only is accurate for official MySQL binaries.
th: คู่มือ MySQL มีความถูกต้องเฉพาะสำหรับ MySQL ที่ติดตั้งจากแพ็กเกจอย่างเป็นทางการเท่านั้น

source: Percona documentation is at <a href="https://www.percona.com/software/documentation/">https://www.percona.com/software/documentation/</a>
th: เอกสารประกอบของ Percona สามารถดูได้ที่ <a href="https://www.percona.com/software/documentation/">https://www.percona.com/software/documentation/</a>

source: 'percona' found in version_comment
th: ตรวจพบคำว่า 'percona' ใน version_comment

source: MySQL Architecture
th: สถาปัตยกรรม MySQL

source: MySQL is not compiled as a 64-bit package.
th: MySQL ไม่ได้ถูกคอมไพล์เป็นแพ็กเกจแบบ 64 บิต

source: Your memory capacity is above 3 GiB (assuming the Server is on localhost), so MySQL might not be able to access all of your memory. You might want to consider installing the 64-bit version of MySQL.
th: ความจุหน่วยความจำของคุณมากกว่า 3 GiB (โดยสมมติว่าเซิร์ฟเวอร์อยู่บน localhost) ดังนั้น MySQL อาจไม่สามารถเข้าถึงหน่วยความจำทั้งหมดของคุณได้ คุณอาจต้องพิจารณาติดตั้ง MySQL เวอร์ชัน 64 บิต

source: Available memory on this host: %s
th: หน่วยความจำที่ใช้ได้บนโฮสต์นี้: %s

source: Query caching method
th: วิธีการแคชคำสั่ง

source: Suboptimal caching method.
th: วิธีการแคชข้อมูลที่ไม่เหมาะสม

source: You are using the MySQL Query cache with a fairly high traffic database. It might be worth considering to use <a href="https://dev.mysql.com/doc/refman/5.6/en/ha-memcached.html">memcached</a> instead of the MySQL Query cache, especially if you have multiple replicas.
th: คุณกำลังใช้ MySQL Query cache กับฐานข้อมูลที่มีปริมาณการใช้งาน (traffic)ค่อนข้างสูง อาจคุ้มค่าที่จะพิจารณาใช้ <a href="https://dev.mysql.com/doc/refman/5.6/en/ha-memcached.html">memcached</a> แทนการใช้ MySQL Query cache โดยเฉพาะหากคุณมี replica (เซิร์ฟเวอร์สำรอง) หลายตัว

source: The query cache is enabled and the server receives %d queries per second. This rule fires if there is more than 100 queries per second.
th: แคชคำสั่งถูกเปิดใช้งาน และเซิร์ฟเวอร์รับคำสั่งจำนวน %d ครั้งต่อวินาที กฎนี้จะทำงานหากมีคำสั่งมากกว่า 100 ครั้งต่อวินาที

source: Percentage of sorts that cause temporary tables
th: เปอร์เซ็นต์ของการเรียงลำดับที่ทำให้เกิดตารางชั่วคราว

source: Too many sorts are causing temporary tables.
th: การเรียงลำดับมากเกินไปทำให้เกิดตารางชั่วคราว

source: Consider increasing {sort_buffer_size} and/or {read_rnd_buffer_size}, depending on your system memory limits.
th: ควรพิจารณาเพิ่มขนาด {sort_buffer_size} และ/หรือ {read_rnd_buffer_size} ขึ้นอยู่กับข้อจำกัดของหน่วยความจำในระบบของคุณ

source: %s%% of all sorts cause temporary tables, this value should be lower than 10%%.
th: %s%% ทุกประเภททำให้เกิดตารางชั่วคราว ค่านี้ควรต่ำกว่า 10%%

source: Rate of sorts that cause temporary tables
th: อัตราการเรียงลำดับที่ทำให้เกิดตารางชั่วคราว

source: Temporary tables average: %s, this value should be less than 1 per hour.
th: ตารางชั่วคราวโดยเฉลี่ย: %s ค่านี้ควรน้อยกว่า 1 ต่อชั่วโมง

source: Sort rows
th: เรียงลำดับแถว

source: There are lots of rows being sorted.
th: มีการจัดเรียงข้อมูลหลายแถว

source: While there is nothing wrong with a high amount of row sorting, you might want to make sure that the queries which require a lot of sorting use indexed columns in the ORDER BY clause, as this will result in much faster sorting.
th: แม้ว่าการเรียงลำดับแถวจำนวนมากจะไม่ใช่เรื่องผิดอะไร แต่คุณอาจต้องการตรวจสอบให้แน่ใจว่าคำสั่งที่ต้องการการเรียงลำดับจำนวนมากนั้นใช้คอลัมน์ที่มีดัชนีในส่วน ORDER BY เนื่องจากจะทำให้การเรียงลำดับเร็วขึ้นมาก

source: Sorted rows average: %s
th: ค่าเฉลี่ยของแถวที่เรียงลำดับ: %s

source: Rate of joins without indexes
th: อัตราการร่วมกันโดยปราศจากดัชนี

source: There are too many joins without indexes.
th: มีการร่วมกันมากเกินไปโดยไม่ปราศจากดัชนี

source: This means that joins are doing full table scans. Adding indexes for the columns being used in the join conditions will greatly speed up table joins.
th: นั่นหมายความว่าการร่วมกันจะทำการสแกนตารางทั้งหมด การเพิ่มดัชนีสำหรับคอลัมน์ที่ใช้ในเงื่อนไขการเชื่อมตารางจะช่วยเพิ่มความเร็วในการเชื่อมตารางได้อย่างมาก

source: Table joins average: %s, this value should be less than 1 per hour
th: ค่าเฉลี่ยของการเชื่อมตาราง: %s ค่านี้ควรน้อยกว่า 1 ต่อชั่วโมง

source: Rate of reading first index entry
th: อัตราการอ่านรายการดัชนีแรก

source: The rate of reading the first index entry is high.
th: อัตราการอ่านรายการดัชนีแรกนั้นสูง

source: This usually indicates frequent full index scans. Full index scans are faster than table scans but require lots of CPU cycles in big tables, if those tables that have or had high volumes of UPDATEs and DELETEs, running 'OPTIMIZE TABLE' might reduce the amount of and/or speed up full index scans. Other than that full index scans can only be reduced by rewriting queries.
th: โดยปกติแล้ว นี่บ่งชี้ว่ามีการสแกนดัชนีเต็มรูปแบบบ่อยครั้ง การสแกนดัชนีแบบเต็มรูปแบบเร็วกว่าการสแกนตาราง แต่ต้องใช้รอบการทำงานของ CPU จำนวนมากในตารางขนาดใหญ่ หากตารางเหล่านั้นมีการ UPDATE และ DELETE ข้อมูลจำนวนมาก การเรียกใช้ 'OPTIMIZE TABLE' อาจช่วยลดปริมาณและ/หรือเพิ่มความเร็วในการสแกนดัชนีแบบเต็มรูปแบบได้ นอกเหนือจากนั้น การสแกนดัชนีแบบเต็มรูปแบบสามารถลดลงได้โดยการเขียนคำสั่ง SQL ใหม่เท่านั้น

source: Index scans average: %s, this value should be less than 1 per hour
th: การสแกนดัชนีโดยเฉลี่ย: %s ค่านี้ควรน้อยกว่า 1 ครั้งต่อชั่วโมง

source: Rate of reading fixed position
th: อัตราการอ่านตำแหน่งคงที่

source: The rate of reading data from a fixed position is high.
th: อัตราการอ่านข้อมูลจากตำแหน่งคงที่นั้นสูง

source: This indicates that many queries need to sort results and/or do a full table scan, including join queries that do not use indexes. Add indexes where applicable.
th: นี่แสดงว่าคำสั่งจำนวนมากจำเป็นต้องจัดเรียงผลลัพธ์และ/หรือทำการสแกนตารางเต็มรูปแบบ รวมถึงคำสั่งการเชื่อมต่อที่ไม่ใช้ดัชนี โปรดเพิ่มดัชนีในกรณีที่จำเป็น

source: Rate of reading fixed position average: %s, this value should be less than 1 per hour
th: อัตราการอ่านตำแหน่งคงที่โดยเฉลี่ย: %s ค่านี้ควรน้อยกว่า 1 ครั้งต่อชั่วโมง

source: Rate of reading next table row
th: อัตราการอ่านแถวถัดไปของตาราง

source: The rate of reading the next table row is high.
th: อัตราการอ่านแถวถัดไปในตารางนั้นสูง

source: This indicates that many queries are doing full table scans. Add indexes where applicable.
th: นี่แสดงว่ามีคำสั่งจำนวนมากที่ทำการสแกนตารางเต็มรูปแบบ ควรเพิ่มดัชนีในกรณีที่จำเป็น

source: Rate of reading next table row: %s, this value should be less than 1 per hour
th: อัตราการอ่านแถวถัดไปในตาราง: %s ค่านี้ควรน้อยกว่า 1 ต่อชั่วโมง

source: Different tmp_table_size and max_heap_table_size
th: tmp_table_size และ max_heap_table_size ที่แตกต่างกัน

source: {tmp_table_size} and {max_heap_table_size} are not the same.
th: {tmp_table_size} และ {max_heap_table_size} ไม่เหมือนกัน

source: If you have deliberately changed one of either: The server uses the lower value of either to determine the maximum size of in-memory tables. So if you wish to increase the in-memory table limit you will have to increase the other value as well.
th: หากคุณจงใจเปลี่ยนแปลงค่าใดค่าหนึ่ง: เซิร์ฟเวอร์จะใช้ค่าที่ต่ำกว่าในการกำหนดขนาดสูงสุดของตารางในหน่วยความจำ ดังนั้นหากคุณต้องการเพิ่มขีดจำกัดของตารางในหน่วยความจำ คุณจะต้องเพิ่มค่าอีกค่าหนึ่งด้วยเช่นกัน

source: Current values are tmp_table_size: %s, max_heap_table_size: %s
th: ค่าปัจจุบันคือ tmp_table_size: %s, max_heap_table_size: %s

source: Percentage of temp tables on disk
th: เปอร์เซ็นต์ของตารางชั่วคราวบนดิสก์

source: Many temporary tables are being written to disk instead of being kept in memory.
th: ตารางชั่วคราวจำนวนมากถูกเขียนลงดิสก์แทนที่จะเก็บไว้ในหน่วยความจำ

source: Increasing {max_heap_table_size} and {tmp_table_size} might help. However some temporary tables are always being written to disk, independent of the value of these variables. To eliminate these you will have to rewrite your queries to avoid those conditions (Within a temporary table: Presence of a BLOB or TEXT column or presence of a column bigger than 512 bytes) as mentioned in the beginning of an <a href="https://www.facebook.com/note.php?note_id=10150111255065841&comments">Article by the Pythian Group</a>
th: การเพิ่มค่า {max_heap_table_size} และ {tmp_table_size} อาจช่วยได้ อย่างไรก็ตาม บางตารางชั่วคราวจะถูกเขียนลงดิสก์เสมอ โดยไม่ขึ้นอยู่กับค่าของตัวแปรเหล่านี้ ในการกำจัดตารางชั่วคราวเหล่านี้ คุณจำเป็นต้องเขียนคำสั่งใหม่เพื่อหลีกเลี่ยงเงื่อนไขเหล่านั้น (ภายในตารางชั่วคราว: การมีคอลัมน์ BLOB หรือ TEXT หรือการมีคอลัมน์ที่มีขนาดใหญ่กว่า 512 ไบต์) ดังที่กล่าวไว้ในตอนต้นของ <a href="https://www.facebook.com/note.php?note_id=10150111255065841&comments">บทความโดยกลุ่ม Pythian</a>

source: %s%% of all temporary tables are being written to disk, this value should be below 25%%
th: %s%% ของตารางชั่วคราวทั้งหมดถูกเขียนลงดิสก์ ค่านี้ควรต่ำกว่า 25%%

source: Temp disk rate
th: อัตราดิสก์ชั่วคราว
