Repository: phpmyadmin/phpmyadmin
Catalog: resources/po/*.po
Languages: th

source: Incorrect format parameter
th: พารามิเตอร์รูปแบบไม่ถูกต้อง

source: Showing bookmark
th: แสดงบุ๊กมาร์ก

source: The bookmark has been deleted.
th: บุ๊กมาร์กถูกลบแล้ว

source: No data was received to import. Either no file name was submitted, or the file size exceeded the maximum size permitted by your PHP configuration. See [doc@faq1-16]FAQ 1.16[/doc].
th: ไม่ได้รับข้อมูลที่จะนำเข้า อีกทั้งไม่มีชื่อไฟล์ด้วย หรือไฟล์มีขนาดใหญ่เกินกว่าการอนุญาตสูงสุดตามการกำหนดค่า PHP ของคุณ ดู [doc@faq1-16]FAQ 1.16[/doc]

source: Import has been successfully finished, %d query executed.
th: การนำเข้าเรียบร้อย %d การเรียกดูดำเนินการแล้ว

source: Script timeout passed, if you want to finish import, please %sresubmit the same file%s and import will resume.
th: สคริปต์หมดเวลาแล้ว หากคุณต้องการนำเข้าให้เสร็จ กรุณา %sresubmit the same file%s และการนำเข้าจะดำเนินการต่อให้

source: However on last run no data has been parsed, this usually means phpMyAdmin won't be able to finish this import unless you increase php time limits.
th: อย่างไรก็ตามจากการรันครั้งล่าสุดไม่มีการแยกวิเคราะห์ข้อมูล ซึ่งโดยปกติจะหมายความว่า phpMyAdmin จะไม่สามารถดำเนินการนำเข้านี้ให้เสร็จสิ้นได้ เว้นแต่คุณจะเพิ่มขีดจำกัดเวลาของ php

source: "DROP DATABASE" statements are disabled.
th: คำสั่ง "DROP DATABASE" ถูกปิดไว้

source: [ROLLBACK occurred.]
th: [เกิดการย้อนกลับ]

source: Only single-table UPDATE and DELETE queries can be simulated.
th: สามารถจำลองได้เฉพาะคำสั่ง UPDATE และ DELETE ที่ทำงานกับตารางเดียวเท่านั้น

source: Could not load the progress of the import.
th: ไม่สามารถโหลดข้อมูลความคืบหน้าของการนำเข้าได้

source: Do you really want to execute "%s"?
th: คุณต้องการดำเนินการ "%s" จริงหรือไม่?

source: You are about to DESTROY a complete database!
th: คุณกำลังจะใช้คำสั่ง DESTROY ฐานข้อมูลโดยสมบูรณ์!

source: Cannot rename database to the same name. Change the name and try again.
th: ไม่สามารถแก้ไขชื่อฐานข้อมูลเป็นชื่อเดิมได้ โปรดเปลี่ยนชื่อแล้วลองใหม่อีกครั้ง

source: You are about to DESTROY a complete table!
th: คุณกำลังจะใช้คำสั่ง DESTROY ตารางโดยสมบูรณ์!

source: You are about to TRUNCATE a complete table!
th: คุณกำลังจะใช้คำสั่ง TRUNCATE ตารางโดยสมบูรณ์!

source: You are about to DELETE all the rows of the table!
th: คุณกำลังจะลบแถวทั้งหมดในตาราง!

source: Delete tracking data for this table?
th: ลบข้อมูลการติดตามของตารางนี้?

source: Delete tracking data for these tables?
th: ลบข้อมูลการติดตามของตารางเหล่านี้?

source: Delete tracking data for this version?
th: ลบข้อมูลการติดตามของเวอร์ชันนี้?

source: Delete tracking data for these versions?
th: ลบข้อมูลการติดตามของเวอร์ชันเหล่านี้?

source: Delete entry from tracking report?
th: ลบรายการออกจากรายงานการติดตาม?

source: Deleting tracking data
th: กำลังลบข้อมูลการติดตาม

source: Dropping Primary Key/Index
th: กำลังใช้คำสั่ง Drop คีย์หลัก/ดัชนี

source: Dropping Foreign key.
th: กำลังใช้คำสั่ง Drop คีย์นอก

source: Do you really want to delete user group "%s"?
th: คุณต้องการลบกลุ่มผู้ใช้ "%s" ใช่หรือไม่?

source: You have unsaved changes; are you sure you want to leave this page?
th: คุณมีการเปลี่ยนแปลงข้อมูลที่ยังไม่ได้บันทึก; คุณต้องการออกจากหน้านี้ใช่หรือไม่?

source: You are trying to reduce the number of rows, but have already entered data in those rows which will be lost. Do you wish to continue?
th: คุณกำลังพยายามลดจำนวนแถว แต่ได้มีการป้อนข้อมูลไปแล้ว ซึ่งข้อมูลเหล่านั้นจะหายไป คุณต้องการดำเนินการต่อหรือไม่?

source: Do you really want to revoke the selected user(s) ?
th: คุณต้องการยกเลิกสิทธิ์ของผู้ใช้ที่เลือกไว้ใช่หรือไม่?

source: Do you really want to delete this central column?
th: คุณต้องการลบคอลัมน์ส่วนกลางนี้ใช่หรือไม่?

source: Do you really want to delete the selected items?
th: คุณต้องการลบรายการที่เลือกไว้ใช่หรือไม่?

source: Do you really want to DROP the selected partition(s)? This will also DELETE the data related to the selected partition(s)!
th: คุณต้องการใช้คำสั่ง DROP พาร์ติชันที่เลือกไว้ใช่หรือไม่? นี่จะเป็นการลบข้อมูลที่เกี่ยวข้องกับพาร์ติชันที่เลือกไว้ออกไปด้วย!

source: Do you really want to TRUNCATE the selected partition(s)?
th: คุณต้องการใช้คำสั่ง TRUNCATE ในพาร์ติชั่นที่เลือกไว้ใช่หรือไม่?

source: Do you really want to remove partitioning?
th: คุณต้องการลบพาร์ติชั่นออกใช่หรือไม่?

source: Do you really want to reset the replica (RESET REPLICA)?
th: คุณต้องการรีเซ็ตสำเนา (RESET REPLICA) จริง ๆ หรือไม่?

source: This operation will attempt to convert your data to the new collation. In rare cases, especially where a character doesn't exist in the new collation, this process could cause the data to appear incorrectly under the new collation; in this case we suggest you revert to the original collation and refer to the tips at
th: การดำเนินการนี้เป็นการพยายามแปลงข้อมูลของคุณให้อยู่ในชุดเทียบเคียงอักษรใหม่ ในบางกรณีที่พบได้ยาก โดยเฉพาะอย่างยิ่งอักขระที่ไม่มีอยู่ในชุดเทียบเคียงอักษรใหม่ กระบวนการนี้อาจเป็นสาเหตุทำให้การแสดงผลข้อมูลไม่ถูกต้องภายใต้ชุดเทียบเคียงอักษรใหม่; ในกรณีเช่นนี้ เราแนะนำให้คุณแปลงกลับไปเป็นชุดเทียบเคึยงอักษระเดิมและโปรดดูคำแนะนำที่

source: Garbled Data
th: ข้อมูลที่ผิดเพี้ยนไป

source: Are you sure you wish to change the collation and convert the data?
th: คุณแน่ใจหรือว่าต้องการเปลี่ยนชุดเทียบเคียงอักษรและแปลงข้อมูล?

source: Through this operation, MySQL attempts to map the data values between collations. If the character sets are incompatible, there may be data loss and this lost data may <b>NOT</b> be recoverable simply by changing back the column collation(s). <b>To convert existing data, it is suggested to use the column(s) editing feature (the "Change" Link) on the table structure page. </b>
th: ในการดำเนินการนี้ MySQL พยายามจับคู่ค่าข้อมูลระหว่างชุดเทียบเคียงอักษร หากชุดอักขระไม่เข้ากัน อาจเกิดการสูญหายของข้อมูล และข้อมูลที่สูญหายนั้นอาจ <b>ไม่สามารถ</b> กู้คืนได้ง่ายดายโดยการเปลี่ยนชุดเทียบเคียงของคอลัมน์กลับ <b>ในการแปลงข้อมูลที่มีอยู่ ขอแนะนำให้ใช้คุณสมบัติการแก้ไขคอลัมน์ (ลิงก์ "เปลี่ยน") ในหน้าโครงสร้างตาราง</b>

source: Are you sure you wish to change all the column collations and convert the data?
th: คุณแน่ใจหรือว่าต้องการเปลี่ยนคอลัมน์ชุดเทียบเคียงอักษรทั้งหมดและแปลงข้อมูล?

source: Reset all
th: รีเซ็ตทั้งหมด

source: Missing value in the form!
th: ข้อมูลในแบบฟอร์มขาดหาย!

source: Select at least one of the options!
th: เลือกอย่างน้อยหนึ่งตัวเลือก!

source: Please enter a valid number!
th: กรุณากรอกตัวเลขที่ถูกต้อง!

source: Please enter a valid length!
th: กรุณากรอกความยาวที่ถูกต้อง!

source: Add index
th: เพิ่มดัชนี

source: Edit index
th: แก้ไขดัชนี

source: Rename index
th: แก้ไขชื่อดัชนี

source: Create single-column index
th: สร้างดัชนีชนิดหนึ่งคอลัมน์

source: Create composite index
th: สร้างดัชนีผสม

source: Composite with:
th: ผสมกับ:

source: Please select column(s) for the index.
th: โปรดเลือกคอลัมน์ให้กับดัชนี

source: Y values
th: ค่าแกน Y

source: Please enter the SQL query first.
th: กรุณากรอกคำสั่ง SQL ก่อน

source: The host name is empty!
th: ชื่อโฮสต์ว่างเปล่า!

source: The user name is empty!
th: ชื่อผู้ใช้ว่างเปล่า!

source: The password is empty!
th: รหัสผ่านว่างเปล่า!

source: The passwords aren't the same!
th: รหัสผ่านไม่ตรงกัน!

source: You are trying to set this account to log in with no password, but the configuration directive <code>AllowNoPassword</code> is false. If you proceed, the account will not be able to log in through phpMyAdmin.
th: คุณกำลังพยายามตั้งค่าบัญชีนี้ให้เข้าสู่ระบบโดยไม่ต้องใช้รหัสผ่าน แต่คำสั่งการกำหนดค่า <code>AllowNoPassword</code> เป็น false หากคุณดำเนินการต่อ บัญชีจะไม่สามารถเข้าสู่ระบบผ่าน phpMyAdmin ได้

source: Removing Selected Users
th: กำลังลบผู้ใช้ที่เลือกออก

source: Template was created.
th: แม่แบบถูกสร้างขึ้นแล้ว

source: Template was loaded.
th: โหลดแม่แบบแล้ว

source: Template was updated.
th: อัปเดตแม่แบบแล้ว

source: Template was deleted.
th: แม่แบบถูกลบออกแล้ว

source: Other
th: อื่นๆ

source: Connections / Processes
th: การเชื่อมต่อ / กระบวนการ

source: Number of statements
th: จำนวนข้อความ

source: Query cache efficiency
th: ประสิทธิภาพของแคชคำสั่งเรียกดู

source: Query cache usage
th: การใช้งานแคชคำสั่งเรียกดู

source: Query cache used
th: ใช้แคชคำสั่งเรียกดูแล้ว

source: System CPU usage
th: การใช้งาน CPU ของระบบ

source: System memory
th: หน่วยความจำของระบบ

source: System swap
th: การสลับระบบ

source: Average load
th: เฉลี่ยการทำงาน

source: Total memory
th: จำนวนหน่วยความจำรวม

source: Cached memory
th: หน่วยความจำแคชที่ใช้

source: Buffered memory
th: หน่วยความจำบัฟเฟอร์

source: Free memory
th: หน่วยความจำว่าง

source: Used memory
th: หน่วยความจำที่ใช้ไป

source: Total swap
th: จำนวนการสลับทั้งหมด

source: Cached swap
th: การสลับที่ถูกแคช

source: Used swap
th: การสลับที่ใช้ไป

source: Free swap
th: การสลับที่ว่าง

source: Bytes sent
th: ไบต์ที่ส่ง

source: Bytes received
th: ไบต์ที่รับ

source: B
th: ไบต์

source: GiB
th: กิกะไบต์

source: TiB
th: เทราไบต์

source: PiB
th: เพตาไบต์

source: EiB
th: เอ็กซ์บิไบต์

source: %d table(s)
th: %d ตาราง

source: Questions
th: คำถาม

source: Please add at least one variable to the series!
th: กรุณาเพิ่มค่าตัวแปรอย่างน้อยหนึ่งตัวเข้าไปในลำดับ!

source: SQL Query
th: คำสั่ง SQL

source: Resume monitor
th: ทำการมอนิเตอร์ต่อ

source: Pause monitor
th: หยุดการมอนิเตอร์ชั่วคราว

source: Stop auto refresh
th: หยุดการรีเฟรชอัตโนมัติ

source: general_log and slow_query_log are enabled.
th: general_log และ slow_query_log เปิดการใช้งานไว้

source: general_log is enabled.
th: general_log เปิดการใช้งานไว้

source: slow_query_log is enabled.
th: slow_query_log เปิดการใช้งานไว้

source: slow_query_log and general_log are disabled.
th: general_log และ slow_query_log ปิดการใช้งานไว้

source: log_output is not set to TABLE.
th: log_output ไม่ได้ถูกตั้งไว้กับตาราง

source: log_output is set to TABLE.
th: log_output ถูกตั้งกับไว้ตาราง

source: slow_query_log is enabled, but the server logs only queries that take longer than %d seconds. It is advisable to set this long_query_time 0-2 seconds, depending on your system.
th: slow_query_log เปิดการใช้งานไว้ แต่เซิร์ฟเวอร์บันทึกประวัติเพียงคำสั่ง SQL เท่านั้นซึ่งใช้เวลานานกว่า %d วินาที ขอแนะนำให้ตั้งค่า long_query_time ไว้ที่ 0-2 วินาที โดยขึ้นอยู่กับระบบของท่าน

source: long_query_time is set to %d second(s).
th: long_query_time ถูกตั้งไว้ที่ %d วินาที

source: Following settings will be applied globally and reset to default on server restart:
th: การตั้งค่าต่อไปนี้จะถูกนำไปใช้ทั้งระบบ และจะตั้งเป็นค่าเริ่มต้นเมื่อรีสตาร์ทเซิร์ฟเวอร์:

source: Set log_output to %s
th: ตั้ง log_output เป็น %s

source: Enable %s
th: เปิดใช้ %s

source: Disable %s
th: ปิดใช้งาน %s

source: Set long_query_time to %d seconds.
th: ตั้ง long_query_time เป็น %d วินาที

source: You can't change these variables. Please log in as root or contact your database administrator.
th: คุณไม่สามารถเปลี่ยนแปลงค่าเหล่านี้ได้ กรุณาลงชื่อเข้าใช้งานเป็น root หรือติดต่อผู้ดูแลระบบฐานข้อมูล

source: Change settings
th: เปลี่ยนแปลงการตั้งค่า

source: Current settings
th: การตั้งค่าปัจจุบัน

source: Chart title
th: ชื่อแผนภูมิ

source: Differential
th: ความแตกต่าง

source: Divided by %s
th: ถูกหารด้วย %s

source: Unit
th: หน่วย

source: The database name is not known for this query in the server's logs.
th: ไม่พบชื่อฐานข้อมูลสำหรับคำสั่งเรียกดูนี้ในบันทึกของเซิร์ฟเวอร์

source: This column shows the amount of identical queries that are grouped together. However only the SQL query itself has been used as a grouping criteria, so the other attributes of queries, such as start time, may differ.
th: คอลัมน์นี้แสดงจำนวนของคำสั่งเรียกดูที่เหมือนกันซึ่งถูกจัดกลุ่มเข้าด้วยกัน อย่างไรก็ตาม เกณฑ์การจัดกลุ่มใช้เฉพาะคำสั่ง SQL เท่านั้น ดังนั้น คุณลักษณะอื่น ๆ ของคำสั่งเรียกดู เช่น เวลาเริ่มต้น อาจแตกต่างกันได้

source: Since grouping of INSERTs queries has been selected, INSERT queries into the same table are also being grouped together, disregarding of the inserted data.
th: เมื่อได้การจัดกลุ่มคำสั่ง INSERT ถูกเลือกแล้ว คำสั่ง INSERT ที่แทรกเข้าไปในตารางเดียวกันจึงถูกจัดกลุ่มเข้าด้วยกัน โดยไม่คำนึงถึงข้อมูลที่แทรกเข้าไป

source: Analyzing…
th: กำลังวิเคราะห์…

source: Explain output
th: อธิบายเอาท์พุต

source: Total time:
th: เวลารวม:

source: Profiling results
th: ผลการวิเคราะห์ข้อมูล

# Display format
source: Table
th: ตาราง

source: Chart
th: แผนภูมิ

source: Log table filter options
th: ตัวเลือกบันทึกการกรองตาราง

source: Filter
th: ตัวกรอง

source: Filter queries by word/regexp:
th: ตัวกรองคำสั่งเรียกดูด้วยคำหรือ regexp:

source: Group queries, ignoring variable data in WHERE clauses
th: กลุ่มคำสั่งเรียกดู ไม่สนใจข้อมูลตัวแปรในประโยค WHERE

source: Sum of grouped rows:
th: ผลรวมของแถวที่จัดกลุ่ม:

source: Affected rows:
th: แถวที่มีผล:

source: Failed parsing config file. It doesn't seem to be valid JSON code.
th: การวิเคราะห์ไฟล์การกำหนดค่าล้มเหลว ดูเหมือนว่าไม่ใช่โค้ด JSON ที่ถูกต้อง

source: Failed building chart grid with imported config. Resetting to default config…
th: การสร้างตารางแผนภูมิด้วยการตั้งค่าที่นำเข้าล้มเหลว ระบบจะรีเซ็ตเป็นการตั้งค่าเริ่มต้น…

source: Please enter a valid table name.
th: กรุณากรอกชื่อตารางที่ถูกต้อง

source: Please enter a valid database name.
th: กรุณากรอกชื่อฐานข้อมูลที่ถูกต้อง

source: No files available on server for import!
th: ไม่มีไฟล์ที่ใช้งานได้บนเซิร์ฟเวอร์ที่จะนำเข้า!

source: Formatting SQL…
th: กำลังจัดรูปแบบ SQL …

source: No parameters found!
th: ไม่พบพารามิเตอร์!

source: Request aborted!!
th: การร้องขอถูกยกเลิก!!

source: Processing request
th: ร้องขอการประมวลผล

source: Request failed!!
th: การร้องขอล้มเหลว!!

source: Error in processing request
th: ข้อผิดพลาดในการร้องขอการประมวลผล

source: Error code: %s
th: รหัสข้อผิดพลาด: %s

source: Error text: %s
th: ข้อความข้อผิดพลาด: %s

source: It seems that the connection to server has been lost. Please check your network connectivity and server status.
th: ดูเหมือนว่าการเชื่อมต่อกับเซิร์ฟเวอร์ได้สูญหายไป กรุณาตรวจสอบการเชื่อมต่อเครือข่ายและสถานะของเซิร์ฟเวอร์

source: No accounts selected.
th: ไม่ได้เลือกบัญชี

source: Dropping column
th: กำลังลบคอลัมน์

source: Adding primary key
th: กำลังเพิ่มคีย์หลัก

source: Click to dismiss this notification
th: กดเพื่อยกเลิกการแจ้งเตือนนี้

source: Renaming databases
th: กำลังเแก้ไขชื่อฐานข้อมูล

source: Copying database
th: กำลังคัดลอกฐานข้อมูล

source: Changing charset
th: กำลังเปลี่ยนชุดตัวอักษร

source: Failed to get real row count.
th: ไม่สามารถนับจำนวนแถวที่แท้จริงได้

source: Searching
th: กำลังค้นหา

source: Hide search results
th: ซ่อนผลการค้นหา

source: Show search results
th: แสดงผลการค้นหา

source: Browsing
th: การเรียกดู

source: Deleting
th: กำลังลบ

source: Delete the matches for the %s table?
th: ลบข้อมูลที่ตรงกันในตาราง %s หรือไม่?

source: The definition of a stored function must contain a RETURN statement!
th: นิยามของฟังก์ชันที่จัดเก็บไว้จะต้องมีคำสั่ง RETURN อยู่ด้วย!

source: No routine is exportable. Required privileges may be lacking.
th: ไม่สามารถส่งออกขั้นตอนการทำงานใด ๆ ได้ อาจขาดสิทธิ์ที่จำเป็น

source: Trigger
th: ทริกเกอร์

source: Values for column %s
th: ค่าสำหรับคอลัมน์ %s

source: Values for a new column
th: ค่าสำหรับคอลัมน์ใหม่

source: Enter each value in a separate field.
th: ป้อนแต่ละค่าลงในช่องแยกกัน

source: Add %d value(s)
th: เพิ่มค่า %d

source: Note: If the file contains multiple tables, they will be combined into one.
th: หมายเหตุ: หากไฟล์มีหลายตาราง มันจะถูกรวมเข้าด้วยกัน

source: Hide query box
th: ซ่อนช่องระบุ SQL

source: Show query box
th: แสดงช่องระบุ SQL

source: Edit query
th: แก้ไขคำสั่ง

source: %d is not valid row number.
th: ﻿%d ไม่ใช่หมายเลขแถวที่ถูกต้อง

source: Variable %d:
th: ตัวแปร %d:

source: Pick
th: เลือก

source: Column selector
th: ตัวเลือกคอลัมน์

source: Search this list
th: ค้นหารายการนี้

source: No columns in the central list. Make sure the Central columns list for database %s has columns that are not present in the current table.
th: ไม่มีคอลัมน์ในรายการส่วนกลาง ตรวจสอบให้แน่ใจว่ารายการคอลัมน์ส่วนกลางสำหรับฐานข่อมูล %s มีคอลัมน์ที่ไม่มีอยู่ในตารางปัจจุบัน

source: See more
th: ดูเพิ่มเติม

source: Add primary key
th: เพิ่มคีย์หลัก

source: Primary key added.
th: เพิ่มคีย์หลักแล้ว

source: Taking you to next step…
th: กำลังพาคุณไปยังขั้นตอนต่อไป …

source: The first step of normalization is complete for table '%s'.
th: การนอร์มัลไลเซชันขั้นตอนแรกเสร็จสมบูรณ์สำหรับตาราง '%s '

source: End of step
th: ขั้นตอนสุดท้าย

source: Second step of normalization (2NF)
th: ขั้นตอนที่สองของการนอร์มัลไลเซชัน (2NF)

source: Done
th: จบ

source: Confirm partial dependencies
th: ยืนยันการพึ่งพาบางส่วน

source: Selected partial dependencies are as follows:
th: การพึ่งพาบางส่วนที่เลือกไว้มีดังต่อไปนี้:

source: Note: a, b -> d,f implies values of columns a and b combined together can determine values of column d and column f.
th: หมายเหตุ: a, b -> d, f มีหมายความในเชิงว่า ค่าของคอลัมน์ a และ b ที่นำมารวมกันสามารถกำหนดค่าของคอลัมน์ d และคอลัมน์ f ได้

source: No partial dependencies selected!
th: ไม่ได้เลือกการพึ่งพาบางส่วน!

source: Show me the possible partial dependencies based on data in the table
th: แสดงความสัมพันธ์แบบพึ่งพาบางส่วนที่เป็นไปได้โดยอิงจากข้อมูลในตาราง

source: Hide partial dependencies list
th: ซ่อนรายการพึ่งพาบางส่วน

source: Sit tight! It may take few seconds depending on data size and column count of the table.
th: รอตรงนี้! มันอาจใช้เวลาไม่กี่วินาที ขึ้นอยู่กับขนาดข้อมูลและจำนวนคอลัมน์ของตาราง

source: Step
th: ขั้นตอน

source: The following actions will be performed:
th: จะมีการดำเนินการดังต่อไปนี้:

source: DROP columns %s from the table %s
th: ลบคอลัมน์ %s ทิ้งจากตาราง %s

source: Create the following table
th: สร้างตารางต่อไปนี้

source: Third step of normalization (3NF)
th: ขั้นตอนที่สามของการนอร์มัลไลเซชัน (3NF)

source: Confirm transitive dependencies
th: การยืนยันการพึ่งพาในช่วงการเปลี่ยนผ่าน

source: Selected dependencies are as follows:
th: การพึ่งพาที่เลือกไว้มีดังต่อไปนี้:

source: No dependencies selected!
th: ไม่มีการพึ่งพาที่ถูกเลือก!

source: Enter first value
th: ระบุค่าแรก

source: Enter second value
th: ระบุค่าที่สอง

source: Hide search criteria
th: ซ่อนเงื่อนไขการค้นหา

source: Show search criteria
th: แสดงเงื่อนไขการค้นหา

source: Column maximum:
th: คอลัมน์สูงสุด:

source: Column minimum:
th: คอลัมน์ต่ำสุด:

source: Hide find and replace criteria
th: ซ่อนเงื่อนไขการค้นหาและแทนที่

source: Show find and replace criteria
th: แสดงเงื่อนไขการค้นหาและแทนที่

source: Each point represents a data row.
th: แต่ละจุดแสดงถึงแถวข้อมูลหนึ่งแถว

source: Hovering over a point will show its label.
th: เลื่อนไปวางเหนือจุดใดจุดหนึ่ง จะแสดงป้ายกำกับของจุดนั้น

source: To zoom in, select a section of the plot with the mouse.
th: ในการซูมเข้า ให้เลือกส่วนใดส่วนหนึ่งของกราฟด้วยเมาส์

source: Click reset zoom button to come back to original state.
th: คลิกปุ่มรีเซ็ตการซูมเพื่อกลับสู่สถานะเดิม

source: Click a data point to view and possibly edit the data row.
th: คลิกที่จุดข้อมูลเพื่อดูและอาจแก้ไขข้อมูลในแถวนั้นได้

source: The plot can be resized by dragging it along the bottom right corner.
th: สามารถปรับขนาดกราฟได้โดยการลากที่มุมล่างขวา

source: Select two columns
th: เลือกสองคอลัมน์

source: Select two different columns
th: เลือกสองคอลัมน์ที่แตกต่างกัน

source: Data point content
th: เนื้อหาจุดข้อมูล

source: Point
th: จุด

source: Linestring
th: แถวข้อความ

source: Polygon
th: รูปหลายเหลี่ยม

source: Inner ring
th: กลุ่มวงใน

source: Outer ring
th: กลุ่มวงนอก

source: Add a point
th: เพิ่มจุด

source: Add a linestring
th: เพิ่มแถวข้อความ

source: Add an inner ring
th: เพิ่มกลุ่มวงใน

source: Add a polygon
th: เพิ่มรูปหลายเหลี่ยม

source: Add geometry
th: เพิ่มเรขาคณิต

source: Do you want to copy encryption key?
th: คุณต้องการคัดลอกคีย์การเข้ารหัสหรือไม่?

source: Encryption key
th: คีย์การเข้ารหัส

source: The HEX function will treat the integer as a string while calculating the hexadecimal value
th: ฟังก์ชัน HEX จะถือว่าจำนวนเต็มเป็นสตริงขณะคำนวณค่าเลขฐานสิบหก

source: MySQL accepts additional values not selectable by the slider; key in those values directly if desired
th: MySQL ยอมรับค่าเพิ่มเติมที่ไม่สามารถเลือกได้ด้วยแถบเลื่อน; กรอกค่าเหล่านั้นโดยตรง หากต้องการ

source: MySQL accepts additional values not selectable by the datepicker; key in those values directly if desired
th: MySQL ยอมรับค่าเพิ่มเติมที่ไม่สามารถเลือกได้ด้วยตัวเลือกวันที่; กรอกค่าเหล่านั้นโดยตรง หากต้องการ

source: Indicates that you have made changes to this page; you will be prompted for confirmation before abandoning changes
th: แจ้งให้ทราบว่าคุณได้ทำการเปลี่ยนแปลงรายละเอียดในหน้านี้; คุณจะได้รับการแจ้งให้ยืนยันก่อนที่จะละทิ้งการเปลี่ยนแปลง

source: Select referenced key
th: เลือกคีย์อ้างอิง

source: Select Foreign Key
th: เลือกคีย์นอก

source: Please select the primary key or a unique key!
th: กรุณาเลือกคีย์หลักหรือคีย์เฉพาะ!

source: You haven't saved the changes in the layout. They will be lost if you don't save them. Do you want to continue?
th: คุณยังไม่ได้บันทึกการเปลี่ยนแปลงในเลย์เอาท์ หากคุณไม่บันทึก การเปลี่ยนแปลงเหล่านั้นจะหายไป คุณต้องการดำเนินการต่อหรือไม่?

source: value/subQuery is empty
th: ค่า/คำสั่งเรียกดูย่อยว่างเปล่า

source: Page name
th: ชื่อหน้า

source: Delete page
th: ลบหน้า

source: Some tables saved in this page might have been renamed or deleted.
th: บางตารางที่บันทึกไว้ในหน้านี้อาจถูกเปลี่ยนชื่อหรือลบไปแล้ว

source: Please select a page to continue
th: กรุณาเลือกหน้าที่จะดำเนินต่อ

source: Please enter a valid page name
th: กรุณากรอกชื่อหน้าให้ถูกต้อง

source: Do you want to save the changes to the current page?
th: คุณต้องการที่จะบันทึกการเปลี่ยนแปลงในหน้าปัจจุบันหรือไม่?

source: Successfully deleted the page
th: ลบหน้าสำเร็จ

source: Export relational schema
th: ส่งออกแผนผังตารางความสัมพันธ์

source: Modifications have been saved
th: บันทึกการแก้ไขเรียบร้อยแล้ว

source: %d object(s) created.
th: สร้างแล้ว %d วัตถุ

source: Column name
th: ชื่อคอลัมน์

source: Press escape to cancel editing.<br>- Shift+Enter for a newline.
th: กดปุ่ม escape เพื่อยกเลิกการแก้ไข <br>- Shift+Enter เพื่อขึ้นบรรทัดใหม่

source: You have edited some data and they have not been saved. Are you sure you want to leave this page before saving the data?
th: คุณได้ทำการแก้ไขข้อมูลบางอย่าง แต่ยังไม่ได้บันทึก คุณแน่ใจว่าจะออกจากหน้านี้โดยยังไม่บันทึก?

source: Drag to reorder.
th: ลากเพื่อเรียงลำดับใหม่

source: Click to sort results by this column.
th: คลิกเพื่อเรียงผลลัพธ์ด้วยคอลัมน์นี้

source: Shift+Click to add this column to ORDER BY clause or to toggle ASC/DESC.<br>- Ctrl+Click or Alt+Click (Mac: Shift+Option+Click) to remove column from ORDER BY clause
th: Shift + คลิก เพื่อเพิ่มคอลัมน์นี้ไปยังประโยค ORDER BY หรือเพื่อสลับ ASC / DESC <br> - Ctrl + คลิกหรือ Alt + คลิก (Mac: Shift + Option + คลิก) เพื่อลบคอลัมน์จากประโยค ORDER BY

source: Click to mark/unmark.
th: คลิกเพื่อทำเครื่องหมาย/ยกเลิกทำเครื่องหมาย

source: Double-click to copy column name.
th: ดับเบิ้ลคลิกเพื่อคัดลอกชื่อคอลัมน์

source: This table does not contain a unique column. Features related to the grid edit, checkbox, Edit, Copy and Delete links may not work after saving.
th: ตารางนี้ไม่มีคอลัมน์ที่ไม่ซ้ำกัน ฟีเจอร์ที่เกี่ยวข้องกับการแก้ไขตาราง การเลือกช่องทำเครื่องหมาย การแก้ไข คัดลอก และลบลิงก์อาจใช้งานไม่ได้หลังการบันทึก

source: Please enter a valid hexadecimal string. Valid characters are 0-9, A-F.
th: โปรดกรอกเลขฐานสิบหกที่ถูกต้อง ตัวอักษรที่ถูกต้องจะมี 0-9 และ A-F

source: Do you really want to see all of the rows? For a big table this could crash the browser.
th: คุณต้องการแสดงข้อมูลทั้งหมดจริงหรือไม่? สำหรับตารางที่มีขนาดใหญ่ อาจทำให้เบราว์เซอร์ขัดข้องได้

source: Original length
th: ความยาวดั้งเดิม

source: cancel
th: ยกเลิก

source: Aborted
th: ยกเลิกแล้ว

source: Success
th: สำเร็จ

source: Import status
th: สถานะการนำเข้า

source: Select database first
th: เลือกฐานข้อมูลก่อน

source: Go to link:
th: ไปที่ลิงก์:

source: Generate password
th: สร้างรหัสผ่าน

source: Show panel
th: แสดงแผง

source: Hide panel
th: ซ่อนแผง

source: Unlink from main panel
th: ยกเลิกเชื่อมกับแผงหลัก
